000010 FD  CRDMEM    LABEL RECORD STANDARD
000020		     VALUE OF FILE-ID W02-CRDMEM.
000030 01  CME-RECORD1.
	   03  CME-KEY.
	       05  CME-AC      PIC  X(06).
	       05  CME-SEQ     PIC  9(04).
	   03  CME-DATA        PIC  X(60).
