000010 FD  CRMOLD    LABEL RECORD STANDARD
000020		     VALUE OF FILE-ID W02-CRMOLD
                     RECORDING MODE IS VARIABLE.
000030 01  CMO-RECORD1.
	   03  CMO-KEY.
	       05  CMO-AC      PIC  X(06).
	       05  CMO-SEQ     PIC  9(04).
	   03  CMO-DATA        PIC  X(60).
