000010 FD  DBMEMO    LABEL RECORD STANDARD
000020		     VALUE OF FILE-ID W02-DBMEMO.
000030 01  DMO-RECORD1.
	   03  DMO-KEY.
	       05  DMO-AC      PIC  X(06).
	       05  DMO-SEQ     PIC  9(02).
	   03  DMO-DATA        PIC  X(60).
