000010 FD  DBMOLD    LABEL RECORD STANDARD
000020               VALUE OF FILE-ID W02-DBMOLD
                     RECORDING MODE IS VARIABLE.
000030 01  DMO-RECORD1.
           03  DMO-KEY.
               05  DMO-AC      PIC  X(06).
	       05  DMO-SEQ     PIC  9(04).
           03  DMO-DATA        PIC  X(60).
