      /
000010 FD  DBNOTE    LABEL RECORD STANDARD
000020		     VALUE OF FILE-ID W02-DBNOTE.
000030 01  DBN-RECORD1.
	   03  DBN-CRED        PIC  X(06).
000040	   03  DBN-STOCK       PIC  X(18).
	   03  DBN-ITM	       PIC  X(03).
	   03  DBN-REF	       PIC  X(08).
000080	   03  DBN-INV	       PIC  X(08).
000120	   03  DBN-IUN	       PIC S9(07)V99  COMP-3.
000130	   03  DBN-ICOST       PIC S9(07)V999 COMP-3.
000150	   03  DBN-COST        PIC S9(09)V99  COMP-3.
