      /
000010 FD  DTBTCH    LABEL RECORD STANDARD
000020		     VALUE OF FILE-ID W02-DTBTCH.
000030 01  BCH-RECORD1.
	   03  BCH-KEY.
000170	       05  BCH-AC      PIC  X(06).
000060	       05  BCH-DATE    PIC  9(08)    COMP.
000040	       05  BCH-CODE    PIC  9(02).
000070	       05  BCH-REF     PIC  X(08).
000100	   03  BCH-VALUE       PIC S9(09)V99 COMP.
