      /
000010 FD  EGGSLE    LABEL RECORD STANDARD
000020               VALUE OF FILE-ID W02-EGGSLE.
000030 01  EGG-RECORD1.
           03  EGG-KEY.
               05  EGG-COMP    PIC  9(02).
               05  EGG-CODE    PIC  X(14).
               05  EGG-REF     PIC  9(07).
               05  EGG-SEQ     PIC  9(04).
           03  EGG-QTY         PIC S9(07)V99 COMP-3.
