      /
002000 FD  GBHOLD    LABEL RECORD IS STANDARD
002010		     VALUE OF FILE-ID IS W02-GBHOLD
		     RECORDING MODE IS VARIABLE.
002020 01  GHO-REC.
	   03  GHO-KEY.
	       05  GHO-FILE    PIC  X(03).
	       05  GHO-ID      PIC  X(01).
002030	   03  GHO-DATE        PIC  9(08).
002080	   03  GHO-DESC        PIC  X(40).
002130	   03  GHO-DT	       PIC S9(09)V99 COMP-3.
002130	   03  GHO-CR	       PIC S9(09)V99 COMP-3.
