      /
002080 FD  GLINST    LABEL RECORD STANDARD
002090               VALUE OF FILE-ID W02-GLINST.
002100 01  INS-REC1.
002110	   03  INS-NAR		   PIC X(40).
002120	   03  INS-VALUE	   PIC 9(09)V99  COMP-3.
002130     03  INS-ACCR            PIC 9(06)     COMP-3.
002140     03  INS-ACDT            PIC 9(06)     COMP-3.
