000010 FD  ITMOLD    LABEL RECORD STANDARD
000020		     VALUE OF FILE-ID W02-ITMOLD
000220		     RECORDING MODE IS VARIABLE.
000030 01  ITO-RECORD1.
	   03  ITO-MODEL-NO    PIC  X(24).
	   03  ITO-DESC.
	       05  ITO-DKEY    PIC  X(14).
	       05  FILLER      PIC  X(26).
