      /
000010 FD  JOBSTAT   LABEL RECORD STANDARD
000020		     VALUE OF FILE-ID W02-JOBSTAT.
000030 01  JST-REC1.
	   03  JST-KEY.
	       05  JST-CODE    PIC  X(03).
	   03  JST-DESC        PIC  X(30).
	   03  FILLER	       PIC  X(13).
