      /
000010 FD  JOBWAR    LABEL RECORD STANDARD
000020		     VALUE OF FILE-ID W02-JOBWAR.
000030 01  JBW-REC1.
	   03  JBW-KEY.
000050	       05  JBW-JOB     PIC  X(08).
	       05  JBW-SEQ     PIC  9(02).
	   03  JBW-OLD-ITEM    PIC  X(18).
	   03  JBW-NEW-ITEM    PIC  X(18).
	   03  JBW-OLD-SER     PIC  X(18).
	   03  JBW-NEW-SER     PIC  X(18).
