      /
000010 FD  JRMOLD    LABEL RECORD STANDARD
000020		     VALUE OF FILE-ID W02-JRMOLD
000220		     RECORDING MODE IS VARIABLE.
000030 01  JRO-REC1.
	   03  JRO-KEY.
	       05  JRO-CODE    PIC  X(06).
	   03  JRO-REMK1       PIC  X(40).
	   03  JRO-REMK2       PIC  X(40).
	   03  JRO-REMK3       PIC  X(40).
	   03  JRO-REMK4       PIC  X(40).
