      /
000010 FD  JSTOLD    LABEL RECORD STANDARD
000020		     VALUE OF FILE-ID W02-JSTOLD
000220		     RECORDING MODE IS VARIABLE.
000030 01  JSO-REC1.
	   03  JSO-KEY.
	       05  JSO-CODE    PIC  X(03).
	   03  JSO-DESC        PIC  X(30).
	   03  FILLER	       PIC  X(13).
