      /
000010 FD  JWAOLD    LABEL RECORD STANDARD
000020		     VALUE OF FILE-ID W02-JWAOLD
000220		     RECORDING MODE IS VARIABLE.
000030 01  JWO-REC1.
	   03  JWO-KEY.
000050	       05  JWO-JOB     PIC  X(08).
	       05  JWO-SEQ     PIC  9(02).
	   03  JWO-OLD-ITEM    PIC  X(18).
	   03  JWO-NEW-ITEM    PIC  X(18).
	   03  JWO-OLD-SER     PIC  X(18).
	   03  JWO-NEW-SER     PIC  X(18).
