000010 FD  STKPRC    LABEL RECORD STANDARD
000020		     VALUE OF FILE-ID W02-STKPRC.
000030 01  PRC-RECORD1.
000040	   03  PRC-CODE        PIC  X(14).
	   03  PRC-ITM	       PIC  X(03).
000110	   03  PRC-COST        PIC S9(06)V999 COMP-3.
000120	   03  PRC-SELL        PIC S9(07)V99 COMP-3.
000130	   03  PRC-CASH        PIC S9(07)V99 COMP-3.
000130	   03  PRC-WSALE       PIC S9(07)V99 COMP-3.
