      /
000010 FD  UNTSLE    LABEL RECORD STANDARD
000020               VALUE OF FILE-ID W02-UNTSLE.
000030 01  UNT-RECORD1.
           03  UNT-KEY.
	       05  UNT-EXT-CODE.
		  07  UNT-CODE PIC  X(14).
		  07  UNT-ITM  PIC  X(03).
		  07  FILLER   PIC  X(01).
               05  UNT-REF     PIC  9(07).
               05  UNT-SEQ     PIC  9(04).
           03  UNT-QTY         PIC S9(07)V99 COMP-3.
