      /
000010 FD  ROUTE     IS EXTERNAL
		     LABEL RECORD STANDARD
000020               VALUE OF FILE-ID W02-ROUTE.
000030 01  RTE-RECORD1.
	   03  RTE-ROUTE       PIC  X(08).
	   03  RTE-DESC        PIC  X(40).
