      /
000010 FD  STKWRK   LABEL RECORD STANDARD
000020		    VALUE OF FILE-ID W02-STKWRK.
       01  STW-RECORD.
	   03  STW-DEPT        PIC  X(04).
	   03  STW-SL-TOTAL    PIC S9(09)V99 COMP-3.
