000010 FD  STMOLD    LABEL RECORD STANDARD
000020               VALUE OF FILE-ID W02-STMOLD
                     RECORDING MODE IS VARIABLE.
000030 01  SMO-RECORD1.
	   03  SMO-KEY.
	       05  SMO-CODE.
		   07  SMO-ITEM  PIC  X(14).
		   07  SMO-ITM	 PIC  X(03).
		   07  FILLER	 PIC  X(01).
	       05  SMO-SEQ	 PIC  X(01)	COMP-X.
	       05  SMO-SEQ2	 PIC  X(01)	COMP-X.
	   03  SMO-DATA 	 PIC  X(60).
