      /
000010 FD  UNTOLD    LABEL RECORD STANDARD
000020               VALUE OF FILE-ID W02-UNTOLD
                     RECORDING MODE IS VARIABLE.
000030 01  UNO-RECORD1.
           03  UNO-KEY.
               05  UNO-LEDG    PIC  9(03).
           03  FILLER          PIC  X(01).
           03  UNO-DESC        PIC  X(30).
           03  UNO-QTY         PIC S9(09)V99 COMP-3.
