      /
000010 FD  VEHICLE   LABEL RECORD STANDARD
000020		     VALUE OF FILE-ID W02-VEHICLE.
000030 01  VEH-RECORD1.
000040	   03  VEH-CODE        PIC  X(10).
000080	   03  VEH-NAME.
000090	       05  VEH-NKEY    PIC  X(12).
000100         05  FILLER      PIC  X(28).
000160	   03  VEH-TEL	       PIC  X(14).
	   03  VEH-DRIVER      PIC  X(30).
	   03  VEH-ROUTE       PIC  X(08).
