      /
000010 FD  VEHSTK    LABEL RECORD STANDARD
000020		     VALUE OF FILE-ID W02-VEHSTK.
000030 01  VST-RECORD1.
	   03  VST-EXT-CODE.
000040	       05  VST-CODE    PIC  X(14).
000060	       05  VST-ITM     PIC  X(03).
	       05  FILLER      PIC  X(01).
	   03  VST-REG	       PIC  X(10).
	   03  VST-DATE        PIC  9(06)	COMP-3.
000110	   03  VST-QUANT       PIC S9(07)V9(04) COMP-3.
	   03  FILLER	       PIC  X(27).
