       01  W30-PURDEX.
	   03  W30-STAT        PIC  X(01) VALUE "C".
	   03  W30-SUPP        PIC  X(05).
	   03  W30-CODE        PIC  X(14).
	   03  W30-DTE	       PIC  9(06)    COMP.
	   03  W30-SEQ	       PIC  9(02)    COMP.
	   03  W30-TRAN        PIC  X(01).
	   03  W30-REF	       PIC  X(08).
000250	   03  W30-QNT	       PIC S9(07)V99 COMP-3.
	   03  W30-COST        PIC S9(07)V99 COMP-3.
	   03  W30-NAME        PIC  X(40).
	   03  W30-WHSE        PIC  X(06).
