000010 01  W70-CONTROL.
	   03  W70-SUSGL       PIC 9(06)     COMP-3.
000020	   03  W70-DEBGL       PIC 9(06)     COMP-3.
000030	   03  W70-CREGL       PIC 9(06)     COMP-3.
000040	   03  W70-INTGL       PIC 9(06)     COMP-3.
000050	   03  W70-BNKGL       PIC 9(06)     COMP-3.
000060	   03  W70-UNPROF      PIC 9(06)     COMP-3.
