       01  W70-GLCON.
001010     03  W70-GACCNT      PIC 9(04)     COMP-5.
           03  W70-GLMAX       PIC 9(04)     COMP-5.
           03  W70-GLTRAN      PIC 9(04)     COMP-5.
001060     03  W70-GLINST      PIC 9(04)     COMP-5.
        01 W70-GLREC.
           03  FILLER          PIC X(266).
