       01  W70-STKCON.
           03  W70-STOCK       PIC 9(04)     COMP-5.
           03  W70-STKMAX      PIC 9(04)     COMP-5.
           03  W70-SINDEX      PIC 9(04)     COMP-5.
           03  W70-BINDEX      PIC 9(04)     COMP-5.
           03  W70-SPARTS      PIC 9(04)     COMP-5.
       01  W70-STKREC.
	   03  FILLER	       PIC X(256).
