      $set LINKCOUNT"704"
      ******************************************************************
      *                                                                *
      *   ********  **	   **  *******	 ********    ****    ********  *
      *      **     ***    **  **    **  **	    **	**	  **   *
      *      **     ** *   **  **    **  **	   **	 **	 **    *
      *      **     **	*  **  *******	 *****	   **	 **	**     *
      *      **     **	 * **  **	 **	   **	 **    **      *
      *      **     **	  ***  **	 **	    **	**     **      *
      *   ********  **	   **  **	 **	     ****      **      *
      *                                                                *
      *     ENGLISH                                                    *
      *                                                                *
      *     I N V O I C I N G	P R O G R A M	-   ( C O N S O L )    *
      *                                                                *
      *     VERSION 8.13.07 - March 2008			       *
      * 							       *
      ******************************************************************
000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID.     INPF07.
000030 AUTHOR.         J.W.LEMMON (APAC).
000040 DATE-WRITTEN.   JANUARY 1995.

		   COPYRIGHT NOTICE: COPYRIGHT (C) 1995 - 2008
				     by James William Lemmon.
				       (Id No. 4412165050082).

		   All rights reserved.

		   e-mail jwlemmon@gmail.com.

000050 SECURITY.
		   This program is free software; you can redistribute
		   it and/or modify it under the terms of the GNU General
		   Public License as published by the Free Software
		   Foundation; either version 2 of the License, or (at
		   your option) any later version.

		   This program is distributed in the hope that it will
		   be useful, but WITHOUT ANY WARRANTY; without even the
		   implied warranty of MERCHANTABILITY or FITNESS FOR A
		   PARTICULAR PURPOSE.	See the GNU General Public License
		   for more details.

		   You should have received a copy of the GNU General
		   Public License along with this program; if not, write
		   to the Free Software Foundation, Inc., 59 Temple Place
		   - Suite 330, Boston, MA 02111-1307, USA.

000050 ENVIRONMENT DIVISION.
000060 CONFIGURATION SECTION.
000070 SPECIAL-NAMES.
000080		       CURSOR IS CSTART
000090		       CONSOLE IS CRT
		       CRT STATUS IS KEY-STATUS.
000100 INPUT-OUTPUT SECTION.
000110 FILE-CONTROL.

       COPY APACFIDS.SL.

000130 COPY AUDIT.SL.

000150 COPY CONTROL.SL.

000170 COPY DBTRAN.SL.

000190 COPY DEBTOR.ISL.

000210 COPY DEPART.SL.

000250 COPY INVOIC.SL.

       COPY LEDTRF.SL.

000270 COPY PARAM.SL.

000290 COPY RECOVER.SL.

000310 COPY SALE.SL.

       COPY SHARED.SL.

000350 COPY TXTRAN.SL.

000370     SELECT PRNREP  ASSIGN W02-PRINTER
000380                    ORGANIZATION LINE SEQUENTIAL.
      /
000390 DATA DIVISION.
000400 FILE SECTION.

       COPY APACFIDS.FDE.

000420 COPY AUDIT.FDE.

000440 COPY CONTROL.FDE.

000460 COPY DBTRAN.FDE.

000480 COPY DEBTOR.FDE.

000500 COPY DEPART.FDE.

000540 COPY INVOIC.FDE.

       COPY LEDTRF.FDE.

000560 COPY PARAM.FDE.

000580 COPY RECOVER.GFD.

000600 COPY SALE.FDE.

       COPY SHARED.FDE.

000640 COPY TXTRAN.FDE.

000660 FD  PRNREP    LABEL RECORD OMITTED
000670               LINAGE WS-PGE-LENGTH.
000680 01  REP-LINE1.
000690	   03  REP-DETAIL1     PIC X(132).
000700 01  REP-L1.
000710     03  FILLER          PIC X(10).
000720     03  BAL-REP         PIC X(60).
000730     03  FILLER          PIC X(10).
000740 01  REP-LINE2.
000750	   03  REP-DETAIL2     PIC X(132).
000910 01  INV-L1.
	   03  INV-EXP	       PIC  X(01).
000920	   03  FILLER	       PIC  X(03).
	   03  INV-EXPNAME     PIC  X(40).
	   03  FILLER	       PIC  X(88).
       01  INV-L2.
	   03  FILLER	       PIC  X(06).
000930	   03  INV-NADD        PIC  X(44).
000940     03  INV-RADD      REDEFINES INV-NADD.
000950	       05  INV-PC      PIC  X(04).
000960	       05  FILLER      PIC  X(40).
	   03  FILLER	       PIC  X(40).
001120	   03  INV-H2	       PIC  X(16).
001130	   03  INV-TEL	       PIC  X(14).
	   03  INV-GNO REDEFINES INV-TEL
			       PIC  X(14).
	   03  FILLER	       PIC  X(12).
000980 01  INV-L3.
000990	   03  FILLER	       PIC  X(06).
001000	   03  INV-NAME        PIC  X(40).
001010     03  INV-DADD      REDEFINES INV-NAME.
001020	       05  INV-PC1     PIC  X(04).
001030	       05  FILLER      PIC  X(36).
001040	   03  FILLER	       PIC  X(06).
	   03  INV-H3	       PIC  X(08).
001060	   03  INV-DADD2.
001070	       05  INV-PC2     PIC  X(30).
001090	   03  FILLER	       PIC  X(10).
	   03  INV-H4	       PIC  X(19).
001550	   03  INV-ORD.
	       05  INV-TERMS.
		   07  FILLER  PIC  X(05).
		   07  INV-AC.
		       09  FILLER  PIC	X(03).
		       09  INV-PGE PIC	ZZ9.
	       05  FILLER      PIC  X(01).
	   03  FILLER	       PIC  X(01).
001100 01  INV-L4.
001110	   03  FILLER	       PIC  X(09).
001490	   03  INV-H5	       PIC  X(67).
001140	   03  INV-H6	       PIC  X(20).
001510	   03  INV-H7	       PIC  X(15).
	   03  INV-H8	       PIC  X(21).
001150 01  INV-L5.
001750	   03  FILLER	       PIC  X(09).
001790	   03  INV-MES.
001810	       05  INV-DESC    PIC  X(60).
	   03  FILLER	       PIC  X(04).
	   03  INV-EXCL        PIC  Z(09)9.99- BLANK WHEN ZERO.
	   03  FILLER	       PIC  X(04).
001910	   03  INV-TAX	       PIC  Z(09)9.99- BLANK WHEN ZERO.
001940	   03  FILLER	       PIC  X(04).
001950	   03  INV-VAL	       PIC  Z(09)9.99- BLANK WHEN ZERO.
001960	   03  FILLER	       PIC  X(09).
       01  INV-L6.
001980	   03  FILLER	       PIC  X(09).
001990	   03  INV-REMKS.
002010	       05  INV-RMKS.
		 07  FILLER    PIC  X(40).
002020	   03  FILLER	       PIC  X(12).
	   03  INV-H13	       PIC  X(12).
	   03  INV-LINE        PIC  X(45).
	   03  FILLER	       PIC  X(09).
       01  INV-L8.
	   03  INV-EXP2        PIC  X(01).
001540	   03  FILLER	       PIC  X(16).
	   03  INV-INVOICE.
	       05  FILLER      PIC  X(03).
	       05  INV-CRNOTE.
		   07  FILLER  PIC  X(06).
		   07  INV-COPY
			       PIC  X(12).
		   07  FILLER  PIC  X(06).
	       05  FILLER      PIC  X(03).
	   03  FILLER	       PIC  X(02).
	   03  INV-H14	       PIC  X(08).
	   03  INV-REF.
	       05  INV-DTE     PIC  99/99/9999.
      /
002130 WORKING-STORAGE SECTION.
       77  WS-CHECK	   PIC	X(18)	 VALUE
			   "aeWlimemnomLalismJ".
002140 77  WS-DISC	   PIC	99V99	 COMP-3.
002150 77  WS-TDISC        PIC  99V99    COMP-3.
002160 77  WS-CASH-AC      PIC  X(06).
002170 77  WS-SUB          PIC  9(04)    COMP-5.
002170 77  WS-SUPER        PIC  9(02)    COMP-5.
002180 77  WS-S1           PIC  9(04)    COMP-5.
002190 77  WS-S2           PIC  9(04)    COMP-5.
002200 77  WS-S3           PIC  9(04)    COMP-5.
002210 77  WS-S4           PIC  9(04)    COMP-5.
002220 77  WS-S5           PIC  9(04)    COMP-5.
002230 77  WS-S6           PIC  9(04)    COMP-5.
002240 77  WS-S7           PIC  9(04)    COMP-5.
002250 77  WS-S8           PIC  9(04)    COMP-5.
002260 77  WS-S9           PIC  9(04)    COMP-5.
002270 77  WS-IXS          PIC  9(04)    COMP-5.
002280 77  WS-IXS1         PIC  9(04)    COMP-5.
002290 77  WS-IXS2         PIC  9(04)    COMP-5.
002300 77  WS-IXS3         PIC  9(04)    COMP-5.
002310 77  WS-IXS4         PIC  9(04)    COMP-5.
002320 77  WS-PARKEY       PIC  9(04)    COMP-5.
001690 77  WS-ENQPOS	   PIC	9(06)	 COMP-5.
001700 77  WS-ENQEND       PIC  9(06)    COMP-5.
002350 77  WS-KEYSTR       PIC  9(06)    COMP-5.
002380 77  WS-SALSTR	   PIC	9(04)	 COMP-5.
002390 77  WS-SALKEY       PIC  9(04)    COMP-5.
002400 77  WS-NETKEY       PIC  9(04)    COMP-5.
002410 77  WS-AUDKEY       PIC  9(06)    COMP-5.
002420 77  WS-RECKEY       PIC  9(06)    COMP-5.
002430 77  WS-RECOVER      PIC  9(06)    COMP-5.
000820 77  WS-SHARED	   PIC	9(04)	 COMP-5 VALUE 1.
000820 77  WS-STOCK	   PIC	X(01).
002440 77  WS-TRANS        PIC  9(06)    COMP-5 VALUE 1.
002450 77  WS-INV	   PIC	9(01).
           88  STD-INV     VALUE 1.
           88  COND-INV    VALUE 2.
           88  ALT-INV     VALUE 3.
002450 77  WS-GAR          PIC  9(01) VALUE 0.  
002450 77  WS-PRN1         PIC  9(01) VALUE 0.  
002460 77  WS-PRN2         PIC  9(01) VALUE 0.  
       77  WS-NUM          PIC  Z9.
002470*77  WS-ADV-RATE	   PIC	9(03)V99 COMP-3.
      *77  WS-ADVALOREM    PIC	X(01).
002480 77  WS-START        PIC  9(08).
002490 77  WS-END          PIC  9(08).
002510 77  WS-TME2         PIC  9(08).
002520 77  WS-PORT         PIC  9(05) VALUE 1004.
002530 77  WS-OPEN         PIC  X(01) VALUE X"01".
002540 77  WS-CLOSE        PIC  X(01) VALUE X"00".
002550 77  WS-PAR          PIC  9(01) VALUE 0.
002560 77  WS-INO          PIC  9(02) VALUE 0.
002570 77  WS-LINES	   PIC	9(02) VALUE 0.
002580 77  WS-FIRST	   PIC	9(03) VALUE 0.
002590 77  WS-LAST	   PIC	9(03) VALUE 0.
002600 77  WS-LASTINV      PIC  9(04)    COMP-5.
002610 77  WS-LINE         PIC  9(04)    COMP-5.
002620 77  WS-PAGE         PIC  9(02)    COMP-5.
002630 77  WS-L1           PIC  9(04)    COMP-5.
002570 77  WS-PGE-LENGTH   PIC	9(02)	 VALUE 66.
001870 77  WS-PRN-LENGTH   PIC	9(02)	 VALUE 62.
003650 77  WS-COND	   PIC	X(06).
003660 77  WS-NORM	   PIC	X(06).
003070 77  WS-EXPP	   PIC	X(06).
003080 77  WS-ECAN	   PIC	X(06).
003090 77  WS-8LPI	   PIC	X(06).
003100 77  WS-6LPI	   PIC	X(06).
       77  WS-10CPI	   PIC	X(06).
       77  WS-12CPI	   PIC	X(06).
       77  WS-17CPI	   PIC	X(06).
002750 77  WS-OPTION	   PIC	X(01).
002770 77  WS-SKIP         PIC  X(01) VALUE " ".
002780 77  WS-LOOK         PIC  X(01) VALUE "S".
002790 77  WS-ETYPE        PIC  X(01) VALUE "I".
002820 77  WS-ERROR        PIC  9(01).
002840 77  WS-CHAR1	   PIC	X(01).
002850 77  WS-CHAR2        PIC  X(01).
002860 77  WS-COMP         PIC  9(01).
002870 77  WS-UPDATE       PIC  9(01) VALUE ZERO.
002880 77  WS-CONREC       PIC  9(01) VALUE ZERO.
002890 77  WS-HEAD         PIC  X(01).
002900 77  WS-TYPE         PIC  X(01).
002910 77  WS-AGE          PIC  X(01).
002920 77  WS-PRC          PIC  X(01).
002920 77  WS-INPUT        PIC  X(01) VALUE "N".
002920 77  WS-COPY         PIC  X(01) VALUE "N".
002920 77  WS-NOSELL       PIC  X(01) VALUE "N".
       77  WS-PRNINV       PIC  X(01) VALUE "Y".
002950 77  WS-BATCH        PIC  9(05).
003020 77  WS-PER          PIC  Z(02)9.99.
003030 77  WS-CR           PIC  X(01).
003040 77  WS-TAXRES       PIC  S9(07)V9(08) COMP-3.
003040 77  WS-BAL          PIC  S9(09)V9(02) COMP-3.
       77  TODAY-DDMMYY	   PIC	9(08) COMP-5.
       77  WS-USUB	   PIC	9(04) COMP-5.
000070 77  WS-DRAW	   PIC	9(02).
      /
003050 01  WS-DB-LINE.
003080	   03  WS-TOP-LNE2.
003090	       05  WS-TCR  PIC X(80) VALUE "旼컴컴컴컴컴컴컴컴컴컴컴컴컴
      - 	 "컴컴컴컴컴컴컴컴컴컴컴컴컴컴컴컴컴컴컴컴컴컴컴컴컴커".
003100	   03  WS-TP-LINE2 REDEFINES WS-TOP-LNE2.
003110	       05  FILLER      PIC  X(01).
003120	       05  WS-TOP-COMP PIC  X(40).
003130	       05  FILLER      PIC  X(39).
003160	   03  WS-MID-LNE2.
	       05  FILLER      PIC  X(01) VALUE "�".
	       05  WS-BLNK78   PIC  X(78) VALUE ALL "�".
	       05  FILLER      PIC  X(01) VALUE "�".

003480 COPY WS.WS.

       COPY LEDTRF.WS.

003520 01  W00-TRAN-CODES.
003530     03  W00-T-VAT   PIC S9(09)V99 COMP-3.
003540     03  W00-E-DESC  PIC  X(12).
003550     03  W00-A-DESC  PIC  X(12).
003560     03  W00-ACTION  PIC  9(01).
003570     03  W00-T-CODE  PIC  9(02)    COMP-5.
003580     03  W00-T-GL    PIC  9(06)    COMP-3.
003590     03  W00-T-DAY   PIC  9(06)    COMP-5.
003600     03  W00-T-VAL   PIC S9(09)V99 COMP-3.
003610     03  W00-T-MTD   PIC  9(06)    COMP-5.
003620     03  W00-T-MTDV  PIC S9(09)V99 COMP-3.
003630     03  W00-T-YTD   PIC  9(06)    COMP-5.
003640     03  W00-T-YTDV  PIC S9(09)V99 COMP-3.

000290 01  WS-PARID.
000020	   03  WS-SYS-ID       PIC  X(03).

003660 01  W02-FID.

       COPY APACFIDS.ID.

003680 COPY AUDIT.ID.

003700 COPY CONTROL.ID.

003720 COPY DBTRAN.ID.

003740 COPY DEBTOR.ID.

003760 COPY DEPART.ID.

       COPY LEDTRF.ID.

003800 COPY INVOIC.ID.

       COPY PARAM.ID.

003820 COPY RECOVER.ID.

003840 COPY SALE.ID.

       COPY SHARED.ID.

003880 COPY TXTRAN.ID.

003900 01  W02-FILE-IDS.
003910     03  W02-PRINTER.
	       05  W02-REPORT PIC X(07) VALUE "INPF07.".
               05  W02-USER   PIC X(05) VALUE SPACES.
	   03  W02-INVOICE.
	       05  W02-REPORT PIC X(07) VALUE "INVPRN.".
	       05  W02-IUSE   PIC X(05) VALUE SPACES.
           03  W02-CRED-NOTE.
               05  W02-CREP   PIC X(07) VALUE "CRNPRN.".
               05  W02-CUSE   PIC X(05) VALUE SPACES.
	   03  W02-CSHDRW     PIC X(04) VALUE "COM1".

       COPY W05.VAT.

       COPY W10.PRO.

       COPY W12.WS.

004610 01  W15-DISCOUNT.
004620     03  W15-DISC        PIC S9(03)V99 COMP-3 OCCURS 10.

       01  W15-EXTRA.
	   03  W15-LEDG        PIC  X(04).

       COPY W20.WS.

004720 01  W25-CALCS.
004730     03  W25-RESULT      PIC 9(05)V99.
004740     03  W25-RESULT1 REDEFINES W25-RESULT.
004750         05  W25-WHOLE   PIC 9(03).
004760         05  W25-DECIMAL PIC 9(02).
           03  W25-RESULT2 REDEFINES W25-RESULT.
               05  W25-KEY     PIC 9(04).
               05  W25-SUB     PIC 9(01).
               05  FILLER      PIC 9(02).
004770     03  W25-TOTAL       PIC 9(07)V99  COMP-3.
004780     03  W25-VALUE       PIC S9(07)V99 COMP-3.
004790     03  W25-CREDIT      PIC S9(07)V99 COMP-3.
004800 01  W30-MESSAGE.
004810     03  W30-PERC        PIC Z9.99.
004820     03  FILLER          PIC  X(40) VALUE 
004830         "% Settlement discount if paid in 30 DAYS".

       COPY W40.DBT.

       COPY W40.WS.

003890 01  W45-TRAN.
003900     03  W45-CODE        PIC 9(02).
003910     03  W45-ENG         PIC X(12).
003920     03  W45-AFR         PIC X(12).
003930     03  W45-ACT         PIC X(01).

       COPY FUNCTION.WS.

005610 COPY W50.WS.

003550 01  W60-NME-ADD.
003560     03  W60-NAME.
003570         05  W60-NCHAR OCCURS 40 PIC X(01).
003580     03  W60-ADDRESS.
003590         05  W60-ACHAR OCCURS 70 PIC X(01).
003580     03  W60-ADDR REDEFINES W60-ADDRESS.
               05  W60-ADD     PIC X(60).
               05  FILLER      PIC X(10).
003600     03  W60-ADDRESS1.
               05  W60-PAD     PIC X(60).
               05  FILLER      PIC X(10).
005690     03  W60-ITM.
005700         05  W60-ICHAR OCCURS 14 PIC X(01).

005810 COPY W70DEBT.IWS.

005880 01  W75-TITLES.
005890     03  W75-DESCRIP.
005900         05  FILLER      PIC X(28)      VALUE
005910                     "Mr     Mnr    Mrs    Mev    ".
005920         05  FILLER      PIC X(28)      VALUE
005930                     "Miss   Mej    Ms     Ms     ".
005940         05  FILLER      PIC X(28)      VALUE
005950                     "Dr     Dr     Rev    Ds     ".
005960         05  FILLER      PIC X(28)      VALUE
005970                     "Prof   Prof   The HonSy Edel".
005980         05  FILLER      PIC X(28)      VALUE
005990                     "                            ".
006000     03  W75-CODES REDEFINES W75-DESCRIP.
006010         05  W75-TITLE  OCCURS 10.
006020             07  W75-ETITLE PIC X(07).
006030             07  W75-ATITLE PIC X(07).
006040 01  W80-ACCOUNT.
006050     03  W80-ACNO        PIC X(06).
006060     03  W80-CRED REDEFINES W80-ACNO.
006070         05  W80-CNO     PIC 9(05).
006080         05  W80-CAC REDEFINES W80-CNO.
006090             07  W80-CTYPE PIC 9(01).
006100             07  W80-SER   PIC 9(04).
006110         05  FILLER        PIC 9(01).
006120     03  W80-TYPE        PIC 9(01).

       COPY W90.DBT.

       COPY W95.STM.

007010 01  W100-EDIT.
007020     03  W100-LBAL       PIC Z(06)9.99-.
007030     03  W100-LARR       PIC Z(06)9.99.
007040     03  W100-BAL        PIC Z(08)9.99-.
007050     03  W100-CUR        PIC Z(08)9.99-.
007060     03  W100-30         PIC Z(08)9.99-.
007070     03  W100-60         PIC Z(08)9.99-.
007080     03  W100-90         PIC Z(08)9.99-.
007090     03  W100-120        PIC Z(08)9.99-.
007100     03  W100-INT        PIC Z(08)9.99-.
007110     03  W100-CRL        PIC Z(06)9.
           03  W100-SER        PIC ZZ9.
007120     03  W100-V2.
007130         05  W100-S6V2   PIC Z(05)9.99-.
007140     03  W100-V3 REDEFINES W100-V2.
007150         05  W100-PRICE  PIC X(09).
007160         05  FILLER      PIC X(01).
007170     03  W100-V4 REDEFINES W100-V2.
007180         05  W100-EXT    PIC Z(06)9.99.
           03  W100-V5 REDEFINES W100-V2.
               05  W100-QNT    PIC Z(05)9.99-.

       LINKAGE SECTION.

       COPY CHAIN.LS.

      /
007190 SCREEN SECTION.

       COPY BLANK.CRT.

       COPY ERROR.CRT.

       COPY OPT.CRT.

      /
010220 PROCEDURE DIVISION USING LS-PARID
				LS-USER-ID
				LS0-PROGRAMS
				W40-COMPANY
				W90-TRAN.
010230 AA000-MAIN      SECTION.
010240 AA000-INIT.
010250       PERFORM ZA000-INIT.
	     MOVE ZERO		 TO WS-PAGE.
      *    IF W40-PRNINV = "Y"
      *        PERFORM BB050
      *    ELSE
	   IF W40-REPRINT = "Y"
	       PERFORM BE000
	   ELSE
016330	       PERFORM BC000.
010410	       GO TO AZ000-EOJ.

       COPY ERROR.SCR.

       COPY FUNCTION.SCR.

010930 COPY LOCKED.RC2.

010950 COPY CLEAR.CRT.

010970 COPY DEBTOR.TRN.

      /
      *    ****    READ FILES ROUTINES
      *
011110 AC000              SECTION.

011130 COPY AUDIT.RD.

011150 COPY CONTROL.RD.

011170 COPY DBTRAN.RD1.

011190 COPY DEBTOR.RDI.

011210 COPY DEPART.RD.

       COPY LEDTRF.RD.

011250 COPY INVOIC.RD.

011270 COPY PARAM.RD.

011290 COPY SALEP.RD.

       COPY SHARED.RD.

011330 COPY TXTRAN.RD.

      /
011350 AD000-WRITE             SECTION.

011370 COPY AUDIT.WR.

011390 COPY CONTROL.WR.

011410 COPY DBTRAN.WR.

011430 COPY DEBTOR.WR.

011450 COPY DEPART.WR.

011490 COPY INVOIC.WR.

       COPY LEDTRF.WR.

011510 COPY PARAM.WR.

011530 COPY SALEP.WR.

       COPY SHARED.WR.

011570 COPY TXTRAN.WR.

      /
      *    THIS ROUTINE GENERATES THE RECOVERY FILE RECORDS
      *
011670 AY000           SECTION.
011680 AY01.
011690       MOVE 01             TO REC-FILE.
011700       MOVE WS-PARKEY      TO REC-KEY.
011710	     PERFORM READ-PARAM THRU READ-PARAM-EXIT.
011720       MOVE PAR-RECORD1    TO REC-PARAM.
011730       GO TO AY50.

011740 AY02.
011750       MOVE 02             TO REC-FILE.
008020       MOVE ZERO           TO REC-KEY.
             MOVE ZERO           TO REC-TYPE
011770       PERFORM READ-DEBTOR-LOCK THRU READ-DEBTOR-EXIT.
011780       MOVE DEB-RECORD1    TO REC-DEBTOR.
011790       GO TO AY50.
011800 AY04.
011810       MOVE 04             TO REC-FILE.
008020       MOVE ZERO           TO REC-KEY.
             MOVE WS-ACTION      TO REC-TYPE
011830       MOVE TRA-RECORD1    TO REC-DBTRAN.
011840       GO TO AY50.
011920 AY16.
011930       MOVE 16             TO REC-FILE.
011940       MOVE WS-AUDKEY      TO REC-KEY.
011950       MOVE AUD-REC1       TO REC-AUDITF.
011960       GO TO AY50.
011970 AY19.
011980       MOVE 19             TO REC-FILE.
011990       MOVE ZERO           TO REC-KEY.
012000       MOVE WS-ACTION      TO REC-TYPE.
012010       MOVE TAX-RECORD1    TO REC-TXTRAN.
012020       GO TO AY50.
012030 AY22.
012040	     MOVE 22		 TO REC-FILE.
012050	     MOVE ZERO		 TO REC-KEY.
012060	     MOVE WS-ACTION	 TO REC-TYPE.
012070	     MOVE DOC-REC1	 TO REC-INVOIC.
012080	     GO TO AY50.
012150 AY37.
012160	     MOVE 37		 TO REC-FILE.
012170	     MOVE WS-SHARED	 TO REC-KEY.
012180	     MOVE SHR-RECORD	 TO REC-NETWORK.
012190       GO TO AY50.
012090 AY38.
	     MOVE 38		 TO REC-FILE.
008020	     MOVE ZERO		 TO REC-KEY.
	     MOVE ZERO		 TO REC-TYPE.
012120	     PERFORM READ-DEPART THRU READ-DEPART-EXIT.
012130       MOVE DPT-RECORD     TO REC-DEPART.
012140       GO TO AY50.
012150 AY39.
012160       MOVE 39             TO REC-FILE.
012170       MOVE WS-NETKEY      TO REC-KEY.
012180       MOVE NET-RECORD     TO REC-NETWORK.
012190       GO TO AY50.
011070 AY40.
011080       MOVE 40             TO REC-FILE.
008020       MOVE ZERO           TO REC-KEY.
             MOVE WS-ACTION      TO REC-TYPE
011100       MOVE XFR-REC        TO REC-LEDTRF.
011110       GO TO AY50.
012200 AY49.
012210       MOVE 99             TO REC-FILE.
012220       MOVE ZERO           TO REC-KEY.
012230       MOVE SPACES         TO REC-DETAIL.
012240       PERFORM AY50.
012250       ADD 1               TO WS-TRANS.
012260     IF WS-RECOVER > 95
012270         CLOSE RECOVER
012280         OPEN OUTPUT RECOVER
012290         CLOSE RECOVER
012300         OPEN I-O RECOVER
012310         MOVE ZERO         TO WS-RECOVER.
012320       GO TO AY59.
012330 AY50.
012340       ADD 1               TO WS-RECOVER.
012350       MOVE WS-RECOVER     TO WS-RECKEY.
012360       MOVE WS-TRANS       TO REC-TRAN.
012370       WRITE REC-RECORD.
012380     IF WS-STATUS NOT = "00"
012390         DISPLAY "Write error Recovery file - Status " AT 2212
012400                  WITH FOREGROUND-COLOR 14
012410                  WS-STATUS WITH FOREGROUND-COLOR 15
012420         STOP RUN.
012430	     CLOSE RECOVER.
012440	     OPEN I-O RECOVER.
012450 AY59.
012460       EXIT.

012470 AY60.
012480	   IF WS-SKIP = "Y" OR "A"
012490         GO TO AY999.
      *
      *    ****    Start processing transaction
      *
012690	     MOVE 1		 TO WS-COUNT.
012690	     MOVE 5		 TO WS-SHARED.
012700	     PERFORM READ-SHARED-LOCK THRU READ-SHARED-EXIT.
	     MOVE SHR-STOCK	 TO WS-STOCK.
      *
      *    ****    Read PARAM record 4 - Lock record and start recovery
      *            file procedure.
      *
012500	     MOVE 4		 TO WS-PARKEY.
012510       PERFORM READ-PARAM-LOCK THRU READ-PARAM-EXIT.
012520     IF PAR-USERS < 24
012530         MOVE 1            TO WS-SUB
	       MOVE ZERO	 TO WS-WAIT
012540         GO TO AY62.
      *
      *    ****   Q   F U L L  -  W A I T   F O R   4	S E C O N D S
      *
012550	     DISPLAY "WAITING" AT 2551
		      WITH BACKGROUND-COLOR 3 FOREGROUND-COLOR 12.
012560	     COMMIT.
	     ACCEPT WS-STIME FROM TIME.
	     MOVE 400		 TO WS-WAIT.
012580	     PERFORM LOCK-REC-LOOP.
012590	     DISPLAY SPACE AT 2551
		     WITH BACKGROUND-COLOR 3 FOREGROUND-COLOR 3.
012600       GO TO AY60.

012610 AY61.
012620	     MOVE "DS"		 TO PAR-PROG(WS-USUB).
012630	     MOVE LS-USER	 TO PAR-USR(WS-USUB).
012640       PERFORM REWRITE-PARAM-UNLOCK THRU WRITE-PARAM-EXIT.
      *
      *    ****    Read the DEBTOR control record in the NETWORK file
      *            and lock it. Log details to the RECOVERY file.
      *
012670	     MOVE 1		 TO WS-NETKEY.
012680       PERFORM READ-CONTROL-LOCK THRU READ-CONTROL-EXIT.
012690       PERFORM AY39 THRU AY59.
012700       MOVE NET-DEBTOR     TO W70-DEBT.
	   IF WS-STOCK = "Y"
012710	       MOVE 3		 TO WS-SHARED
012720	       PERFORM READ-SHARED-LOCK THRU READ-SHARED-EXIT
	       PERFORM AY37 THRU AY59
	       MOVE SHR-RECORD	 TO NET-RECORD
	   ELSE
012710	       MOVE 3		 TO WS-NETKEY
012720	       PERFORM READ-CONTROL-LOCK THRU READ-CONTROL-EXIT
012730	       PERFORM AY39 THRU AY59.
012740       GO TO AY999.
      *
      *    ****   A R E   A N Y   U P D A T E S   I N	P R O G R E S S
      *
012750 AY62.
	   IF NOT (PAR-PROG(WS-SUB) = SPACES OR
		   PAR-USR(WS-SUB) = SPACES)
      *
      *    ****   A R E   D E B T O R	O R   S T O C K   F I L E S
      * 	  B E I N G   U P D A T E D
      *
	       IF NOT (PAR-PROG(WS-SUB) = SPACES)
012760		   IF PAR-PROG(WS-SUB) = "DB" OR "DS" OR "CS" OR "ST"
      *
      *    ****   Y E S   -   S E T   W A I T	P E R I O D
      *
		       GO TO AY62-WAIT
		   ELSE
		       ADD 1	 TO WS-SUB
		       GO TO AY62
		   END-IF
	       ELSE
      *
      *    ****   I S	T H I S   P R O G R A M   I N	T H E  Q
      *
	       IF PAR-USR(WS-SUB) = LS-USER
      *
      *    ****   I S	I T   N E X T	I N   L I N E	T O   P R O C E S S
      *
		   IF WS-WAIT = ZERO
		       GO TO AY63
		   ELSE
		       GO TO AY62-WAIT
		   END-IF
	       ELSE
		   GO TO AY62-WAIT
	       END-IF
	   END-IF.
	     MOVE LS-USER	 TO PAR-USR(WS-SUB).
	     MOVE WS-SUB	 TO PAR-USERS.
	     PERFORM REWRITE-PARAM THRU WRITE-PARAM-EXIT.
	     GO TO AY62-CHECK.
      *
      *    ****   S E T   W A I T   P E R I O D
      *
       AY62-WAIT.
	     MOVE 300		 TO WS-WAIT.
	   IF NOT (PAR-USR(WS-SUB) = LS-USER)
	       IF WS-SUB < 24
		   ADD 1	 TO WS-SUB
		   GO TO AY62.

       AY62-CHECK.
	   IF WS-WAIT > ZERO
	       COMMIT
	       DISPLAY "Waiting" AT 2572
			WITH BACKGROUND-COLOR 3
			     FOREGROUND-COLOR 14 BLINK
	       ACCEPT WS-STIME FROM TIME
	       PERFORM LOCK-REC-LOOP
	       DISPLAY "Waiting" AT 2572
			WITH BACKGROUND-COLOR 3
			     FOREGROUND-COLOR 14 BLINK
	       GO TO AY60.
012880	     DISPLAY SPACE AT 2572
		     WITH BACKGROUND-COLOR 3 FOREGROUND-COLOR 3.

012900 AY63.
012920	     MOVE WS-SUB	 TO WS-USUB.
012940	     GO TO AY61.

012970 AY70.
013030	     MOVE 4		 TO WS-PARKEY.
013040       PERFORM READ-PARAM-LOCK-END THRU READ-PARAM-EXIT.
      *
      *    ****    Write links back and unlock PARAM record 4 and
      *            NETWORK record 1.
      *
	   IF WS-STOCK = "Y"
	       MOVE NET-RECORD	 TO SHR-RECORD
012980	       PERFORM REWRITE-SHARED THRU WRITE-SHARED-EXIT
	   ELSE
012980	       PERFORM REWRITE-CONTROL THRU WRITE-CONTROL-EXIT.
012990       MOVE 1              TO WS-NETKEY.
013000       MOVE W70-DEBT       TO NET-DEBTOR.
013010	     PERFORM REWRITE-CONTROL THRU WRITE-CONTROL-EXIT.
013020       PERFORM AY49 THRU AY59.
	     MOVE 1		 TO WS-USUB.

       AY72.
	   IF NOT (PAR-USR(WS-USUB) = LS-USER)
	       ADD 1		 TO WS-USUB
	       GO TO AY72.

       AY75.
013050	     MOVE SPACES	 TO PAR-PROG(WS-USUB)
013060				    PAR-USR(WS-USUB).
	   IF WS-USUB < 24
	       ADD 1 WS-USUB	 GIVING WS-SUB
	   ELSE
	       GO TO AY80.
	   IF NOT (PAR-PROG(WS-SUB) = SPACES)
	       MOVE PAR-PROG(WS-SUB)
				 TO PAR-PROG(WS-USUB)
	       MOVE PAR-USR(WS-SUB)
				 TO PAR-USR(WS-USUB)
	       ADD 1		 TO WS-USUB
	       GO TO AY75.

       AY80.
013070	     SUBTRACT 1 FROM WS-USUB
				 GIVING PAR-USERS.
013080	     PERFORM REWRITE-PARAM THRU WRITE-PARAM-EXIT.
	   IF LS0-POS NOT = 2
012430         CLOSE RECOVER
012440         OPEN I-O RECOVER.
013090       COMMIT.

013100 AY999.
013110       EXIT.
      /
013120 AZ000-END               SECTION.
013130 AZ000-EOJ.
013140       MOVE WS-10CPI       TO REP-DETAIL2.
013150       WRITE REP-LINE2 BEFORE 0 LINES.
013160	     CLOSE RECOVER
013270             PRNREP.
013280 AZ100.
013290       EXIT PROGRAM.

      *
      *    ****    Read debtor record - using account number.
      *
013750 CA155-GET-DEBTOR  SECTION 2.
013760 CA155.
012010       MOVE W80-ACNO       TO DEB-ACNO.
012020       PERFORM READ-DEBTOR THRU READ-DEBTOR-EXIT.
           IF WS-F-ERROR = 6
               MOVE 1            TO WS-ERROR
014380     ELSE
013870     IF DEB-ACNO NOT = W80-ACNO
013880         MOVE 2            TO WS-ERROR
013890     ELSE
013900         MOVE 0            TO WS-ERROR
013910         MOVE DEB-TYPE     TO W80-TYPE.
013920 CA160-EXIT.
013930       EXIT.

       COPY LEDTRF.UPD.

      /
      *    ****    G E N E R A T E   A   D E B T O R
      *            T R A N S A C T I O N
      *
014810 GENERATE-DEBTOR-TRAN SECTION 2.
014820
014830 DEBTOR-TRAN.
014910
014920 LINK-DEBTOR-TRANS.
015010       INITIALIZE TRA-RECORD1.
015090       MOVE W20-DTE        TO TRA-DATE.
015100       MOVE W20-DTE        TO DEB-ACTIVE.
015110       MOVE W90-CODE       TO TRA-CODE.
015120       MOVE W90-REF        TO TRA-REF TRA-REG.
015130       MOVE DEB-ACNO       TO TRA-AC.
015140     IF W90-DB NOT = ZERO
015150         MOVE W90-DB       TO TRA-VALUE
015160     ELSE
015170         MOVE W90-CR       TO TRA-VALUE.
015180     IF W00-ACTION = 1
015190         MULTIPLY -1 BY W90-NONTAX
015200                           GIVING TRA-TAXFREE
015210     ELSE
015220         MOVE W90-NONTAX   TO TRA-TAXFREE.
015230       MOVE W90-TTAX       TO TRA-TAX.
015240       ADD TRA-TAX         TO W00-T-VAT.
015290	     PERFORM WRITE-DBTRAN THRU WRITE-DBTRAN-EXIT.
000900	     MOVE 1		 TO WS-ACTION.
000220	     PERFORM AY04 THRU AY59.
015300       MOVE 1              TO TAX-ACTYPE.
015310       MOVE TRA-CODE       TO TAX-CODE.
015320       MOVE TRA-DATE       TO TAX-DATE.
015330       MOVE TRA-REF        TO TAX-REF.
015340       MOVE TRA-VALUE      TO TAX-VALUE.
015350       MOVE TRA-TAXFREE    TO TAX-TAXFREE.
015360*      MOVE TRA-TAX	 TO TAX-VAT.
015370       MOVE TRA-AC         TO TAX-AC.
015380       IF W90-CR NOT = ZERO
015390           MOVE "1"        TO TAX-TYPE
015400       ELSE
015410           MOVE "2"        TO TAX-TYPE.
015420       MOVE ZERO           TO TAX-SEQ.
	     MOVE 1		 TO WS-S9.

       DEBTOR-TAX.
	     MOVE W90-TAXVAL(WS-S9)
				 TO TAX-VAL(WS-S9).
	     MOVE W90-VAT(WS-S9) TO TAX-VAT(WS-S9).
	   IF WS-S9 < 12
	       ADD 1		 TO WS-S9
	       GO TO DEBTOR-TAX.
000890	     PERFORM WRITE-TXTRAN THRU WRITE-TXTRAN-EXIT.
000900	     MOVE 1		 TO WS-ACTION.
000910	     PERFORM AY19 THRU AY59.
015460	     ADD TRA-VALUE	 TO W00-T-VAL W00-T-MTDV W00-T-YTDV.
015470       ADD 1               TO W00-T-DAY W00-T-MTD  W00-T-YTD.
015480	     PERFORM UPDATE-TRAN-RECORD.
           IF WX-INT = "Y"
               PERFORM DEBTOR-INTEGRATE. 
015490     IF W90-CR NOT = ZERO
015500         GO TO DEBTOR-CR-TRANS.
015510       ADD W90-DB          TO DEB-DEBT
015520                              DEB-BAL
015530                              DEB-PURYTD
                                    DEB-MTHPUR (W20-MONTH).
015540       GO TO DEBTOR-TRAN-EXIT.

       DEBTOR-INTEGRATE.
             MOVE W20-DTE        TO WX-DATE.
	     MOVE "  DT"	 TO WX-LEDG.
	     MOVE W90-CODE	 TO WX-TRN.
	     MOVE W00-E-DESC	 TO WX-DESC.
             MOVE "- DEBTORS"    TO WX-BOOK.
             MOVE TRA-VALUE      TO WX-VALUE.
             MOVE WX-DEBGL       TO WX-AC.
             MOVE 01             TO WX-TYPE.
             PERFORM GL-TRF-UPDATE.
015550
015560 DEBTOR-CR-TRANS.
015570       SUBTRACT W90-CR     FROM DEB-CRED
                                      DEB-MTHPUR (W20-MONTH).
015580       ADD W90-CR          TO DEB-PURYTD.               
015590       ADD W90-CR          TO DEB-BAL.
           IF OPEN-ITEM
               GO TO DEBTOR-TRAN-EXIT.
015600     IF WS-AGE = "M"
015610         GO TO DEBTOR-TRAN-EXIT.
015620       MOVE ZERO           TO W90-CUR W90-30 W90-60 W90-90.
015630       MOVE W90-CR         TO W90-VALUE.
015640     IF WS-AGE = "1"
015650         ADD W90-VALUE     TO DEB-120
015660         MOVE W90-VALUE    TO W90-120.
015670     IF DEB-120 < ZERO
015680         SUBTRACT DEB-120  FROM W90-120
015690         MOVE DEB-120      TO W90-VALUE
015700         MOVE ZERO         TO DEB-120
015710         MOVE "9"          TO WS-AGE.
015720     IF WS-AGE = "9"
015730         ADD W90-VALUE     TO DEB-90
015740         MOVE W90-VALUE    TO W90-90.
015750     IF DEB-90 < ZERO
015760         SUBTRACT DEB-90   FROM W90-90
015770         MOVE DEB-90       TO W90-VALUE
015780         MOVE ZERO         TO DEB-90
015790         MOVE "6"          TO WS-AGE.
015800     IF WS-AGE = "6"
015810         ADD W90-VALUE     TO DEB-60
015820         MOVE W90-VALUE    TO W90-60.
015830     IF DEB-60 < ZERO
015840         SUBTRACT DEB-60   FROM W90-60
015850         MOVE DEB-60       TO W90-VALUE
015860         MOVE ZERO         TO DEB-60
015870         MOVE "3"          TO WS-AGE.
015880     IF WS-AGE = "3"
015890         ADD W90-VALUE     TO DEB-30
015900         MOVE W90-VALUE    TO W90-30.
015910     IF DEB-30 < ZERO
015920         SUBTRACT DEB-30   FROM W90-30
015930         MOVE DEB-30       TO W90-VALUE
015940         MOVE ZERO         TO DEB-30
015950         MOVE "C"          TO WS-AGE.
015960     IF WS-AGE = "C"
015970         ADD W90-VALUE     TO DEB-CUR
015980         MOVE W90-VALUE    TO W90-CUR.
015990     IF DEB-CUR < ZERO
016000         SUBTRACT DEB-CUR  FROM W90-CUR
016010         MOVE ZERO         TO DEB-CUR.

016030 DEBTOR-TRAN-EXIT.
016040       EXIT.

      /
016050 BA000                    SECTION.
016980 BA90.
016990       MOVE W70-AUDIT      TO WS-AUDKEY.
017000       MOVE LOW-VALUES     TO AUD-REC1.
017010       PERFORM AY16 THRU AY59.
017050	     MOVE 7		 TO AUD-TYPE.
017060       MOVE WS-DRAW        TO AUD-SUB.
017070       MOVE W90-REF        TO AUD-CSH.
017080       MOVE W90-EXCTOT     TO AUD-SELL.
017090	     MOVE ZERO		 TO AUD-COST.
017100       MOVE W10-SMAN       TO AUD-SMAN.
017110       PERFORM WRITE-AUDIT THRU WRITE-AUDIT-EXIT.
017120       ADD 1               TO W70-AUDIT.
017130       MOVE 1              TO WS-AUDKEY.
017140       PERFORM READ-AUDIT THRU READ-AUDIT-EXIT.
017150       PERFORM AY16 THRU AY59.
017190	     MOVE 1		 TO AUD-REP7.
017200       PERFORM REWRITE-AUDIT THRU WRITE-AUDIT-EXIT.
017210 BA95.
017220       MOVE W70-AUDIT      TO WS-AUDKEY.
017230       MOVE LOW-VALUES     TO AUD-REC1.
017240       PERFORM AY16 THRU AY59.
017290	     MOVE 3		 TO AUD-TYPE
017300	     MOVE DEB-ACNO	 TO AUD-AC.
017310       MOVE WS-DRAW        TO AUD-SUB.
017320       MOVE W90-REF        TO AUD-REF.
017330       MOVE W90-TTAX       TO AUD-TAX.
017340       MOVE W90-TOTAL      TO AUD-VAL.
017350       PERFORM WRITE-AUDIT THRU WRITE-AUDIT-EXIT.
017360       ADD 1               TO W70-AUDIT.
017370       MOVE 1              TO WS-AUDKEY.
017380       PERFORM READ-AUDIT THRU READ-AUDIT-EXIT.
017390       PERFORM AY16 THRU AY59.
017430	     MOVE 1		 TO AUD-REP3.
017440       PERFORM REWRITE-AUDIT THRU WRITE-AUDIT-EXIT.
      /
017690 BB050               SECTION.
017700 BB50.
           IF WS-PRNINV = "N"
               GO TO BB60.
017710       MOVE SPACES         TO REP-DETAIL2.
	     WRITE INV-L1 BEFORE 2 LINES.
	     MOVE X"0E" 	 TO INV-EXP2.
	     MOVE "TAX INVOICE/BELASTING FAKTUUR"
				 TO INV-INVOICE.
	     WRITE INV-L1 BEFORE 0 LINES.
	     WRITE INV-L1 BEFORE 2 LINES.
017710       MOVE SPACES         TO REP-DETAIL2.
	     MOVE X"0E" 	 TO INV-EXP2.
	     MOVE "DELIVERY NOTE/AFLEWERINGSNOTA"
				 TO INV-INVOICE.
	     WRITE INV-L1 BEFORE 0 LINES.
	     WRITE INV-L1 BEFORE 3 LINES.
	     MOVE WS-ECAN	 TO REP-DETAIL2.
	     WRITE INV-L1 BEFORE 0 LINES.
017710	     MOVE SPACES	 TO REP-DETAIL2.
	     MOVE X"0E" 	 TO INV-EXP.
017750	     MOVE W95-COMP	 TO INV-EXPNAME.
017760	     WRITE INV-L1 BEFORE 1 LINES.
	     MOVE WS-ECAN	 TO REP-DETAIL2.
	     WRITE INV-L1 BEFORE 0 LINES.
	     MOVE SPACES	 TO REP-DETAIL2.
017770	     MOVE W95-ADD1	 TO INV-NADD.
026690	   IF W05-VATNO NOT = SPACES
026700	       MOVE "VAT No/BTW Nr :"
				 TO INV-H2
026710         MOVE W05-VATNO    TO INV-GNO.
017780       WRITE INV-L1 BEFORE 1 LINES.
017790       MOVE SPACES         TO REP-DETAIL2.
017800       MOVE W95-ADD2       TO INV-NADD.
017910	   IF W95-TEL NOT = SPACES
017920	       MOVE "TELEPHONE/FOON:"
				 TO INV-H2
017930         MOVE W95-TEL      TO INV-TEL.
017810       WRITE INV-L1 BEFORE 1 LINES.
	     MOVE SPACES	 TO REP-DETAIL2.
017820       MOVE W95-ADD3       TO INV-NADD.
017830       WRITE INV-L1 BEFORE 1 LINES.
017840       MOVE W95-ADD4       TO INV-NADD.
017850	     WRITE INV-L1 BEFORE 1 LINES.
017860 BB55.
017870       MOVE SPACES         TO REP-DETAIL2.
017880       MOVE W95-PC         TO INV-PC.
017890	     WRITE INV-L1 BEFORE 1 LINES.
017900       MOVE SPACES         TO REP-DETAIL2.
017950 BB60.
017960       EXIT.
      /
      *    ****    I N V O I C E   A N D   C A S H   S A L E
      *
018500 BC000	     SECTION 50.
018510 BC00.
018690	     MOVE 1		 TO WS-FIRST WS-LAST.
018710       MOVE "I"            TO WS-CR.
018720 BC10.
      *
      *    ****    D E B T O R   A C C O U N T   N U M B E R
      *
018770	     MOVE W40-ACNO	 TO W80-ACNO.
018930	     PERFORM CA155-GET-DEBTOR.
      *
      *    ****    S A L E S M A N   N U M B E R
      *
019990	     MOVE W40-SMAN	 TO W10-SMAN.
	     MOVE W40-PRNINV	 TO WS-PRNINV.
	     MOVE W40-LAST	 TO WS-LAST.
	     MOVE W40-PRC	 TO WS-PRC.
      *
      *    ****    P R O C E S S   T H E   S A L E
      *
025410 BC188.
025480       MOVE 1              TO WS-SALKEY.
025490       PERFORM AY60 THRU AY999.
025500       PERFORM AY02 THRU AY59.
025510       MOVE W70-INVOICE    TO W90-REF.
025520	     DISPLAY W90-REF AT 0510
		     WITH FOREGROUND-COLOR 6 HIGHLIGHT
			  BACKGROUND-COLOR 0.
025530	   IF W70-INVOICE = 99999999
025540	       MOVE 1		 TO W70-INVOICE
025550	   ELSE
025560	       ADD 1		 TO W70-INVOICE.
026310 BC215.
	   IF WS-PRNINV = "N"
	       GO TO BC220.
      *
      *    ****    P R I N T   I N V O I C E   H E A D I N G S
      *
      *	     MOVE W95-TIME	 TO INV-NME2.
026320       MOVE SPACES         TO REP-DETAIL2.
	     MOVE X"0E" 	 TO INV-EXP.
	     MOVE "REF No:"	 TO INV-H14.
026590       MOVE W90-REF        TO INV-REF.
026370	     WRITE INV-L1 BEFORE 0 LINES.
026370	     WRITE INV-L1 BEFORE 2 LINES.
026320       MOVE SPACES         TO REP-DETAIL2.
	     MOVE X"0E" 	 TO INV-EXP.
	     MOVE "DATE  :"	 TO INV-H14.
026670       MOVE W12-TODAY      TO INV-DTE.
026370	     WRITE INV-L1 BEFORE 0 LINES.
026370       WRITE INV-L1 BEFORE 1 LINES.
	     MOVE WS-ECAN	 TO REP-DETAIL2.
	     WRITE INV-L1 BEFORE 0 LINES.
026320	     MOVE SPACES	 TO REP-DETAIL2.
	     MOVE "DELIVERY / AFLEWRING"
				 TO INV-DADD2.
026370       WRITE INV-L1 BEFORE 1 LINES.
026320	     MOVE SPACES	 TO REP-DETAIL2.
026330       MOVE W40-NAME       TO INV-NAME.
	     MOVE "PAGE / BLADSY"
				 TO INV-H4.
	     ADD 1		 TO WS-PAGE.
	     MOVE WS-PAGE	 TO INV-PGE.
026370       WRITE INV-L1 BEFORE 1 LINES.
026320	     MOVE SPACES	 TO REP-DETAIL2.
026350       MOVE W40-ADD1       TO INV-NAME.
026360	     MOVE W40-PADD1	 TO INV-DADD2.
026370	     WRITE INV-L1 BEFORE 1 LINES.
026380       MOVE W40-ADD2       TO INV-NAME.
026390	     MOVE W40-PADD2	 TO INV-DADD2.
	     MOVE "ACCOUNT / REKENING"
				 TO INV-H4.
026550	     MOVE W80-ACNO	 TO INV-AC.
026370	     WRITE INV-L1 BEFORE 1 LINES.
026320       MOVE SPACES         TO REP-DETAIL2.
026410       MOVE W40-ADD3       TO INV-NAME.
026420	     MOVE W40-PADD3	 TO INV-DADD2.
026370       WRITE INV-L1 BEFORE 1 LINES.
026320       MOVE SPACES         TO REP-DETAIL2.
026440       MOVE W40-ADD4       TO INV-NAME.
026450	     MOVE W40-PADD4	 TO INV-DADD2.
	     MOVE "ORDER / BESTELLING"
				 TO INV-H4.
026560       MOVE W90-ORD        TO INV-ORD.
026340       WRITE INV-L1 BEFORE 1 LINES.
	     MOVE SPACES	 TO REP-DETAIL2.
026510       MOVE W40-PC1        TO INV-PC1.
026510	     MOVE W40-PC2	 TO INV-PC2.
026370       WRITE INV-L1 BEFORE 1 LINES.
	     MOVE SPACES	 TO REP-DETAIL2.
      *
      *    ****    P R I N T   T E R M S   O N   T H E   I N V O I C E
      *
	     MOVE "TERMS / TERME"
				 TO INV-H4.
028720	   IF DEB-TERMS = "0"
028730	       MOVE "7 Days/Dae" TO INV-TERMS
028740	   ELSE
028750	   IF DEB-TERMS = "2"
028760	       MOVE "60 Days/Dae"
				 TO INV-TERMS
028770	   ELSE
028780	   IF DEB-TERMS = "1"
028790	       MOVE "30 Days/Dae"
				 TO INV-TERMS
028800	   ELSE
028810	       MOVE "COD/KBA"	 TO INV-TERMS.
026430       WRITE INV-L1 BEFORE 1 LINES.
	     MOVE SPACES	 TO REP-DETAIL2.
	   IF W10-SMAN NOT = ZERO
	       MOVE "Assist :"	 TO INV-H3
	       MOVE W40-ASSIST	 TO INV-DADD2.
026460	     WRITE INV-L1 BEFORE 2 LINES.
	     MOVE SPACES	 TO REP-DETAIL2.
	     MOVE "EXCLUSIVE"	 TO INV-H6.
	     MOVE "NETT AMOUNT"  TO INV-H8.
026430	     WRITE INV-L1 BEFORE 0 LINES.
026430	     WRITE INV-L1 BEFORE 1 LINES.
	     MOVE SPACES	 TO REP-DETAIL2.
	     MOVE "DESCRIPTION/BESRYWING"
				 TO INV-H5.
	     MOVE "EKSKLUSIEF"	 TO INV-H6.
	     MOVE "VAT/BTW"	 TO INV-H7.
	     MOVE "NETO BEDRAG"  TO INV-H8.
026430	     WRITE INV-L1 BEFORE 0 LINES.
026430	     WRITE INV-L1 BEFORE 2 LINES.
026470 BC216.
      *
      *    ****    S T A R T   I N V O I C E   L O G G I N G   ( RE-PRINT )
      *
026500       MOVE SPACES         TO REP-DETAIL2.
026810	     MOVE 31		 TO WS-LINE.
       BC220.
             EXIT.
       BC222.
026490	     MOVE WS-PAGE	 TO DOC-PAGE.
026550	     MOVE W80-ACNO	 TO DOC-AC.
	     MOVE 100		 TO DOC-SQN.
	     MOVE ZERO		 TO DOC-TYPE.
	     MOVE W40-NAME	 TO DOC-NAME.
	     MOVE ZERO		 TO DOC-PICNO.
026640	     MOVE WS-CR		 TO DOC-DOC.
	     MOVE W90-EXP	 TO DOC-EXP.
	     MOVE WS-PRC	 TO DOC-PRC.
026560	     MOVE W90-ORD	 TO DOC-ORD.
026590	     MOVE W90-REF	 TO DOC-REF.
026600	     MOVE W90-REG	 TO DOC-OREF.
	     MOVE "N"		 TO DOC-ADV.
026680	     MOVE W12-T-YMD	 TO DOC-DTE.
026800	     MOVE W10-SMAN	 TO DOC-SMAN.
028820	     MOVE W90-TOTAL	 TO DOC-VALUE.
	     MOVE "Y"		 TO DOC-PROF.
      *
      *    ****    L O G   R E C O R D   T O   I N V O I C E   F I L E
      *
       BC225.
	     PERFORM WRITE-INVOIC THRU WRITE-INVOIC-EXIT.
015400	     MOVE 1		 TO WS-ACTION.
	     PERFORM AY22 THRU AY59.
026830 BC235.
      *
      *    ****    R E A D   T H E   S A L E   F I L E   A N D
      *            P R I N T   T H E   I N V O I C E
      *
026840     IF WS-SALKEY > WS-LAST
026850         GO TO BC255.
026860       PERFORM READ-SALE THRU READ-SALE-EXIT.
026870     IF WS-LINE > 1
026880         SUBTRACT 1        FROM WS-LINE
026890     ELSE
026900         PERFORM BC250.
      *
      *    ****    N E X T   E N T R Y   O N   I N V O I C E   L O G
      *            R E C O R D
      *
026960	     MOVE 1		 TO DOC-TYPE.
	     INITIALIZE DOC-DET2.
026980	     MOVE SAP-DESC	 TO DOC-REMKS.
027020	     MOVE SAP-VAT	 TO DOC-PVAT.
027030	     MOVE SAP-SELL	 TO W10-SELL
				    DOC-PSELL.
027050	     MOVE SAP-VAL	 TO W25-VALUE
				    DOC-PVAL.
026980	     MOVE SAP-DESC	 TO INV-DESC.
026990	     MOVE SAP-LEDG	 TO W10-LEDG DOC-LEDG.
027030	     MOVE SAP-SELL	 TO INV-EXCL W90-VALUE.
027020	     MOVE SAP-VAT	 TO INV-TAX.
	     MOVE SAP-VAL	 TO INV-VAL.
	     MOVE SAP-TAXVAL	 TO DOC-PTAXVAL.
	     MOVE SAP-NONTAX	 TO DOC-PNONTAX.
	     MOVE ZERO		 TO WS-SUPER.
	     MOVE SAP-VAT-SUB	 TO WS-VAT-SUB
				    DOC-VAT-PSUB.
	   IF WS-VAT-SUB = ZERO
	       MOVE ZERO	 TO DOC-V-PPER
	   ELSE
	       MOVE W05-VAT(WS-VAT-SUB)
				 TO DOC-V-PPER.
027220	     ADD W90-VALUE	 TO W90-EXCTOT.
           IF WS-PRNINV = "Y"
027230	       WRITE INV-L1 BEFORE 1 LINES
027240	       MOVE SPACES	 TO REP-DETAIL2.
027250       ADD W25-VALUE       TO W90-STOTAL.
027420 BC240.
	   IF (WS-COPY = "Y")
               GO TO BC246.
	   IF (W10-LEDG = ZERO)
	       GO TO BC245I.
      *
      *    ****    U P D A T E	 S A L E S   A N A L Y S I S
      *
027430	     MOVE W10-LEDG	 TO DPT-CODE.
027440       PERFORM AY38 THRU AY59.
027450	     ADD W90-VALUE	 TO DPT-SALES-DAY
027460                              DPT-SALES-MTD
027470                              DPT-SALES-YTD.
           IF WX-INT = "Y"
               MOVE W12-T-YMD    TO WX-DATE
	       MOVE W10-LEDG	 TO WX-LEDG
               MOVE "SALES - DEBTORS"
                                 TO WX-NAR
               COMPUTE WX-VALUE = W90-VALUE * -1
               MOVE DPT-SALE-GL  TO WX-AC
               MOVE 04           TO WX-TYPE
               PERFORM GL-TRF-UPDATE.
      *
      *    ****    L O G   I N D I V I D U A L   I T E M S   T O   T H E
      *            A U D I T   F I L E
      *
027670 BC245.
027720	     MOVE W90-BCR	 TO W90-ICST.

       BC245I.
	     ADD 1		 TO DOC-SEQ.
	     MOVE ZERO		 TO DOC-SUB.
	     PERFORM BC225.
      *
      *    ****    G O   A N D   G E T   T H E   N E X T   I T E M
      *
027740 BC246.
027750       ADD 1               TO WS-SALKEY.
027760       GO TO BC235.
      *
      *    ****    C A R R I E D   F O R W A R D   -   N E X T   P A G E
      *
027840 BC250.
	   IF WS-PRNINV = "Y"
027850	       WRITE INV-L1 BEFORE 1 LINES
027860	       MOVE SPACES	 TO REP-DETAIL2
027870	       MOVE "C/FWD - OORGEDRA"
027880				 TO INV-DADD2
027890	       MOVE W90-STOTAL
				 TO INV-VAL
027900	       WRITE INV-L1 BEFORE 1 LINES
027860	       MOVE SPACES	 TO REP-DETAIL2
	       MOVE "Please check your invoice."
				 TO INV-REMKS
027900	       WRITE INV-L1 BEFORE 1 LINES
	       MOVE "Gaan asseblief u faktuur na."
				 TO INV-REMKS
027900	       WRITE INV-L1 BEFORE 4 LINES.
027940       PERFORM BB050.
027950       PERFORM BC215 THRU BC220.
           IF WS-PRNINV = "Y"
027970	       MOVE "B/FWD - O/B"
                                 TO INV-DESC
027980	       MOVE W90-STOTAL	 TO INV-VAL
028000	       WRITE INV-L1 BEFORE 1 LINES
027860	       MOVE SPACES	 TO REP-DETAIL2
027990         SUBTRACT 2        FROM WS-LINE.
      *
      *    ****    I N V O I C E   T O T A L S
      *
028010 BC255.
	   IF WS-PRNINV = "N"
               GO TO BC256.
028020	     WRITE INV-L1 BEFORE WS-LINE LINES.
028000	     WRITE INV-L1 BEFORE 1 LINES.
027860	     MOVE SPACES	 TO REP-DETAIL2.
028030	     MOVE ALL "-"	 TO INV-LINE.
      *
      *    ****    P R I N T   S U B - T O T A L
      *
	     MOVE "Please check your invoice."
				 TO INV-REMKS.
028040	     WRITE INV-L1 BEFORE 1 LINES.
027860	     MOVE SPACES	 TO REP-DETAIL2.
	     MOVE "TOTAL/TOTAAL" TO INV-H13.
	     MOVE "Gaan asseblief u faktuur na."
				 TO INV-REMKS.
       BC256.
	     MOVE 9		 TO DOC-TYPE.
	     MOVE 99900		 TO DOC-SQN.
	     INITIALIZE DOC-DET3.
028070	     MOVE W90-DB	 TO DOC-SUBTOT.
	     MOVE DEB-TERMS	 TO DOC-TERMS.
      *
      *    ****    P R I N T   T H E   T A X   F I G U R E S   A N D 
      *            U P D A T E   T A X   T O T A L S
      *
      * 	   TAX CALCULATED IN DTPINV
      * 	       W90-NONTAX   =TOTAL NON TAXABLE VALUE
      * 	       W90-TTAX     =TOTAL TAX (ALL RATES)
      * 	       W90-TAXVAL(?)=TOTAL TAXABLE PER RATE
      * 	       W90-VAT(?)   =TOTAL VAT PER RATE
      * 	       W90-TOTAL    =TOTAL FOR CREDIT NOTE
      *
      *컴컴컴컴컴컴컴컴컴컴컴컴컴컴컴컴컴컴컴컴컴컴컴컴컴컴컴컴컴컴컴컴�
      *
028660	     MOVE W05-RATE	 TO WS-PER.
           IF WS-COPY = "Y"
               GO TO BC258.

       BC258.
	     MOVE W90-EXCTOT	 TO INV-EXCL.
028680	     MOVE W90-TTAX	 TO DOC-TAX.
028680	     MOVE W90-TTAX	 TO INV-TAX.
      *
      *    ****    I N V O I C E   T O T A L   (P R I N T   &   L O G)
      *
028690 BC260.
028820	     MOVE W90-TOTAL	 TO W90-DB.
           IF WS-COPY = "N"
028830	       MOVE W90-BDT	 TO W90-TCOST
028840	       MOVE W90-DB	 TO DOC-TOT
	       MOVE W90-EXCTOT	 TO DOC-TAXABLE
	       MOVE W90-NONTAX	 TO DOC-NON-TXBL
	       MOVE W90-BAL	 TO DOC-BAL
	       MOVE W90-CONTACT	 TO DOC-CONTACT
	       MOVE W40-TEL	 TO DOC-TEL
	       PERFORM BC225.
	   IF WS-PRNINV = "Y"
028840	       MOVE W90-DB	 TO INV-VAL
028880	       WRITE INV-L1 BEFORE 0 LINES
	       MOVE SPACES	 TO INV-REMKS
028880	       WRITE INV-L1 BEFORE 1 LINES
	       MOVE SPACES	 TO REP-DETAIL2.
	     MOVE ALL "="	 TO INV-LINE.
028100	   IF DEB-SDISC NOT = ZERO
028110	       MOVE W15-DISC (DEB-SDISC)
028120                           TO W30-PERC
028130	       MOVE W30-MESSAGE  TO INV-RMKS.
           IF WS-PRNINV = "Y"
028880	       WRITE INV-L1 BEFORE 1 LINES
	       MOVE SPACES	 TO REP-DETAIL2
	       MOVE "Processed by APAC Accounting - (011) 803-2572"
				 TO REP-DETAIL2
	       WRITE INV-L1 BEFORE 2 LINES.
028890	     MOVE SPACES	 TO REP-DETAIL2.
028900       MOVE W12-T-YMD      TO W20-DTE.
      *
      *    ****    U P D A T E   T H E   D E B T O R   A C C O U N T
      *
028910	     MOVE 1		 TO W90-CODE.
028920	     PERFORM GET-DEBTOR-TRAN-RECORD.
028930	     PERFORM GENERATE-DEBTOR-TRAN.
014480	     MOVE 9		 TO WS-PARKEY.
014500       PERFORM AY01 THRU AY59.
	     MOVE 1		 TO W05-V-RATE.

       BC262-VAT.
	   IF W90-VAT(W05-V-RATE) = ZERO
	       GO TO BC262-CHECK-END.
	     MOVE W05-VAT-CODE	 TO DPT-CODE.
027840	     PERFORM AY38 THRU AY59.
      *
      *    ****    V A T   S T A T I S T I C S
      *
027850	     ADD W90-VAT(W05-V-RATE)
				 TO DPT-O-VAT-DAY
027860				    DPT-O-VAT-MTD
027870				    DPT-O-VAT-YTD.
	     ADD W90-TAXVAL(W05-V-RATE)
				 TO DPT-V-SALES-DAY
				    DPT-V-SALES-MTD
				    DPT-V-SALES-YTD.
	   IF (WX-INT = "Y") AND (W90-VAT(W05-V-RATE) NOT = ZERO)
		COMPUTE WX-VALUE = W90-VAT(W05-V-RATE) * -1
		MOVE DPT-O-VAT-GL
				 TO WX-AC
		MOVE DPT-CODE	 TO WX-LEDG
		MOVE 10 	 TO WX-TYPE
                PERFORM GL-TRF-UPDATE.
027880	     PERFORM REWRITE-DEPART THRU WRITE-DEPART-EXIT.
	     ADD W90-TAXVAL(W05-V-RATE)
				 TO PAR-DVAT-DAY
                                    PAR-DVAT-MTD
                                    PAR-DVAT-YTD.

       BC262-CHECK-END.
	   IF W05-V-RATE < 6
	       ADD 1		 TO W05-V-RATE
	       GO TO BC262-VAT.
	     ADD W90-NONTAX	 TO PAR-DNGS-DAY
                                    PAR-DNGS-MTD
                                    PAR-DNGS-YTD.
	     PERFORM REWRITE-PARAM THRU WRITE-PARAM-EXIT.
028940	     MOVE ZERO		 TO W90-CUR W90-30 W90-60
028950                              W90-120 W90-90.
      *
      *    ****    L O G   T H E   S A L E S M A N   &   I N V O I C E -
      *            A U D I T   F I L E   D E T A I L S
      *
029150	     PERFORM BA90.
029160	     PERFORM BA95.
      *
      *    ****    P R I N T   T H E   N E X T   I N V O I C E
      *            H E A D I N G 
      *            ( OVERLAP WITH DISK PROCESSING )
      * 
029170	     PERFORM BB050.
      *
      *    ****    U P D A T E   T H E   D E B T O R   C A T E G O R Y
      *
029180       ADD 121 DEB-CAT     GIVING W90-RESULT.
029190       DIVIDE W90-RESULT BY 2
029200                           GIVING W90-CATKEY
029210                           REMAINDER W90-CS.
029220       ADD 1               TO W90-CS.
029230       MOVE W90-CATKEY     TO WS-PARKEY.
029240       PERFORM AY01 THRU AY59.
029250       ADD W90-DB          TO PAR-CDRMTD (W90-CS).
029260       ADD W90-DB          TO PAR-CDRYTD (W90-CS).
029270       PERFORM REWRITE-PARAM THRU WRITE-PARAM-EXIT.
      *
      *    ****    U P D A T E   T H E   S A L E S M A N   R E C O R D
      *
029280     IF W10-SMAN NOT = ZERO
029290         ADD 100 W10-SMAN  GIVING WS-PARKEY
029300         PERFORM AY01 THRU AY59
029310         ADD W90-TCOST     TO PAR-CT-MTD PAR-CT-YTD
029320         ADD W90-EXCTOT    TO PAR-SL-MTD PAR-SL-YTD
029330         PERFORM REWRITE-PARAM THRU WRITE-PARAM-EXIT.
      *
      *    ****    R E W R I T E   T H E   D E B T O R   R E C O R D
      *
029340       PERFORM REWRITE-DEBTOR THRU WRITE-DEBTOR-EXIT.
      *
      *    ****    U P D A T E   T H E   D E B T O R   C O N T R O L
      *            R E C O R D
      *
029350       ADD W90-DB          TO W70-OUT
029360                              W70-DT.
029370       ADD W90-CUR         TO W70-MTD.
029380       ADD W90-30          TO W70-ONE.
029390       ADD W90-60          TO W70-TWO.
029400       ADD W90-90          TO W70-THREE.
029410       ADD W90-120         TO W70-FOUR.
      *
      *    ****    U P D A T E   T H E   S T O C K   C O N T R O L
      *            R E C O R D
      *
       BC265.
      *
      *    ****    U P D A T E   T H E   C O S T - O F - S A L E S
      *
029470       MOVE 8              TO WS-PARKEY.
029480       PERFORM AY01 THRU AY59.
029490       ADD W90-BDT         TO PAR-CSHT PAR-CMTD PAR-CYTD.
029500       PERFORM REWRITE-PARAM THRU WRITE-PARAM-EXIT.
029510 BC267.
      *
      *    ****    E N D   O F F   T H E   R E C O V E R Y   L O G
      *
029520       PERFORM AY70 THRU AY999.
      *
      *    ****    C L O S E   F I L E S   
      *            ( FORCE SYSTEM TO WRITE DETAILS TO DISK )
      *
029530       CLOSE PARAM 
029540             DEPART 
029550             DEBTOR 
029560		   AUDIT.
029620       OPEN I-O PARAM 
029630                DEPART 
029640                DEBTOR 
029650		      AUDIT.
029690	     DISPLAY CLEAR-L25.
031960 BC599.
031970       EXIT.
      /
      *    ****    I N V O I C E   R E - P R I N T
      *
044860 BE000	     SECTION 51.
044870 BE00.
018690	     MOVE 1		 TO WS-FIRST.
      *
      *    ****    D E B T O R   A C C O U N T   N U M B E R
      *
018770	     MOVE W40-ACNO	 TO W80-ACNO.
018930	     PERFORM CA155-GET-DEBTOR.
019990	     MOVE W40-SMAN	 TO W10-SMAN.
	     MOVE W40-LAST	 TO WS-LAST.
	     MOVE W40-PRC	 TO WS-PRC.
	     MOVE W40-CR	 TO WS-CR.
	     MOVE W40-DTE	 TO W20-DTE.
046280	     DISPLAY "Print Document Heading " AT 2502
046290		      WITH BACKGROUND-COLOR 3 FOREGROUND-COLOR 1
		      "Y" WITH BACKGROUND-COLOR 3
			       FOREGROUND-COLOR 6 HIGHLIGHT "/"
		      "N" WITH BACKGROUND-COLOR 3
			       FOREGROUND-COLOR 6 HIGHLIGHT " > <".
046300 BE38.
046310	     ACCEPT WS-OPTION AT 2530
		    WITH BACKGROUND-COLOR 3 FOREGROUND-COLOR 15 AUTO.
	     CALL "CBL_TOUPPER" USING WS-OPTION
				BY VALUE WS-LENGTH
				RETURNING WS-STATUS.
046370	   IF NOT (WS-OPTION = "Y" OR "N")
046380         GO TO BE38.
046390     IF WS-OPTION = "Y"
046400         PERFORM BB050.
046410	     DISPLAY CLEAR-L25.
046420       DISPLAY "Re-printing Document" AT 2520 WITH
046430		      BACKGROUND-COLOR 3 FOREGROUND-COLOR 14 BLINK.
	   IF W90-EXP = "E" OR "X" OR "Y"
               MOVE W05-VATNO    TO W90-TAX
           ELSE
               MOVE SPACES       TO W90-TAX.
             MOVE 1              TO WS-SALKEY.
047140 BE65.
      *
      *    ****    P R I N T   I N V O I C E   H E A D I N G S
      *
026320	     MOVE SPACES	 TO REP-DETAIL2.
	     MOVE X"0E" 	 TO INV-EXP.
	     MOVE "REF No:"	 TO INV-H14.
026590       MOVE W90-REF        TO INV-REF.
026370	     WRITE INV-L1 BEFORE 0 LINES.
026370	     WRITE INV-L1 BEFORE 2 LINES.
026320       MOVE SPACES         TO REP-DETAIL2.
	     MOVE X"0E" 	 TO INV-EXP.
	     MOVE "DATE  :"	 TO INV-H14.
026670       MOVE W12-TODAY      TO INV-DTE.
026370	     WRITE INV-L1 BEFORE 0 LINES.
026370       WRITE INV-L1 BEFORE 1 LINES.
	     MOVE WS-ECAN	 TO REP-DETAIL2.
	     WRITE INV-L1 BEFORE 0 LINES.
026320	     MOVE SPACES	 TO REP-DETAIL2.
	     MOVE "DELIVERY / AFLEWRING"
				 TO INV-DADD2.
026370       WRITE INV-L1 BEFORE 1 LINES.
026320	     MOVE SPACES	 TO REP-DETAIL2.
026330       MOVE W40-NAME       TO INV-NAME.
	     MOVE "PAGE / BLADSY"
				 TO INV-H4.
	     ADD 1		 TO WS-PAGE.
	     MOVE WS-PAGE	 TO INV-PGE.
026370       WRITE INV-L1 BEFORE 1 LINES.
026320	     MOVE SPACES	 TO REP-DETAIL2.
026350       MOVE W40-ADD1       TO INV-NAME.
026360	     MOVE W40-PADD1	 TO INV-DADD2.
026370	     WRITE INV-L1 BEFORE 1 LINES.
026380       MOVE W40-ADD2       TO INV-NAME.
026390	     MOVE W40-PADD2	 TO INV-DADD2.
	     MOVE "ACCOUNT / REKENING"
				 TO INV-H4.
026550	     MOVE W80-ACNO	 TO INV-AC.
026370	     WRITE INV-L1 BEFORE 1 LINES.
026320       MOVE SPACES         TO REP-DETAIL2.
026410       MOVE W40-ADD3       TO INV-NAME.
026420	     MOVE W40-PADD3	 TO INV-DADD2.
026370       WRITE INV-L1 BEFORE 1 LINES.
026320       MOVE SPACES         TO REP-DETAIL2.
026440       MOVE W40-ADD4       TO INV-NAME.
026450	     MOVE W40-PADD4	 TO INV-DADD2.
	     MOVE "ORDER / BESTELLING"
				 TO INV-H4.
026560       MOVE W90-ORD        TO INV-ORD.
026340       WRITE INV-L1 BEFORE 1 LINES.
	     MOVE SPACES	 TO REP-DETAIL2.
026510       MOVE W40-PC1        TO INV-PC1.
026510	     MOVE W40-PC2	 TO INV-PC2.
026370       WRITE INV-L1 BEFORE 1 LINES.
	     MOVE SPACES	 TO REP-DETAIL2.
      *
      *    ****    P R I N T   T E R M S   O N   T H E   I N V O I C E
      *
	     MOVE "TERMS / TERME"
				 TO INV-H4.
028720	   IF DEB-TERMS = "0"
028730	       MOVE "7 Days/Dae" TO INV-TERMS
028740	   ELSE
028750	   IF DEB-TERMS = "2"
028760	       MOVE "60 Days/Dae"
				 TO INV-TERMS
028770	   ELSE
028780	   IF DEB-TERMS = "1"
028790	       MOVE "30 Days/Dae"
				 TO INV-TERMS
028800	   ELSE
028810	       MOVE "COD/KBA"	 TO INV-TERMS.
026430       WRITE INV-L1 BEFORE 1 LINES.
	     MOVE SPACES	 TO REP-DETAIL2.
	   IF W10-SMAN NOT = ZERO
	       MOVE "Assist :"	 TO INV-H3
	       MOVE W40-ASSIST	 TO INV-DADD2.
026460	     WRITE INV-L1 BEFORE 2 LINES.
	     MOVE SPACES	 TO REP-DETAIL2.
	     MOVE "EXCLUSIVE"	 TO INV-H6.
	     MOVE "NETT AMOUNT"  TO INV-H8.
026430	     WRITE INV-L1 BEFORE 0 LINES.
026430	     WRITE INV-L1 BEFORE 1 LINES.
	     MOVE SPACES	 TO REP-DETAIL2.
	     MOVE "DESCRIPTION/BESRYWING"
				 TO INV-H5.
	     MOVE "EKSKLUSIEF"	 TO INV-H6.
	     MOVE "VAT/BTW"	 TO INV-H7.
	     MOVE "NETO BEDRAG"  TO INV-H8.
026430	     WRITE INV-L1 BEFORE 0 LINES.
026430	     WRITE INV-L1 BEFORE 2 LINES.
026500       MOVE SPACES         TO REP-DETAIL2.
026810	     MOVE 31		 TO WS-LINE.
       BE70.
             EXIT.
       BE75.
      *
      *    ****    R E A D   T H E   S A L E   F I L E   A N D
      *            P R I N T   T H E   I N V O I C E
      *
026840     IF WS-SALKEY > WS-LAST
026850         GO TO BE90.
026860       PERFORM READ-SALE THRU READ-SALE-EXIT.
026870     IF WS-LINE > 1
026880         SUBTRACT 1        FROM WS-LINE
026890     ELSE
026900         PERFORM BE88.
      *
      *    ****    P R I N T   T H E   N E X T	 D E T A I L   L I N E
      *
026980	     MOVE SAP-DESC	 TO INV-DESC.
027030	     MOVE SAP-SELL	 TO INV-EXCL W90-VALUE W10-SELL.
027020	     MOVE SAP-VAT	 TO INV-TAX.
	     MOVE SAP-VAL	 TO INV-VAL W25-VALUE.
	     MOVE ZERO		 TO WS-SUPER.
027220*	     ADD W90-VALUE	 TO W90-EXCTOT.
027230	     WRITE INV-L1 BEFORE 1 LINES.
027240	     MOVE SPACES	 TO REP-DETAIL2.
027250       ADD W25-VALUE       TO W90-STOTAL.

027420 BE80.
027750       ADD 1               TO WS-SALKEY.
027760       GO TO BE75.

027840 BE88.
      *
      *    ****    C A R R I E D   F O R W A R D   -   N E X T   P A G E
      *
027860	     MOVE SPACES	 TO REP-DETAIL2.
027870	     MOVE "C/FWD - OORGEDRA"
027880				 TO INV-DADD2.
027890	     MOVE W90-STOTAL	 TO INV-VAL.
027900	     WRITE INV-L1 BEFORE 1 LINES.
027860	     MOVE SPACES	 TO REP-DETAIL2.
	     MOVE "Please check your invoice."
				 TO INV-REMKS.
027900	     WRITE INV-L1 BEFORE 1 LINES.
	     MOVE "Gaan asseblief u faktuur na."
				 TO INV-REMKS.
027900	     WRITE INV-L1 BEFORE 4 LINES.
027940       PERFORM BB050.
027950       PERFORM BE65 THRU BE70.
027970	     MOVE "B/FWD - O/B"  TO INV-DESC.
027980	     MOVE W90-STOTAL	 TO INV-VAL.
028000	     WRITE INV-L1 BEFORE 1 LINES.
027860	     MOVE SPACES	 TO REP-DETAIL2.
027990	     SUBTRACT 2		 FROM WS-LINE.

028010 BE90.
      *
      *    ****    I N V O I C E   T O T A L S
      *
028020	     WRITE INV-L1 BEFORE WS-LINE LINES.
028000	     WRITE INV-L1 BEFORE 1 LINES.
027860	     MOVE SPACES	 TO REP-DETAIL2.
028030	     MOVE ALL "-"	 TO INV-LINE.
      *
      *    ****    P R I N T   S U B - T O T A L
      *
	     MOVE "Please check your invoice."
				 TO INV-REMKS.
028040	     WRITE INV-L1 BEFORE 1 LINES.
027860	     MOVE SPACES	 TO REP-DETAIL2.
	     MOVE "TOTAL/TOTAAL" TO INV-H13.
	     MOVE "Gaan asseblief u faktuur na."
				 TO INV-REMKS.
	     MOVE W90-EXCTOT	 TO INV-EXCL.
028680	     MOVE W90-TTAX	 TO INV-TAX.
028070	     MOVE W90-STOTAL	 TO INV-VAL.
028880	     WRITE INV-L1 BEFORE 0 LINES.
	     MOVE SPACES	 TO INV-REMKS.
028880	     WRITE INV-L1 BEFORE 1 LINES.
	     MOVE SPACES	 TO REP-DETAIL2.
	     MOVE ALL "="	 TO INV-LINE.
028100	   IF DEB-SDISC NOT = ZERO
028110	       MOVE W15-DISC (DEB-SDISC)
028120                           TO W30-PERC
028130	       MOVE W30-MESSAGE  TO INV-RMKS.
028880	     WRITE INV-L1 BEFORE 1 LINES.
	     MOVE SPACES	 TO REP-DETAIL2.
	     MOVE "Processed by APAC Accounting - (011) 791-0883"
				 TO REP-DETAIL2.
028880	     WRITE INV-L1 BEFORE 2 LINES.
028890       MOVE SPACES         TO REP-DETAIL2.
      *
      *    ****    P R I N T   T H E   N E X T   I N V O I C E
      *            H E A D I N G 
      *            ( OVERLAP WITH DISK PROCESSING )
      * 
       BE96.
029170       PERFORM BB050.

       BE99.
             EXIT.
      /
052700 ZA000-INIT	       SECTION 90.
052710 ZA000-OPEN.
055960	     MOVE LS-COMPANY	 TO WS-TOP-COMP.
	     MOVE LS-PARID	 TO WS-PARID.
	     MOVE LS-L-OR-N	 TO W02-L-OR-N.
	     MOVE WS-SYS-ID	 TO W02-SYSID.
	     MOVE LS-TODAY-DDMMYY
				 TO TODAY-DDMMYY.
	     MOVE LS-USUB	 TO WS-USUB.
	     MOVE LS-DRAW	 TO WS-DRAW.
      *
      *    ****    P A R A M E T E R   F I L E
      *
       ZA00A.
	     MOVE "PARAM"	 TO AFID-KEY.

       ZA00-READ-APACFIDS.
000030	     READ APACFIDS WITH IGNORE LOCK
	       KEY IS AFID-KEY.
	   IF WS-STATUS = "00"
	       GO TO ZA00-READ-APACFIDS-EXIT.
006260	     STRING "Missing " DELIMITED SIZE
		     AFID-KEY DELIMITED BY " "
		     " file ID - Status " DELIMITED SIZE
		     WS-STATUS DELIMITED SIZE
		     INTO WS-ERR-MES.
	     PERFORM ERROR-LENGTH THRU ERROR-EXIT.
006370	     STOP RUN.

       ZA00-READ-APACFIDS-EXIT.
	     EXIT.

       ZA00A-CONTINUE.
	     MOVE AFID-PATH	 TO W02-PARAM.
	     MOVE "AUDITF"	 TO AFID-KEY.
	     PERFORM ZA00-READ-APACFIDS THRU ZA00-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-AUDITF.
	     MOVE "DBTRAN"	 TO AFID-KEY.
	     PERFORM ZA00-READ-APACFIDS THRU ZA00-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-DBTRAN.
	     MOVE "DEBTOR"	 TO AFID-KEY.
	     PERFORM ZA00-READ-APACFIDS THRU ZA00-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-DEBTOR.
	     MOVE "DEPART"	 TO AFID-KEY.
	     PERFORM ZA00-READ-APACFIDS THRU ZA00-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-DEPART.
	     MOVE "INVOIC"	 TO AFID-KEY.
	     PERFORM ZA00-READ-APACFIDS THRU ZA00-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-INVOIC.
	     MOVE "LEDTRF"	 TO AFID-KEY.
	     PERFORM ZA00-READ-APACFIDS THRU ZA00-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-LEDTRF.
	     MOVE "NETWORK"	 TO AFID-KEY.
	     PERFORM ZA00-READ-APACFIDS THRU ZA00-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-NETWORK.
	     MOVE "RECOVER"	 TO AFID-KEY.
	     PERFORM ZA00-READ-APACFIDS THRU ZA00-READ-APACFIDS-EXIT.
	     INSPECT AFID-PATH REPLACING FIRST "XXX"
			       BY LS-USER.
	     MOVE AFID-PATH	 TO W02-RECOVER.
	     MOVE "SALE"	 TO AFID-KEY.
	     PERFORM ZA00-READ-APACFIDS THRU ZA00-READ-APACFIDS-EXIT.
	     INSPECT AFID-PATH REPLACING FIRST "XXX"
			       BY LS-USER.
	     MOVE AFID-PATH	 TO W02-SALE.
	     MOVE "SHARED"	 TO AFID-KEY.
	     PERFORM ZA00-READ-APACFIDS THRU ZA00-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-SHARED.
	     MOVE "TXTRAN"	 TO AFID-KEY.
	     PERFORM ZA00-READ-APACFIDS THRU ZA00-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-TXTRAN.
052980	     MOVE 3		 TO WS-PARKEY.
052990       PERFORM READ-PARAM THRU READ-PARAM-EXIT.
053550	     MOVE PAR-VAT-REG	 TO W05-VATNO.
	   IF LS-USER NUMERIC
	       IF LS-USE > ZERO AND < 110
		   MOVE LS-USE	 TO WS-USUB
                   GO TO ZA01A.
             MOVE 110            TO WS-USUB.
       ZA01A.
014240       ADD 2549 WS-USUB    GIVING W25-RESULT.
             MOVE W25-KEY        TO WS-PARKEY.
             ADD 1 W25-SUB       GIVING WS-S6.
014250       PERFORM READ-PARAM THRU READ-PARAM-EXIT.
           IF TRM-INVP (WS-S6) = 1
               MOVE "LPT1"       TO W02-PRINTER
           ELSE
           IF TRM-INVP (WS-S6) = 2
               MOVE "LPT2"       TO W02-PRINTER
           ELSE
           IF TRM-INVP (WS-S6) = 3
               MOVE "LPT3"       TO W02-PRINTER
           ELSE
           IF TRM-INVP (WS-S6) = 4
               MOVE "COM1"       TO W02-PRINTER
           ELSE
           IF TRM-INVP (WS-S6) = 5
               MOVE "COM2"       TO W02-PRINTER
           ELSE
           IF TRM-INVP (WS-S6) = 9
	       MOVE LS-USER	 TO W02-USER.
             ADD 501 TRM-PRN2 (WS-S6)
                                 GIVING W25-RESULT.
             DIVIDE W25-RESULT BY 2
                                 GIVING WS-PARKEY
                                 REMAINDER WS-S6.
             ADD 1               TO WS-S6.
             PERFORM READ-PARAM THRU READ-PARAM-EXIT.
             MOVE TRM-CONP (WS-S6)
                                 TO WS-COND.
             MOVE TRM-NORP (WS-S6)
                                 TO WS-NORM.
             MOVE TRM-EXPP (WS-S6)
                                 TO WS-EXPP.
             MOVE TRM-ECAN (WS-S6)
                                 TO WS-ECAN.
             MOVE TRM-8LPI (WS-S6)
                                 TO WS-8LPI.
             MOVE TRM-6LPI (WS-S6)
                                 TO WS-6LPI.
             MOVE TRM-10CPI (WS-S6)
                                 TO WS-10CPI.
             MOVE TRM-12CPI (WS-S6)
                                 TO WS-12CPI.
             MOVE TRM-17CPI (WS-S6)
                                 TO WS-17CPI.
	     MOVE TRM-LENGTH (WS-S6)
				 TO WS-PRN-LENGTH.
	     MOVE TRM-PAGE (WS-S6)
				 TO WS-PGE-LENGTH.
       ZA01B.
042490	     OPEN OUTPUT RECOVER.
042500       CLOSE RECOVER.
042510       OPEN I-O RECOVER.
052760	     DISPLAY "Waiting for printer response" AT 2525
052770		      WITH BACKGROUND-COLOR 3
			   FOREGROUND-COLOR 6 HIGHLIGHT BLINK.
053560       OPEN OUTPUT PRNREP.
	     CALL X"91" USING X91-RES X91-FUN PRNREP.
	     DISPLAY SPACES AT 2525
		     WITH BACKGROUND-COLOR 3 FOREGROUND-COLOR 1.
053570	     MOVE WS-17CPI	 TO REP-DETAIL2.
053580       WRITE REP-LINE2 BEFORE 0 LINES.
053590       MOVE SPACES         TO REP-DETAIL2.
054760       MOVE 1              TO WS-PARKEY.
054770       PERFORM READ-PARAM THRU READ-PARAM-EXIT.
054780       MOVE PAR-DMY        TO W12-TODAY.
054790       MOVE PAR-YMD        TO W12-T-YMD.
054800       MOVE PAR-COMPANY    TO W95-COMP.
054820       MOVE PAR-TELEPHONE  TO W95-TEL.
054830     IF PAR-STMINV = "I" OR "X"
054840         MOVE "N"          TO WS-HEAD
054850     ELSE
054860         MOVE "Y"          TO WS-HEAD.
054870       ADD 1               TO WS-PARKEY.
054880       PERFORM READ-PARAM THRU READ-PARAM-EXIT.
054890       MOVE PAR-ADDRESS1   TO W95-ADD1.
054900       MOVE PAR-ADDRESS2   TO W95-ADD2.
054910       MOVE PAR-ADDRESS3   TO W95-ADD3.
054920       MOVE PAR-ADDRESS4   TO W95-ADD4.
054930       MOVE PAR-POST-CDE   TO W95-POST.
054940     IF W95-ADD4 = SPACES
054950         MOVE W95-PC       TO W95-ADD4
054960         MOVE SPACES       TO W95-PC.
054970     IF W95-ADD3 = SPACES
054980         MOVE W95-ADD4     TO W95-ADD3
054990         MOVE SPACES       TO W95-ADD4.
055000     IF W95-ADD2 = SPACES
055010         MOVE W95-ADD3     TO W95-ADD2
055020         MOVE SPACES       TO W95-ADD3.
055030     IF W95-ADD1 = SPACES
055040         MOVE W95-ADD2     TO W95-ADD1
055050         MOVE SPACES       TO W95-ADD2.
054710       MOVE 5              TO WS-PARKEY.
054720       PERFORM READ-PARAM THRU READ-PARAM-EXIT.
054750	     MOVE PAR-DISCOUNT	 TO W15-DISCOUNT.
	     MOVE 1		 TO W05-V-RATE.

       ZA05-VAT.
	     MOVE W05-VAT-CODE	 TO DPT-CODE.
	     PERFORM READ-DEPART THRU READ-DEPART-EXIT.
	     MOVE DPT-R-DATE	 TO WS-VAT-DATE(W05-V-RATE).
	     MOVE DPT-RATE	 TO W05-VAT(W05-V-RATE).
	     ADD 6 W05-V-RATE	 GIVING WS-S1.
	     MOVE DPT-P-RATE	 TO W05-VAT(WS-S1).
	   IF W05-V-RATE < 6
	       ADD 1		 TO W05-V-RATE
	       GO TO ZA05-VAT.
042520	     MOVE 6		 TO WS-PARKEY.
042550       PERFORM READ-PARAM THRU READ-PARAM-EXIT.
           IF PAR-INTEGRATE NOT = "Y"
               MOVE "N"          TO WX-INT
           ELSE
               MOVE "Y"          TO WX-INT.
             MOVE PAR-DEBGL      TO WX-DEBGL.
             MOVE PAR-CREGL      TO WX-CREGL.
             MOVE PAR-INTGL      TO WX-INTGL.
             MOVE PAR-BNKGL      TO WX-BNKGL.
             MOVE PAR-UNPROF     TO WX-UNPROF.
             MOVE PAR-REDGL      TO WX-REDGL.
             MOVE PAR-ADJGL      TO WX-ADJGL.
             MOVE PAR-RLGL       TO WX-RLGL.
             MOVE PAR-DSGL       TO WX-DSGL.
055260       GO TO ZA999.
055270 ZA49.
055280       DISPLAY "Too many files OPEN" AT 0812
055290                WITH FOREGROUND-COLOR 14.
055300       DISPLAY "Check the FILES option in CONFIG.SYS" AT 1012.
055310       DISPLAY "Press any key to continue" AT 1212.
055320       ACCEPT WS-OPTION AT 1238 WITH FOREGROUND-COLOR 15.
055330       GO TO ZA205.
055970 ZA200.
055980       DISPLAY "Files locked - Try later" AT 2312
055990                WITH FOREGROUND-COLOR 14
056000               " " WS-STATUS WITH FOREGROUND-COLOR 15.
056010       DISPLAY "Press any key" AT 2512 
056020		      WITH BACKGROUND-COLOR 3 FOREGROUND-COLOR 14.
056030	     ACCEPT WS-OPTION AT 2526
		    WITH BACKGROUND-COLOR 3 FOREGROUND-COLOR 15 AUTO.
056040 ZA205.
056050       EXIT PROGRAM.
056060 ZA999.
056070       EXIT.

056090 I-O-ERRORS      SECTION	91.
056100 OPEN-ERROR.
056110       DISPLAY CLR-SCREEN.
056120       DISPLAY "Open error" AT 0812 WITH FOREGROUND-COLOR 14.
056130       PERFORM DISPLAY-FILE-NAME.
056140
056150 READ-ERROR.
056160       DISPLAY CLR-SCREEN.
056170       DISPLAY "Read error" AT 0812 WITH FOREGROUND-COLOR 14.
056180       PERFORM DISPLAY-FILE-NAME.
056190
056200 WRITE-ERROR.
056210       DISPLAY CLR-SCREEN.
056220       DISPLAY "Write error" AT 0812 WITH FOREGROUND-COLOR 14.
056230       PERFORM DISPLAY-FILE-NAME.
056240

056260 DISPLAY-FILE-NAME.
056270     IF WS-F-ERROR = 1
056280         MOVE W02-AUDITF TO WS-FILE
056290         MOVE WS-AUDKEY TO WS-KEY
056300     ELSE
056310     IF WS-F-ERROR = 2
056320         MOVE W02-NETWORK TO WS-FILE
056330         MOVE WS-NETKEY TO WS-KEY
056340     ELSE
056350     IF WS-F-ERROR = 5
056360         MOVE W02-DBTRAN TO WS-FILE
041750         MOVE ZERO         TO WS-KEY
               MOVE TRA-KEY      TO WS-KEYX
056380     ELSE
056390     IF WS-F-ERROR = 6
056400         MOVE W02-DEBTOR TO WS-FILE
041790         MOVE ZERO         TO WS-KEY
               MOVE DEB-ACNO     TO WS-KEYX
056420     ELSE
056430     IF WS-F-ERROR = 7
041820	       MOVE W02-DEPART	 TO WS-FILE
041870	       MOVE ZERO	 TO WS-KEY
041830	       MOVE DPT-CODE	 TO WS-KEYX
056460	   ELSE
056470     IF WS-F-ERROR = 12
056480         MOVE W02-INVOIC   TO WS-FILE
056490         MOVE ZERO         TO WS-KEY
               MOVE DOC-KEY      TO WS-KEYX
056500	   ELSE
056510     IF WS-F-ERROR = 15
056520         MOVE WS-PARID     TO WS-FILE
056530         MOVE WS-PARKEY    TO WS-KEY
056540     ELSE
056550     IF WS-F-ERROR = 18
056560         MOVE W02-RECOVER  TO WS-FILE
056570         MOVE WS-RECKEY    TO WS-KEY
056580     ELSE
056590     IF WS-F-ERROR = 19
056600         MOVE W02-SALE TO WS-FILE
056610         MOVE WS-SALKEY TO WS-KEY
056700	   ELSE
056710     IF WS-F-ERROR = 32
056720         MOVE W02-TXTRAN   TO WS-FILE
056730         MOVE ZERO         TO WS-KEY
	       MOVE TAX-KEY	 TO WS-KEYX
041840	   ELSE
041850	   IF WS-F-ERROR = 37
041860	       MOVE W02-SHARED	 TO WS-FILE
041870	       MOVE WS-SHARED	 TO WS-KEY
041840	   ELSE
041850     IF WS-F-ERROR = 40
041860         MOVE W02-LEDTRF   TO WS-FILE
041870         MOVE ZERO         TO WS-KEY
               MOVE XFR-KEY      TO WS-KEYX.
056740     IF WS-STATUS = "10"
056750         MOVE "End of FILE" TO WS-STAT-MESSAGE
056760     ELSE
056770     IF WS-STATUS = "22"
056780         MOVE "Duplicate record number" TO WS-STAT-MESSAGE
056790     ELSE
056800     IF WS-STATUS = "23"
056810         MOVE "Invalid record number" TO WS-STAT-MESSAGE
056820     ELSE
056830     IF WS-STATUS = "24"
056840         MOVE "DISK full" TO WS-STAT-MESSAGE
056850     ELSE
056860     IF WS-STATUS = "30"
056870         MOVE "DISK error" TO WS-STAT-MESSAGE
056880     ELSE
056890     IF WS-STATUS = "94"
056900         MOVE "FILE locked" TO WS-STAT-MESSAGE.
056910       DISPLAY "File - " AT 1012 WS-FILE WITH FOREGROUND-COLOR 11.
056920       DISPLAY "Status " AT 1212 
056930                WS-STATUS WITH FOREGROUND-COLOR 11
056940               ": " WS-STAT-MESSAGE WITH FOREGROUND-COLOR 14.
056950     IF WS-STATUS NOT = "94" 
056960         DISPLAY "Key    " AT 1412 
056970                  WS-KEY WITH FOREGROUND-COLOR 11
056980         DISPLAY "Reverse backup or contact program Support"
056990                  AT 1612.
057000         DISPLAY "Please make a note of these details" AT 1812.
057010       STOP RUN.
