      $set LINKCOUNT"384"
      ******************************************************************
      *                                                                *
      *    ******   **	      *******	  ****	  ********	**     *
      *   **	**  **	      **    **	 **  **   **	       ***     *
      *   **	    **	      **    **	**    **  *******     * **     *
      *   **	    **	      *******	**    **	**   *	**     *
      *   **   ***  **	      **	**    **	**  *******    *
      *   **	**  **	      **	 **  **   **	**	**     *
      *    ******   ********  **	  ****	   ******      ****    *
      * 							       *
      *     ENGLISH                                                    *
      *                                                                *
      *     G / L E D G E R   I N T .	B A T C H   A M E N D M E N T  *
      *                                                                *
      *     VERSION 8.13.07 - March 2008			       *
      * 							       *
      ******************************************************************
000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID.	       GLP054.
000030 AUTHOR.                 J.W. LEMMON (APAC).
000040 DATE-WRITTEN.           OCTOBER 1992.

		   COPYRIGHT NOTICE: COPYRIGHT (C) 1992 - 2008
				     by James William Lemmon.
				       (Id No. 4412165050082).

		   All rights reserved.

		   e-mail jwlemmon@gmail.com.

000050 SECURITY.
		   This program is free software; you can redistribute
		   it and/or modify it under the terms of the GNU General
		   Public License as published by the Free Software
		   Foundation; either version 2 of the License, or (at
		   your option) any later version.

		   This program is distributed in the hope that it will
		   be useful, but WITHOUT ANY WARRANTY; without even the
		   implied warranty of MERCHANTABILITY or FITNESS FOR A
		   PARTICULAR PURPOSE.	See the GNU General Public License
		   for more details.

		   You should have received a copy of the GNU General
		   Public License along with this program; if not, write
		   to the Free Software Foundation, Inc., 59 Temple Place
		   - Suite 330, Boston, MA 02111-1307, USA.

000070 ENVIRONMENT DIVISION.
000080 CONFIGURATION SECTION.
000090 SPECIAL-NAMES.
000080		       CURSOR IS CSTART
000090		       CONSOLE IS CRT
		       CRT STATUS IS KEY-STATUS.
000110 INPUT-OUTPUT SECTION.
000120 FILE-CONTROL.

       COPY APACFIDS.SL.

       COPY CONTROL.SL.

000140 COPY PARAM.SL.

000160 COPY GACCNT.SL.

       COPY LEDTRF.SL.

000270 DATA DIVISION.
000280 FILE SECTION.

       COPY APACFIDS.FDE.

       COPY CONTROL.FDE.

000300 COPY PARAM.FDE.

000320 COPY GACCNT.FDE.

       COPY LEDTRF.FDE.

      /
001690 WORKING-STORAGE SECTION.
       77  WS-CHECK	   PIC	X(18)	 VALUE
			   "aeWlimemnomLalismJ".
001700 77  WS-PARKEY	   PIC	9(04)	 COMP-5 VALUE 1.
001690 77  WS-ENQPOS	   PIC	9(06)	 COMP-5.
001700 77  WS-ENQEND       PIC  9(06)    COMP-5.
001730 77  WS-NETKEY       PIC  9(04)    COMP-5 VALUE 1.
001740 77  WS-KEYSTR       PIC  9(06)    COMP-5.
001750 77  WS-KSTORE       PIC  9(06)    COMP-5.
001760 77  WS-SKSTORE      PIC  9(06)    COMP-5.
001770 77  WS-INKEY        PIC  9(06)    COMP-5.
001780 77  WS-COKEY        PIC  9(06)    COMP-5.
001790 77  WS-GLJSTR       PIC  9(04)    COMP-5.
001800 77  WS-GLJKEY       PIC  9(06)    COMP-5.
001810 77  WS-RECKEY       PIC  9(04)    COMP-5.
001840 77  WS-ISUB         PIC  9(04)    COMP-5.
001850 77  WS-CHEQUE       PIC  9(04)    COMP-5.
001880 77  WS-SUB	   PIC	9(04)	 COMP-5.
001880 77  WS-S            PIC  9(04)    COMP-5.
001880 77  WS-S1           PIC  9(04)    COMP-5.
001890 77  WS-S2           PIC  9(04)    COMP-5.
001890 77  WS-S3           PIC  9(04)    COMP-5.
001890 77  WS-S4	   PIC	9(04)	 COMP-5.
001890 77  WS-S6           PIC  9(04)    COMP-5.
001890 77  WS-IXS1	   PIC	9(04)	 COMP-5.
001900 77  WS-Y-END        PIC  9(02) VALUE ZERO.
001900 77  WS-L-END	   PIC	9(04) VALUE ZERO.
001900 77  WS-OPEN         PIC  9(02) VALUE ZERO.
001910 77  WS-MS1          PIC  9(04)    COMP-5.
001920 77  WS-MS2          PIC  9(04)    COMP-5.
001930 77  WS-VALUE        PIC S9(09)V99 COMP-3.
001940 77  WS-EXS          PIC  9(01).
001950 77  WS-CONREC       PIC  9(01) VALUE ZERO.
001960 77  WS-REF-TYPE	   PIC	X(01).
001970 77  WS-OPTION       PIC  X(01).
001970 77  WS-SKIP         PIC  X(01) VALUE "N".
002010 77  WS-ERROR	   PIC	9(01) VALUE ZERO.
002080 77  WS-TNEXT        PIC  9(04)    COMP-5.
002080 77  WS-PERIOD       PIC  9(02)    COMP-5 VALUE ZERO.
002150 77  WS-ER1	   PIC	X(07) VALUE "Account".
002160 77  WS-ER3          PIC  X(04) VALUE "Date".
002170 77  WS-ER4          PIC  X(05) VALUE "Value".
002190 77  WS-ER6	   PIC	X(09) VALUE "No Record".
002200 77  WS-ER7          PIC  X(13) VALUE "Group Heading".
       77  TODAY-DDMMYY	   PIC	9(08) COMP-5.
       77  WS-USUB	   PIC	9(04) COMP-5.
      /
002420 01  WS-DB-LINE.
002430     03  WS-TOP-LNE.
002440         05  WS-TCHR PIC X(01) OCCURS 80.
           03  WS-T-LINE REDEFINES WS-TOP-LNE.
               05  FILLER  PIC X(01).
               05  WS-H-LINE
                           PIC X(78).
               05  FILLER  PIC X(01).
002430     03  WS-TOP-LNE2.
002440         05  WS-TCH  PIC X(01) OCCURS 80.
           03  WS-TP-LINE2 REDEFINES WS-TOP-LNE2.
               05  FILLER      PIC  X(01).
               05  WS-TOP-COMP PIC  X(40).
001430	       05  FILLER      PIC  X(23).
	       05  WS-WRKHD    PIC  X(11).
001430	       05  FILLER      PIC  X(01).
	       05  WS-WRKST    PIC  X(03).
001430	       05  FILLER      PIC  X(01).
002450	   03  WS-MID-LNE.
002460         05  WS-MCHR PIC X(01) OCCURS 80.
	   03  WS-MDGL-LNE REDEFINES WS-MID-LNE.
	       05  WS-MGL1     PIC X(01).
	       05  WS-MGL78    PIC X(78).
	       05  WS-MGL80    PIC X(01).
002450	   03  WS-MID-LNE2.
	       05  FILLER      PIC  X(01) VALUE "³".
	       05  WS-BLNK78   PIC  X(78) VALUE ALL "°".
	       05  FILLER      PIC  X(01) VALUE "³".
002470	   03  WS-BOT-LNE.
002480         05  WS-BCHR PIC X(01) OCCURS 80.
           03  WS-B-LINE REDEFINES WS-BOT-LNE.
               05  FILLER  PIC X(01).
               05  WS-F-LINE
                           PIC X(78).
               05  FILLER  PIC X(01).
002470     03  WS-BOT-LNE2.
002480         05  WS-BCH  PIC X(01) OCCURS 80.

002220 COPY WS.WS.

       01  WS-HELP.
	   03  WS-MODULE       PIC  X(03) VALUE "GLP".
	   03  WS-PROG	       PIC  X(03) VALUE "054".

000290 01  WS-PARID.
000020	   03  WS-SYS-ID       PIC  X(03).

002330 01  W02-FID.

       COPY APACFIDS.ID.

       COPY CONTROL.ID.

000320 COPY GACCNT.ID.

       COPY LEDTRF.ID.

       COPY PARAM.ID.

       01  W02-FILE-IDS.
           03  W02-PRINTER.
	       05  W02-REPORT PIC X(07) VALUE "GLP054.".
               05  W02-USER   PIC X(05) VALUE SPACES.

       COPY W05.GL.

002370 01  W10-H2.
002380     03  FILLER      PIC X(02) VALUE "-".
002390     03  W10-HEAD    PIC X(25).

       COPY W15.GL.

003060 01  W20-TOTALS.
003070     03  W20-DEBIT   PIC S9(09)V99 COMP-3.
003080     03  W20-CREDIT  PIC S9(09)V99 COMP-3.
003090     03  W20-RESULT  PIC S9(09)V99.
003100     03  W20-RES1    REDEFINES W20-RESULT.
003110         05  W20-WHOLE
003120                     PIC  9(09).
003130         05  W20-DEC PIC S9(02).
003140     03  W20-TOTAL   PIC S9(09)V99 COMP-3.
003150     03  W20-STOTAL  PIC S9(09)V99 COMP-3.
003160     03  W20-BTOTAL  PIC S9(09)    COMP-3.
003170     03  W20-INTOT   PIC S9(09)V99 COMP-3.
003180     03  W20-COTOT   PIC S9(09)V99 COMP-3.
003190     03  W20-GTOT.
003200         05  W20-GRPTOT
003210                     PIC S9(09)V99 COMP-3 OCCURS 12.
003220     03  W20-STOT.
003230         05  W20-SUBTOT
003240                     PIC S9(09)V99 COMP-3 OCCURS 12.

003250 01  W20-INPUT.
003260     03  W20-ACCOUNT PIC  9(06).
003270     03  W20-ACNO1   REDEFINES W20-ACCOUNT.
003280         05  W20-ACNO
003290                     PIC 9(04).
003300         05  W20-SER PIC  9(02).
003310     03  W20-ACNO2   REDEFINES W20-ACCOUNT.
003320         05  W20-GR  PIC  9(02).
003330         05  W20-SGRP
003340                     PIC 9(02).
003350         05  W20-ASER
003360                     PIC 9(02).
003370     03  W20-ACNO3   REDEFINES W20-ACCOUNT.
003380         05  W20-GROUP
003390                     PIC 9(02).
003400         05  W20-REST
003410                     PIC 9(04).

002850 01  W25-CALCS.
002860     03  W25-RESULT      PIC 9(05)V99.
002870     03  W25-RESULT1 REDEFINES W25-RESULT.
002880         05  W25-WHOLE   PIC 9(05).
002890         05  W25-DECIMAL PIC 9(02).
           03  W25-RESULT2 REDEFINES W25-RESULT.
               05  W25-KEY    PIC 9(04).
               05  W25-SUB    PIC 9(01).
               05  FILLER     PIC 9(02).
003420 01  W25-EDIT.
003430     03  W25-7.
003440         05  W25-1   PIC  ZZZZZZZZ9-.
003450     03  W25-S7V2.
003460         05  W25-V1  PIC  Z(07)9.99CR.
003990	   03  W25-S8V2.
004000	       05  W25-VG1     PIC Z(07)9.99CR.
003470	   03  W25-DATE.
003480	       05  W25-DTE PIC	Z9/99/9999.
003490     03  W25-REF.
003500         05  W25-REFER
003510                     PIC Z(07).
003520     03  W25-RECKEY  PIC  Z(04)9.

003530 01  W30-MONTH-NAMES.
003540     03  W30-MONTHS.
003550         05  FILLER  PIC  X(24) VALUE
003560                     "Jan:Feb:Mar:Apr:May:Jun:".
003570         05  FILLER  PIC X(24) VALUE
003580                     "Jul:Aug:Sep:Oct:Nov:Dec:".
003590     03  W30-MNTHS REDEFINES W30-MONTHS.
003600         05  W30-MONTH OCCURS 12.
003610             07  W30-MTH PIC X(03).
003620             07  FILLER  PIC X(01).

003630 01  W35-MONTH-NAMES.
003640     03  W35-MONTHS.
003650         05  W35-MONTH OCCURS 12.
003660             07  W35-MTH PIC X(03).
003670             07  FILLER  PIC X(01).
003680     03  W35-MTHS REDEFINES W35-MONTHS.
003690         05  W35-MTH1.
003700             07  W35-M1  PIC X(03).
003710             07  FILLER  PIC X(01).
003720         05  W35-MTH2.
003730             07  W35-M2  PIC X(03).
003740             07  FILLER  PIC X(01).
003750         05  W35-MTH3.
003760             07  W35-M3  PIC X(03).
003770             07  FILLER  PIC X(01).
003780         05  W35-MTH4.
003790             07  W35-M4  PIC X(03).
003800             07  FILLER  PIC X(01).
003810         05  W35-MTH5.
003820             07  W35-M5  PIC X(03).
003830             07  FILLER  PIC X(01).
003840         05  W35-MTH6.
003850             07  W35-M6  PIC X(03).
003860             07  FILLER  PIC X(01).
003870         05  W35-MTH7.
003880             07  W35-M7  PIC X(03).
003890             07  FILLER  PIC X(01).
003900         05  W35-MTH8.
003910             07  W35-M8  PIC X(03).
003920             07  FILLER  PIC X(01).
003930         05  W35-MTH9.
003940             07  W35-M9  PIC X(03).
003950             07  FILLER  PIC X(01).
003960         05  W35-MTH10.
003970             07  W35-M10 PIC X(03).
003980             07  FILLER  PIC X(01).
003990         05  W35-MTH11.
004000             07  W35-M11 PIC X(03).
004010             07  FILLER  PIC X(01).
004020         05  W35-MTH12.
004030             07  W35-M12 PIC X(03).
004040             07  FILLER  PIC X(01).

004050 01  W40-CUR-YEAR.
004060	   03  W40-YEAR    PIC	9(04) COMP-5 OCCURS 12.

       COPY W40.WS.

       COPY FUNCTION.WS.

004070 01  W50-CALC.
004080     05  W50-ACNTS   OCCURS 30.
004090         07  W50-ANO PIC  9(06)    COMP-3.
004100         07  W50-PER PIC S9(03)V99 COMP-3.

004110 01  W55-TOTALS.
004120     03  W55-VAL     PIC S9(09)    COMP-3 OCCURS 12.
004130 01  W55-TOT         REDEFINES W55-TOTALS.
004140     03  W55-1       PIC S9(09)    COMP-3.
004150     03  W55-2       PIC S9(09)    COMP-3.
004160     03  W55-3       PIC S9(09)    COMP-3.
004170     03  W55-4       PIC S9(09)    COMP-3.
004180     03  W55-5       PIC S9(09)    COMP-3.
004190     03  W55-6       PIC S9(09)    COMP-3.
004200     03  W55-7       PIC S9(09)    COMP-3.
004210     03  W55-8       PIC S9(09)    COMP-3.
004220     03  W55-9       PIC S9(09)    COMP-3.
004230     03  W55-10      PIC S9(09)    COMP-3.
004240     03  W55-11      PIC S9(09)    COMP-3.
004250     03  W55-12      PIC S9(09)    COMP-3.

004260 01  W60-TOTALS.
004270     03  W60-VAL     PIC S9(09)    COMP-3 OCCURS 12.

004280 01  W65-TOTALS.
004290     03  W65-VAL     PIC S9(09)    COMP-3 OCCURS 12.

004300 01  W70-ACTS.
004310     03  W70-BRANCH  PIC  9(04)    COMP-5.

004470 COPY W70.WS.

       01  W75-KEYS.
           03  W75-S          PIC 9(02) COMP-5.
           03  W75-S1         PIC 9(02) COMP-5.
	   03  W75-GNO	      PIC 9(06) COMP-5
                              OCCURS 18.

004540 01  W90-COMP.
004550     03  W90-CNAME   PIC  X(40).

       LINKAGE SECTION.

       COPY CHAIN.LS.

      /
004560 SCREEN SECTION.

       COPY BLANK.CRT.

       01  S05.
005490	   03  LINE 3 COLUMN 24 FOREGROUND-COLOR 7 HIGHLIGHT
005500		      VALUE "GENERAL LEDGER - AMEND INT. BATCH".
005510     03  LINE 5 COLUMN  3 VALUE "Account".
005520     03         COLUMN 13 VALUE "Date".
005530	   03	      COLUMN 20 VALUE "Type Ref".
005540     03         COLUMN 30 VALUE 
005550                          "____________ Narrative _____________".
005560     03         COLUMN 73 VALUE "Value".
005570 01  S05A.
005580	   03  LINE  9 COLUMN 20 VALUE	"Totals".
005590	   03	       COLUMN 29 FOREGROUND-COLOR 7 HIGHLIGHT
				 BACKGROUND-COLOR 5
005600                           PIC Z(07)9.99CR USING W20-DEBIT AUTO.
005610	   03	       COLUMN 46 FOREGROUND-COLOR 7 HIGHLIGHT
				 BACKGROUND-COLOR 5
005620                           PIC Z(07)9.99CR USING W20-CREDIT AUTO.

006330 01  S13.
006340	   03  FOREGROUND-COLOR 7 HIGHLIGHT
	       BACKGROUND-COLOR 5 PIC Z9/99/9999 USING W15-DATE AUTO.

006350 01  S14.
006360	   03  FOREGROUND-COLOR 7 HIGHLIGHT
	       BACKGROUND-COLOR 5 PIC Z(07)9.99CR USING W15-VAL AUTO.

       01  S16.
002970	   03  FOREGROUND-COLOR 7 HIGHLIGHT
	       BACKGROUND-COLOR 5 PIC Z9 USING W15-TYPE AUTO.

       01  S16A-DT.
002970	   03  FOREGROUND-COLOR 7 HIGHLIGHT
	       BACKGROUND-COLOR 5 PIC Z9 USING W15-TRN AUTO.

       01  S16A-L.
002970	   03  FOREGROUND-COLOR 7 HIGHLIGHT
	       BACKGROUND-COLOR 5 PIC X(04) USING W15-ILEDG AUTO.

       01  S16B.
005580	   03  LINE 11 COLUMN  2 VALUE	"Type:"
				 FOREGROUND-COLOR 3 HIGHLIGHT.
	   03	       COLUMN  7 VALUE "01"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN  9 VALUE "=Debtors          "
				 FOREGROUND-COLOR 7 HIGHLIGHT.
	   03  LINE 12 COLUMN  7 VALUE "02"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN  9 VALUE "=Creditors        "
				 FOREGROUND-COLOR 7 HIGHLIGHT.
	   03  LINE 13 COLUMN  7 VALUE "03"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN  9 VALUE "=Bad Debts        "
				 FOREGROUND-COLOR 7 HIGHLIGHT.
	   03  LINE 14 COLUMN  7 VALUE "04"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN  9 VALUE "=Sales            "
				 FOREGROUND-COLOR 7 HIGHLIGHT.
	   03  LINE 15 COLUMN  7 VALUE "05"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN  9 VALUE "=  (RETURNS)      "
				 FOREGROUND-COLOR 7 HIGHLIGHT.
	   03  LINE 16 COLUMN  7 VALUE "06"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN  9 VALUE "=Purchases        "
				 FOREGROUND-COLOR 7 HIGHLIGHT.
	   03  LINE 17 COLUMN  7 VALUE "07"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN  9 VALUE "=  (RETURNS)      "
				 FOREGROUND-COLOR 7 HIGHLIGHT.
	   03  LINE 18 COLUMN  7 VALUE "08"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN  9 VALUE "=Cost-of-Sales    "
				 FOREGROUND-COLOR 7 HIGHLIGHT.
	   03  LINE 19 COLUMN  7 VALUE "09"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN  9 VALUE "=  (RETURNS)      "
				 FOREGROUND-COLOR 7 HIGHLIGHT.
	   03  LINE 20 COLUMN  7 VALUE "10"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN  9 VALUE "=Out VAT-Debtors  "
				 FOREGROUND-COLOR 7 HIGHLIGHT.
005580	   03  LINE 21 COLUMN  7 VALUE "11"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN  9 VALUE "=In VAT-Debtors   "
				 FOREGROUND-COLOR 7 HIGHLIGHT.
	   03  LINE 22 COLUMN  7 VALUE "12"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN  9 VALUE "=Out VAT-Creditors"
				 FOREGROUND-COLOR 7 HIGHLIGHT.
	   03  LINE 23 COLUMN  7 VALUE "13"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN  9 VALUE "=In VAT-Creditors      "
				 FOREGROUND-COLOR 7 HIGHLIGHT.
	   03  LINE 11 COLUMN 28 VALUE "14"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN 30 VALUE "=Debtor Transactions   "
				 FOREGROUND-COLOR 7 HIGHLIGHT.
	   03  LINE 12 COLUMN 28 VALUE "15"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN 30 VALUE "=Disc. Given (SALES)   "
				 FOREGROUND-COLOR 7 HIGHLIGHT.
	   03  LINE 13 COLUMN 28 VALUE "16"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN 30 VALUE "=  (RETURNS)           "
				 FOREGROUND-COLOR 7 HIGHLIGHT.
	   03  LINE 14 COLUMN 28 VALUE "17"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN 30 VALUE "=Ad-Valorem (SALES)    "
				 FOREGROUND-COLOR 7 HIGHLIGHT.
	   03  LINE 15 COLUMN 28 VALUE "18"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN 30 VALUE "=  (RETURNS)           "
				 FOREGROUND-COLOR 7 HIGHLIGHT.
	   03  LINE 16 COLUMN 28 VALUE "19"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN 30 VALUE "=Stock (SALES)         "
				 FOREGROUND-COLOR 7 HIGHLIGHT.
	   03  LINE 17 COLUMN 28 VALUE "20"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN 30 VALUE "=  (RETURNS)           "
				 FOREGROUND-COLOR 7 HIGHLIGHT.
005580	   03  LINE 18 COLUMN 28 VALUE "21"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN 30 VALUE "=Freight (PURCHASES)   "
				 FOREGROUND-COLOR 7 HIGHLIGHT.
	   03  LINE 19 COLUMN 28 VALUE "22"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN 30 VALUE "=  (RETURNS)           "
				 FOREGROUND-COLOR 7 HIGHLIGHT.
	   03  LINE 20 COLUMN 28 VALUE "23"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN 30 VALUE "=Disc. Received (PURCH)"
				 FOREGROUND-COLOR 7 HIGHLIGHT.
	   03  LINE 21 COLUMN 28 VALUE "24"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN 30 VALUE "=  (RETURNS)           "
				 FOREGROUND-COLOR 7 HIGHLIGHT.
	   03  LINE 22 COLUMN 28 VALUE "25"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN 30 VALUE "=Creditor Transactions"
				 FOREGROUND-COLOR 7 HIGHLIGHT.
	   03  LINE 23 COLUMN 28 VALUE "26"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN 30 VALUE "=Cash Sales           "
				 FOREGROUND-COLOR 7 HIGHLIGHT.
	   03  LINE 11 COLUMN 54 VALUE "27"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN 56 VALUE "=Stock Adjustments    "
				 FOREGROUND-COLOR 7 HIGHLIGHT.
	   03  LINE 12 COLUMN 54 VALUE "28"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN 56 VALUE "=Stock                "
				 FOREGROUND-COLOR 7 HIGHLIGHT.
	   03  LINE 13 COLUMN 54 VALUE "29"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN 56 VALUE "=Cash Refunds         "
				 FOREGROUND-COLOR 7 HIGHLIGHT.
	   03  LINE 14 COLUMN 54 VALUE "30"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN 56 VALUE "=Consignment Debtors  "
				 FOREGROUND-COLOR 7 HIGHLIGHT.
	   03  LINE 15 COLUMN 54 VALUE "31"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN 56 VALUE "=Consignment 'SALES'  "
				 FOREGROUND-COLOR 7 HIGHLIGHT.
	   03  LINE 16 COLUMN 54 VALUE "32"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN 56 VALUE "=  (RETURNS)          "
				 FOREGROUND-COLOR 7 HIGHLIGHT.
	   03  LINE 17 COLUMN 54 VALUE "33"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN 56 VALUE "=Consign.Cost-of-Sales"
				 FOREGROUND-COLOR 7 HIGHLIGHT.
	   03  LINE 18 COLUMN 54 VALUE "34"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN 56 VALUE "=  (RETURNS)          "
				 FOREGROUND-COLOR 7 HIGHLIGHT.
	   03  LINE 19 COLUMN 54 VALUE "35"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN 56 VALUE "=Consignment Stock    "
				 FOREGROUND-COLOR 7 HIGHLIGHT.
	   03  LINE 20 COLUMN 54 VALUE "36"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN 56 VALUE "=  (RETURNS)          "
				 FOREGROUND-COLOR 7 HIGHLIGHT.
	   03  LINE 21 COLUMN 54 VALUE "37"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN 56 VALUE "=Petty Cash Vouchers  "
				 FOREGROUND-COLOR 7 HIGHLIGHT.
	   03  LINE 22 COLUMN 54 VALUE "38"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN 56 VALUE "=Petty Cash (C.Drawer)"
				 FOREGROUND-COLOR 7 HIGHLIGHT.

       01  S16C.
	   03  LINE 14 COLUMN  4 VALUE	"Ref :"
				 FOREGROUND-COLOR 3 HIGHLIGHT.
	   03	       COLUMN 10 VALUE "Sales Ledger number"
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03  LINE 15 COLUMN 10 VALUE "Transaction code   "
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN 29 VALUE " 01 to 99"
				 FOREGROUND-COLOR 7 HIGHLIGHT.
	   03  LINE 16 COLUMN 10 VALUE "Cash Drawer Number "
				 FOREGROUND-COLOR 6 HIGHLIGHT.
	   03	       COLUMN 29 VALUE " 01 to 40"
				 FOREGROUND-COLOR 7 HIGHLIGHT.

       01  S17.
002970	   03  FOREGROUND-COLOR 7 HIGHLIGHT
	       BACKGROUND-COLOR 5 PIC 9(06) USING W15-ACCOUNT AUTO.

004870 COPY S99.CRT.

       COPY LEDLUP.CRT.

       COPY ERROR.CRT.

       COPY OPT.CRT.

      /
001230 PROCEDURE DIVISION
		 USING LS-PARID LS-USER-ID LS0-PROGRAMS LS0-SECURITY.
006540 AA000	       SECTION.
006550 AA00.
003240	   IF LS0-GLLEV < 1
	       MOVE "Not Authorised"
				 TO WS-ERR-STRING
003260	       PERFORM ERROR-MESSAGE
	       GO TO AA35.
006560	     PERFORM ZA000.
	     PERFORM BA000.

	     CLOSE LEDTRF.
	     OPEN I-O LEDTRF.
007240 AA35.
             EXIT PROGRAM.

       COPY FUNCTION.CRT.

       COPY OPTION.CRT.

       COPY LOCKED.REC.

       COPY CLEAR.CRT.

       AA350-LOOKUP    SECTION.
       AA350.
011050	     PERFORM SAVE-SCREEN.
011080       MOVE 4              TO W44-FUNCTION.
011090	     PERFORM SCREEN-CONTENTS.
	     PERFORM GACCNT-LOOKUP.
011320	     PERFORM RESTORE-SCREEN.
       AA399.
             EXIT.

007600 AB000	       SECTION.

       COPY CONTROL.RD.

       COPY PARAM.RD.

       COPY GACCNT.RD.
 
       COPY LEDTRF.RD1.

      /
008790 AC000           SECTION.

       COPY CONTROL.WR.

       COPY PARAM.WR.

       COPY GACCNT.WR.

000020 REWRITE-LEDTRF.
000030       REWRITE XFR-REC.
000040     IF WS-STAT1 NOT = "0"
000050	       MOVE 40		 TO WS-F-ERROR.
000070       GO TO WRITE-LEDTRF-EXIT.

000090 WRITE-LEDTRF.
000100       WRITE XFR-REC.
000110     IF WS-STAT1 NOT = "0"
000120         MOVE 40           TO WS-F-ERROR
000130         PERFORM WRITE-ERROR.
	     CLOSE LEDTRF.
	     OPEN I-O LEDTRF.

000170 WRITE-LEDTRF-EXIT.
000180       EXIT.
      /
009940 AE000           SECTION.
009950 AE00.
009960	     MOVE ZERO		 TO WS-ERROR.
009970     IF W15-DD < 01 OR > 31
009980         GO TO AE10.
009990     IF W15-MM < 01 OR > 12
010000         GO TO AE10.
010010     IF W15-MM = 01 OR 03 OR 05 OR 07 OR 08 OR 10 OR 12
010020         GO TO AE15.
010030     IF W15-DD > 30
010040         GO TO AE10.
010050     IF W15-MM = 02 AND W15-DD > 28
010060         GO TO AE05.
010070       GO TO AE15.

010080 AE05.
010090     IF W15-DD > 29
010100         GO TO AE10.
010110	     DIVIDE W15-CY BY 4  GIVING W20-RESULT.
010120     IF W20-DEC = ZERO
010130         GO TO AE15.

010140 AE10.
010150	     MOVE 1		 TO WS-ERROR.
             GO TO AE999.
      *
      *   ****    CALCULATE THE PERIOD INTO WHICH THIS DATE FALLS
      * 
       AE15.
	     MOVE W15-MM	 TO WS-PERIOD.
	   IF W15-CY > W05-CY
	       GO TO AE10.
	   IF W15-CY < W05-CY
               GO TO AE20.
	   IF W05-MM = W15-MM
	      GO TO AE999.
	   IF W15-MM > W05-MM
	       GO TO AE10.
	   IF W15-MM > WS-Y-END
               GO TO AE999.
	   IF W15-CY > WS-L-END
               GO TO AE999.
	     ADD 12		 TO WS-PERIOD
             GO TO AE999.

       AE20.
	   IF W15-CY > WS-L-END
               GO TO AE999.
	     ADD 12		 TO WS-PERIOD.

010160 AE999.
010170       EXIT.

       COPY GACCNT.LUP.

       COPY APAC.HLP.

      /
      *    ****    C R E A T E / A M E N D   B A T C H
      *
011620 BA000	       SECTION 5.
011670 BA00.
011680       DISPLAY CLR-SCREEN.
011690       DISPLAY S05.
011700       MOVE ZERO           TO W20-DEBIT W20-CREDIT.
011720	     MOVE ZERO		 TO W15-REFER W15-TYPE.
011730	     MOVE SPACES	 TO W15-NAR W15-ILEDG.
011740       MOVE W05-TODAY      TO W15-DATE.

011750 BA05.
	     INITIALIZE XFR-REC.
	     PERFORM START-AT-LEDTRF-KEY THRU READ-LEDTRF-EXIT.
	   IF WS-F-ERROR = 40
               GO TO BA10.
             DISPLAY "Reading batch details" AT 2502
		      WITH BACKGROUND-COLOR 3 FOREGROUND-COLOR 14 BLINK.

       BA08.
	     PERFORM READ-LEDTRF-NEXT THRU READ-LEDTRF-EXIT.
	   IF WS-F-ERROR = 40
               GO TO BA10.
	   IF XFR-VALUE < ZERO
	       ADD XFR-VALUE	 TO W20-CREDIT
           ELSE
	       ADD XFR-VALUE	 TO W20-DEBIT.
             GO TO BA08.

011900 BA10.
011910       MOVE ZERO TO W15-ACCOUNT W15-VAL.
	     MOVE 07		 TO CLIN.
	     MOVE 01		 TO CCOL.
             PERFORM ERASE-SCREEN-LOOP UNTIL CLIN = 23.
011930       DISPLAY S05A.

012130 BA12.
012140	     ACCEPT S13 AT 0710.
	   IF USER-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN ESC-KEY
		     MOVE ZERO	 TO W15-ACCOUNT
		     GO TO BA55
		 WHEN OTHER
		     CALL X"E5"
		     GO TO BA12
	       END-EVALUATE.
012150       PERFORM AE000.
012160     IF WS-ERROR = 1
012170	       MOVE WS-ER3	 TO WS-ERR-STRING
003260	       PERFORM ERROR-MESSAGE
012180	       GO TO BA12.
	     PERFORM CHECK-CORRECT.
012270	   IF WS-OPTION = "N"
012280	       GO TO BA25.

012290 BA15.
	     DISPLAY S16B.
012300	     ACCEPT S16 AT 0722.
	   IF USER-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN ESC-KEY
		     MOVE 1101	 TO CPOS
		     PERFORM ERASE-SCREEN-LOOP UNTIL CLIN > 22
		     GO TO BA12
		 WHEN OTHER
		     CALL X"E5"
		     GO TO BA15
	       END-EVALUATE.
	     MOVE 1101		 TO CPOS.
	     PERFORM ERASE-SCREEN-LOOP UNTIL CLIN > 22.
	   IF (W15-TYPE > 03 AND < 14) OR
	      (W15-TYPE = 19 OR 20 OR 27 OR 28)
	       MOVE "L" 	 TO WS-REF-TYPE
	       GO TO BA20
	   ELSE
	   IF W15-TYPE = 15 OR 16 OR 23 OR 24
	       MOVE "Y" 	 TO WS-REF-TYPE
	       GO TO BA20.
	     MOVE "T"		 TO WS-REF-TYPE.
	   IF W15-TYPE = 01 OR 14
	       GO TO BA16-DEBT.
	   IF W15-TYPE = 02 OR 25
	       GO TO BA17-CRED.
	   IF W15-TYPE = 03

	   IF W15-TYPE = 21


       BA16-DEBT.
	     PERFORM SAVE-SCREEN-3.
	     DISPLAY "ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ¿"
	     DISPLAY "³ ACCOUNTS RECEIVABLE/DEBTOR ³"
	     DISPLAY "³   TRANSACTION CATEGORY     ³"
	     DISPLAY "³                            ³"


       BA17-CRED.
	     PERFORM SAVE-SCREEN-3.
	     DISPLAY "ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ¿"
	     DISPLAY "³ ACCOUNTS PAYABLE/CREDITOR ³"
	     DISPLAY "³   TRANSACTION CATEGORY    ³"
	     DISPLAY "³                           ³"




012290 BA20.
	     DISPLAY S16C.
	   IF WS-REF-TYPE = "L"
012300	       ACCEPT S16A-L AT 0726
	   ELSE
	   IF WS-REF-TYPE = "Y"
	       MOVE "YYYY"	 TO W15-ILEDG
	       DISPLAY W15-ILEDG AT 0726
	   ELSE
	       DISPLAY W15-ILEDG AT 0726
	       ACCEPT S16A-DT AT 0726.
	   IF USER-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN ESC-KEY
		     MOVE 1401	 TO CPOS
		     PERFORM ERASE-SCREEN-LOOP UNTIL CLIN > 15
		     GO TO BA15
		 WHEN OTHER
		     CALL X"E5"
		     GO TO BA20
	       END-EVALUATE.
	     MOVE 1401		 TO CPOS.
	     PERFORM ERASE-SCREEN-LOOP UNTIL CLIN > 15.
	     PERFORM BA60.
	   IF W15-ACCOUNT = ZERO
	       GO TO BA25.
008970	     MOVE W15-ACCOUNT	 TO G-AC.
008980       PERFORM READ-GACCNT THRU READ-GACCNT-EXIT.
012040	   IF NOT (WS-F-ERROR = 8)
012090	       DISPLAY G-NAME AT 1503
		       WITH FOREGROUND-COLOR 3 HIGHLIGHT
			    BACKGROUND-COLOR 5
012100	       DISPLAY "Balance:" AT 1712
012110	       MOVE G-BAL	 TO W25-V1
012120	       DISPLAY W25-S7V2 AT 1721
		       WITH FOREGROUND-COLOR 3 HIGHLIGHT
			    BACKGROUND-COLOR 5.

011940 BA25.
	     DISPLAY "F1" AT 2502
		      WITH BACKGROUND-COLOR 3 FOREGROUND-COLOR 14
		     "=Help,"
		      WITH BACKGROUND-COLOR 3 FOREGROUND-COLOR 1
		     "F2" WITH BACKGROUND-COLOR 3 FOREGROUND-COLOR 14
		     " to do Account Lookup - "
		      WITH BACKGROUND-COLOR 3 FOREGROUND-COLOR 1
		     "Esc" WITH BACKGROUND-COLOR 3 FOREGROUND-COLOR 14
		     "ape to exit"
		      WITH BACKGROUND-COLOR 3 FOREGROUND-COLOR 1.
011950	     ACCEPT S17 AT 0703.
	   IF USER-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN ESC-KEY
		     MOVE ZERO	 TO W15-ACCOUNT
		     GO TO BA55
		 WHEN F1-KEY
		     PERFORM HELP-ROUTINE
		 WHEN F2-KEY
		     PERFORM AA350
		 WHEN OTHER
		     CALL X"E5"
		     GO TO BA25
	       END-EVALUATE
	       DISPLAY S17 AT 0703
               IF W15-ACCOUNT = ZERO
015990		   GO TO BA25.
	     DISPLAY CLEAR-L25.
011970     IF W15-ACCOUNT = ZERO
011980         GO TO BA55.
011990     IF W15-ASER = ZERO
012000	       MOVE WS-ER7	 TO WS-ERR-STRING
003260	       PERFORM ERROR-MESSAGE
012010	       GO TO BA25.

012020 BA30.
008970	     MOVE W15-ACCOUNT	 TO G-AC.
008980       PERFORM READ-GACCNT THRU READ-GACCNT-EXIT.
012040	   IF WS-F-ERROR = 8
012050	       MOVE WS-ER6	 TO WS-ERR-STRING
003260	       PERFORM ERROR-MESSAGE
012060	       GO TO BA25.

012070 BA35.
	     DISPLAY WS-BLNK78 AT 1402 WITH FOREGROUND-COLOR 3.
012090	     DISPLAY G-NAME AT 1503
		     WITH FOREGROUND-COLOR 3 HIGHLIGHT
			  BACKGROUND-COLOR 5.
012100	     DISPLAY "Balance:" AT 1712.
012110       MOVE G-BAL TO W25-V1.
012120	     DISPLAY W25-S7V2 AT 1721
		     WITH FOREGROUND-COLOR 3 HIGHLIGHT
			  BACKGROUND-COLOR 5.
012320	     ACCEPT (7, 30) W15-NAR
012330			    WITH FOREGROUND-COLOR 7 HIGHLIGHT
				 BACKGROUND-COLOR 5 UPDATE AUTO.
	   IF USER-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN ESC-KEY	 GO TO BA12
		 WHEN OTHER
		     CALL X"E5"
		     GO TO BA15
	       END-EVALUATE.
012340	     DISPLAY "Keyin (MINUS) - and Value for Credit" AT 0943
012350		      WITH FOREGROUND-COLOR 6 HIGHLIGHT.
012360       ACCEPT S14 AT 0767.
	   IF USER-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN ESC-KEY	 GO TO BA12
		 WHEN OTHER
		     CALL X"E5"
		     GO TO BA15
	       END-EVALUATE.
012380	   IF W15-VAL = ZERO
012390	       MOVE WS-ER4	 TO WS-ERR-STRING
003260	       PERFORM ERROR-MESSAGE
012400	       GO TO BA15.
	     PERFORM CHECK-CORRECT.
012490	   IF WS-OPTION = "N"
012500	       GO TO BA25.
012540	     INITIALIZE XFR-REC.

012660 BA40.
      *
      *    ****    Switch date to CCYYMMDD format
      *
	     MOVE W15-CC	 TO W15-CN.
             MOVE W15-YY         TO W15-YR.
             MOVE W15-MM         TO W15-MT.
             MOVE W15-DD         TO W15-DY.
012680	     MOVE W15-YMD	 TO XFR-DATE.
012690	     MOVE W15-NAR	 TO XFR-NAR.
	     MOVE W15-TYPE	 TO XFR-TYPE
012700	     MOVE W15-REFER	 TO XFR-LEDG.
012710	     MOVE W15-VAL	 TO XFR-VALUE.
012740	     MOVE G-AC		 TO XFR-AC.
012750     IF W15-VAL < ZERO
012760         ADD W15-VAL       TO W20-CREDIT
012790     ELSE
012800         ADD W15-VAL       TO W20-DEBIT.
             MOVE W15-VAL        TO WS-VALUE.
012570	     PERFORM REWRITE-LEDTRF THRU WRITE-LEDTRF-EXIT.
	   IF WS-F-ERROR = 40
012570	       PERFORM WRITE-LEDTRF THRU WRITE-LEDTRF-EXIT.
013100       GO TO BA10.
013110 BA55.
013120       ADD W20-DEBIT W20-CREDIT GIVING W20-TOTAL.
013130     IF W20-TOTAL = ZERO
013140         GO TO BA999.
013150	     MOVE "Out of Balance - ENTER to correct - 'E' to end"
				 TO WS-ERR-MES.
	     MOVE SPACE 	 TO WS-OPTION.
	     PERFORM OPT-MESSAGE.
013240	   IF WS-OPTION = "E"
013250         GO TO BA999.
013260       GO TO BA10.

012660 BA60.
012540	     INITIALIZE XFR-REC.
	     MOVE W15-CC	 TO W15-CN.
             MOVE W15-YY         TO W15-YR.
             MOVE W15-MM         TO W15-MT.
             MOVE W15-DD         TO W15-DY.
012680	     MOVE W15-YMD	 TO XFR-DATE.
	     MOVE W15-TYPE	 TO XFR-TYPE

012700	     MOVE W15-REFER	 TO XFR-LEDG.
	     PERFORM READ-LEDTRF THRU READ-LEDTRF-EXIT.
	   IF NOT (WS-F-ERROR = 40)
	       MOVE XFR-AC	 TO W15-ACCOUNT
	       MOVE XFR-NAR	 TO W15-NAR
	       MOVE XFR-VALUE	 TO W15-VAL
012750	       IF W15-VAL < ZERO
012760		   SUBTRACT W15-VAL
				 FROM W20-CREDIT
012790	       ELSE
012800		   SUBTRACT W15-VAL
				 FROM W20-DEBIT.
013430 BA999.
013440       EXIT.
      /
035270 ZA000	     SECTION 9.
035280 ZA00.
             PERFORM ZA55 THRU ZA60.
	     MOVE LS-PARID	 TO WS-PARID.
	     MOVE LS-L-OR-N	 TO W02-L-OR-N.
	     MOVE WS-SYS-ID	 TO W02-SYSID.
	     MOVE LS-TODAY-DDMMYY
				 TO TODAY-DDMMYY.
	     MOVE LS-USUB	 TO WS-USUB.
049200	     DISPLAY CLR-SCREEN.
      *
      *    ****    S E T   U P   T H E   F U N C T I O N   K E Y S
      *
	     MOVE 1		 TO USER-ACTION
				    USER-SETTING.
      *
      *    ESC, F1 to F10 keys
      *
	     MOVE ZERO		 TO USER-NUMBER.
	     MOVE 11		 TO USER-KEYS.
	     CALL X"AF" USING SET-BIT-PAIRS, USER-KEY-CONTROL.
      *
      *    PAGE-UP AND PAGE-DOWN KEYS
      *
	     MOVE 53		 TO USER-NUMBER.
	     MOVE 2		 TO USER-KEYS.
	     CALL X"AF" USING SET-BIT-PAIRS, USER-KEY-CONTROL.
      *
      *    ****    A C T I V A T E   M O U S E
      *
	     MOVE 64		 TO MOUSE-FUNC.
	     MOVE 1		 TO MOUSE-PARAM.
	     CALL X"AF" USING MOUSE-FUNC
			      MOUSE-PARAM.
	   IF MOUSE-FUNC NOT = 255
	       MOVE "Y"		 TO MOUSE-ATTACHED
	       MOVE 66		 TO MOUSE-FUNC
	       MOVE 0		 TO MOUSE-PARAM
	       CALL X"AF" USING MOUSE-FUNC
				MOUSE-PARAM
	   ELSE
	       GO TO ZA00A.
      *
      *    ****    S E T   M O U S E   K E Y   T O   A C T
      * 	   A S	 F U N C T I O N   K E Y
      *
	     MOVE 3		 TO USER-ACTION.
	     MOVE 27		 TO USER-NUMBER.
	     MOVE 2		 TO USER-KEYS.
	     CALL X"AF" USING SET-BIT-PAIRS, USER-KEY-CONTROL.
      *
      *    ****    P A R A M E T E R   F I L E
      *
       ZA00A.
	     MOVE "PARAM"	 TO AFID-KEY.

       ZA00-READ-APACFIDS.
000030	     READ APACFIDS WITH IGNORE LOCK
	       KEY IS AFID-KEY.
	   IF WS-STATUS = "00"
	       GO TO ZA00-READ-APACFIDS-EXIT.
006260	     STRING "Missing " DELIMITED SIZE
		     AFID-KEY DELIMITED BY " "
		     " file ID - Status " DELIMITED SIZE
		     WS-STATUS DELIMITED SIZE
		     INTO WS-ERR-MES.
	     PERFORM ERROR-LENGTH THRU ERROR-EXIT.
006370	     STOP RUN.

       ZA00-READ-APACFIDS-EXIT.
	     EXIT.

       ZA00A-CONTINUE.
	     MOVE AFID-PATH	 TO W02-PARAM.
	     MOVE "GACCNT"	 TO AFID-KEY.
	     PERFORM ZA00-READ-APACFIDS THRU ZA00-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-GACCNT.
	     MOVE "LEDTRF"	 TO AFID-KEY.
	     PERFORM ZA00-READ-APACFIDS THRU ZA00-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-LEDTRF.
	     MOVE "NETWORK"	 TO AFID-KEY.
	     PERFORM ZA00-READ-APACFIDS THRU ZA00-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-NETWORK.
035680	     MOVE 1		 TO WS-PARKEY.
035690       PERFORM READ-PARAM THRU READ-PARAM-EXIT.
035700	     MOVE PAR-COMPANY	 TO W90-CNAME.
035710	     MOVE PAR-DMY	 TO W05-TODAY.
035720	     MOVE PAR-YMD	 TO W05-TYMD.
	     MOVE 6		 TO WS-PARKEY.
             PERFORM READ-PARAM THRU READ-PARAM-EXIT.
	     MOVE PAR-SUSGL	 TO W70-SUSGL.
             MOVE PAR-DEBGL      TO W70-DEBGL.
             MOVE PAR-CREGL      TO W70-CREGL.
             MOVE PAR-INTGL      TO W70-INTGL.
             MOVE PAR-BNKGL      TO W70-BNKGL.
             MOVE PAR-UNPROF     TO W70-UNPROF.
             MOVE 4              TO WS-NETKEY.
035770       PERFORM READ-CONTROL THRU READ-CONTROL-EXIT.
035900	   IF G-YEAR-END = ZERO
035910	       MOVE 2		 TO G-YEAR-END
035920         PERFORM REWRITE-CONTROL THRU WRITE-CONTROL-EXIT.
      *
      *    ****    S E T   U P   M O N T H S   ( Y E A R   E N D)
      *
035930	     MOVE 1		 TO WS-S1.
035940	     MOVE G-YEAR-END	 TO WS-S2 WS-Y-END.
035160	     MOVE G-LAST-YE	 TO WS-L-END.
	     MOVE G-OPEN	 TO WS-OPEN.
035950	     ADD 1		 TO WS-S2.

035960 ZA15.
035970     IF WS-S2 > 12
035980	       SUBTRACT 12	 FROM WS-S2.
035990	     MOVE W30-MONTH(WS-S2)
				 TO W35-MONTH(WS-S1).
036000     IF WS-S1 < 12
036010	       ADD 1		 TO WS-S1 WS-S2
036020         GO TO ZA15.
036030	     MOVE ZERO		 TO WS-ERROR.
036040     IF W70-BNKGL = ZERO
036050         DISPLAY "Parameters not set up - ENTER" AT 2020
036060                  WITH FOREGROUND-COLOR 14
036070         ACCEPT WS-OPTION AT 2050 WITH FOREGROUND-COLOR 15 AUTO
036080	       MOVE 1		 TO WS-ERROR.
036120	     MOVE WS-Y-END	 TO WS-S1.
036130	     MOVE W05-CY	 TO WS-S2.
036140     IF W05-MM < WS-Y-END
036150	       SUBTRACT 1	 FROM WS-S2.
036160 ZA20.
036170	     ADD 1		 TO WS-S1.
036180     IF WS-S1 > 12
036190	       MOVE 1		 TO WS-S1
036200	       ADD 1		 TO WS-S2.
036210	     MOVE WS-S2 	 TO W40-YEAR (WS-S1).
036220     IF WS-S1 NOT = WS-Y-END
036230         GO TO ZA20.
036250       GO TO ZA999.
       ZA49.
             DISPLAY "Too many files OPEN" AT 0812
                      WITH FOREGROUND-COLOR 14.
             DISPLAY "Check the FILES option in CONFIG.SYS" AT 1012.
             DISPLAY "Press any key to continue" AT 1212.
             ACCEPT WS-OPTION AT 1238 WITH FOREGROUND-COLOR 15.
             GO TO ZA205.
       ZA55.
041220       MOVE 1 TO WS-S1.
021870	     MOVE SPACES TO WS-MID-LNE.
041240 ZA60.
041250       MOVE WS-G1 TO WS-TCHR (WS-S1) WS-BCHR (WS-S1).
             MOVE WS-G8 TO WS-TCH  (WS-S1) WS-BCH  (WS-S1).
041260     IF WS-S1 < 80
041270         ADD 1 TO WS-S1
041280         GO TO ZA60.
             MOVE WS-G9  TO WS-TCH  (1).
             MOVE WS-G10 TO WS-TCH  (80).
             MOVE WS-G11 TO WS-BCH  (1).
             MOVE WS-G12 TO WS-BCH  (80).
             MOVE WS-G14 TO WS-TCHR (1)  WS-BCHR (1).
             MOVE WS-G13 TO WS-TCHR (80) WS-BCHR (80).
021930       MOVE WS-G2  TO WS-TCHR (11) WS-TCHR (45)
021940                      WS-TCHR (63).
021950       MOVE WS-G3  TO WS-MCHR (11) WS-MCHR (45)
021960                      WS-MCHR (63)
			    WS-MCHR (1)  WS-MCHR (80).
021970       MOVE WS-G4  TO WS-BCHR (11) WS-BCHR (45)
021980                      WS-BCHR (63).
	     MOVE LS-COMPANY	 TO WS-TOP-COMP.
	   IF LS-USER = LS-SYS-ID
	       MOVE "SupervisorÄ"  TO WS-WRKHD
	   ELSE
	       MOVE "Workstation"  TO WS-WRKHD
	       MOVE LS-USER	   TO WS-WRKST.
036260 ZA200.
036270       DISPLAY "Files locked - Try later" AT 2512
036280		      WITH BACKGROUND-COLOR 3 FOREGROUND-COLOR 14
		     " " WS-STATUS
		      WITH BACKGROUND-COLOR 3 FOREGROUND-COLOR 15.
036290       DISPLAY "Press any key" AT 2512 
036300		      WITH BACKGROUND-COLOR 3 FOREGROUND-COLOR 14.
036310	     ACCEPT WS-OPTION AT 2526
		    WITH BACKGROUND-COLOR 3 FOREGROUND-COLOR 15 AUTO.
       ZA205.
             EXIT PROGRAM.
036340 ZA999.
036350       EXIT.
      /
036360 ZB000	     SECTION 9.
      
041480 OPEN-ERROR.
041490       DISPLAY CLR-SCREEN.
041500       DISPLAY "Open error" AT 0812 WITH FOREGROUND-COLOR 14.
041510       PERFORM DISPLAY-FILE-NAME.
      
041480 READ-ERROR.
041490       DISPLAY CLR-SCREEN.
041500       DISPLAY "Read error" AT 0812 WITH FOREGROUND-COLOR 14.
041510       PERFORM DISPLAY-FILE-NAME.
      
041520 WRITE-ERROR.
041530       DISPLAY CLR-SCREEN.
041540       DISPLAY "Write error" AT 0812 WITH FOREGROUND-COLOR 14.
041510       PERFORM DISPLAY-FILE-NAME.
      
041560 DISPLAY-FILE-NAME.
041610     IF WS-F-ERROR = 2
041620         MOVE W02-NETWORK TO WS-FILE
041630         MOVE WS-NETKEY TO WS-KEY
041640     ELSE
041810     IF WS-F-ERROR = 8
041820	       MOVE W02-GACCNT	 TO WS-FILE
041870         MOVE ZERO         TO WS-KEY
041830	       MOVE G-AC	 TO WS-KEYX
041840	   ELSE
041850     IF WS-F-ERROR = 15
041860         MOVE WS-PARID TO WS-FILE
041870	       MOVE WS-PARKEY TO WS-KEY
041840	   ELSE
041850	   IF WS-F-ERROR = 40
041860	       MOVE W02-LEDTRF	 TO WS-FILE
041870         MOVE ZERO         TO WS-KEY
	       MOVE XFR-KEY	 TO WS-KEYX..
036720     IF WS-STATUS = "10"
036730         MOVE "End of FILE" TO WS-STAT-MESSAGE
036740     ELSE
036750     IF WS-STATUS = "22"
036760         MOVE "Duplicate record number" TO WS-STAT-MESSAGE
036770     ELSE
036780     IF WS-STATUS = "23"
036790         MOVE "Invalid record number" TO WS-STAT-MESSAGE
036800     ELSE
036810     IF WS-STATUS = "24"
036820         MOVE "DISK full" TO WS-STAT-MESSAGE
036830     ELSE
036840     IF WS-STATUS = "30"
036850         MOVE "DISK error" TO WS-STAT-MESSAGE
036860     ELSE
036870     IF WS-STATUS = "94"
036880         MOVE "FILE locked" TO WS-STAT-MESSAGE.
045380       DISPLAY "File - " AT 1012 WS-FILE WITH FOREGROUND-COLOR 11.
045390       DISPLAY "Status " AT 1212 
                      WS-STATUS WITH FOREGROUND-COLOR 11
                     ": " WS-STAT-MESSAGE WITH FOREGROUND-COLOR 14.
045400     IF WS-STATUS NOT = "94" 
045410         DISPLAY "Key    " AT 1412 
                        WS-KEY WITH FOREGROUND-COLOR 11
                        " " WS-KEYX WITH FOREGROUND-COLOR 11
045420         DISPLAY "Reverse backup or contact program Support"
                        AT 1612.
045440         DISPLAY "Please make a note of these details" AT 1812.
042170       STOP RUN.
