      $set LINKCOUNT"512"
      ******************************************************************
      *                                                                *
      *    ******   **	      *******	  ****	    ****	**     *
      *   **	**  **	      **    **	 **  **    **  **      ***     *
      *   **	    **	      **    **	**    **  **	**    * **     *
      *   **	    **	      *******	**    **  **	**   *	**     *
      *   **   ***  **	      **	**    **  **	**  *******    *
      *   **	**  **	      **	 **  **    **  **	**     *
      *    ******   ********  **	  ****	    ****       ****    *
      *                                                                *
      *     ENGLISH                                                    *
      *                                                                *
      *     G / L E D G E R   A C C U M U L A T E   G R O U P	       *
      *                                                                *
      *     VERSION 8.14.03 - July 2010				       *
      * 							       *
      ******************************************************************
000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID.	       GLP004.
000030 AUTHOR.                 J.W. LEMMON (APAC).
000040 DATE-WRITTEN.           JUNE 1983.

		   COPYRIGHT NOTICE: COPYRIGHT (C) 1983 - 2010
				     by James William Lemmon.
				       (Id No. 4412165050082).

		   All rights reserved.

		   e-mail jwlemmon@gmail.com.

000050 SECURITY.
		   This program is free software; you can redistribute
		   it and/or modify it under the terms of the GNU General
		   Public License as published by the Free Software
		   Foundation; either version 2 of the License, or (at
		   your option) any later version.

		   This program is distributed in the hope that it will
		   be useful, but WITHOUT ANY WARRANTY; without even the
		   implied warranty of MERCHANTABILITY or FITNESS FOR A
		   PARTICULAR PURPOSE.	See the GNU General Public License
		   for more details.

		   You should have received a copy of the GNU General
		   Public License along with this program; if not, write
		   to the Free Software Foundation, Inc., 59 Temple Place
		   - Suite 330, Boston, MA 02111-1307, USA.

000070 ENVIRONMENT DIVISION.
000080 CONFIGURATION SECTION.
000090 SPECIAL-NAMES.
000080		       CURSOR IS CSTART
000090		       CONSOLE IS CRT
		       CRT STATUS IS KEY-STATUS.
000110 INPUT-OUTPUT SECTION.
000120 FILE-CONTROL.

       COPY APACFIDS.SL.

       COPY CONTROL.SL.

000140 COPY PARAM.SL.

000160 COPY GACCNT.SL.

000270 DATA DIVISION.
000280 FILE SECTION.

       COPY APACFIDS.FDE.

       COPY CONTROL.FDE.

000300 COPY PARAM.FDE.

000320 COPY GACCNT.FDE.

      /
001690 WORKING-STORAGE SECTION.
       77  WS-CHECK	   PIC	X(18)	 VALUE
			   "aeWlimemnomLalismJ".
001700 77  WS-PARKEY	   PIC	9(04)	 COMP-5 VALUE 1.
001720 77  WS-LTRKEY	   PIC	9(06)	 COMP-5 VALUE 0.
001690 77  WS-ENQPOS	   PIC	9(06)	 COMP-5.
001700 77  WS-ENQEND       PIC  9(06)    COMP-5.
001730 77  WS-NETKEY       PIC  9(04)    COMP-5 VALUE 1.
001750 77  WS-KSTORE	   PIC	9(06)	 COMP-5.
001760 77  WS-SKSTORE      PIC  9(06)    COMP-5.
001770 77  WS-INKEY        PIC  9(06)    COMP-5.
001780 77  WS-COKEY        PIC  9(06)    COMP-5.
001790 77  WS-GLJSTR       PIC  9(04)    COMP-5.
001800 77  WS-GLJKEY       PIC  9(06)    COMP-5.
001810 77  WS-RECKEY       PIC  9(04)    COMP-5.
001820 77  WS-RECOVER      PIC  9(04)    COMP-5.
001830 77  WS-TRANS        PIC  9(04)    COMP-5 VALUE 1.
001840 77  WS-ISUB         PIC  9(04)    COMP-5.
001850 77  WS-CHEQUE       PIC  9(04)    COMP-5.
001880 77  WS-SUB	   PIC	9(04)	 COMP-5.
001880 77  WS-S            PIC  9(04)    COMP-5.
001880 77  WS-S1           PIC  9(04)    COMP-5.
001890 77  WS-S2           PIC  9(04)    COMP-5.
001890 77  WS-S3           PIC  9(04)    COMP-5.
001890 77  WS-S4	   PIC	9(04)	 COMP-5.
001890 77  WS-S6           PIC  9(04)    COMP-5.
001890 77  WS-S9	   PIC	9(04)	  COMP-5.
001900 77  WS-Y-END        PIC  9(02) VALUE ZERO.
001900 77  WS-L-END	   PIC	9(04) VALUE ZERO.
001900 77  WS-OPEN         PIC  9(02) VALUE ZERO.
001910 77  WS-MS1          PIC  9(04)    COMP-5.
001920 77  WS-MS2          PIC  9(04)    COMP-5.
001930 77  WS-VALUE        PIC S9(09)V99 COMP-3.
001940 77  WS-EXS          PIC  9(01).
001950 77  WS-CONREC       PIC  9(01) VALUE ZERO.
001970 77  WS-OPTION	   PIC	X(01).
001970 77  WS-SKIP         PIC  X(01) VALUE "N".
002010 77  WS-ERROR	   PIC	9(01) VALUE ZERO.
002020 77  WS-NUM          PIC  Z9.
002080 77  WS-TNEXT        PIC  9(04)    COMP-5.
002080 77  WS-PERIOD	   PIC	9(02) VALUE ZERO.
       77  TODAY-DDMMYY	   PIC	9(08) COMP-5.
       77  WS-USUB	   PIC	9(04) COMP-5.
      /
002420 01  WS-DB-LINE.
002430     03  WS-TOP-LNE.
002440         05  WS-TCHR PIC X(01) OCCURS 80.
           03  WS-T-LINE REDEFINES WS-TOP-LNE.
               05  FILLER  PIC X(01).
               05  WS-H-LINE
                           PIC X(78).
               05  FILLER  PIC X(01).
002430     03  WS-TOP-LNE2.
002440         05  WS-TCH  PIC X(01) OCCURS 80.
           03  WS-TP-LINE2 REDEFINES WS-TOP-LNE2.
               05  FILLER      PIC  X(01).
               05  WS-TOP-COMP PIC  X(40).
001430	       05  FILLER      PIC  X(23).
	       05  WS-WRKHD    PIC  X(11).
001430	       05  FILLER      PIC  X(01).
	       05  WS-WRKST    PIC  X(03).
001430	       05  FILLER      PIC  X(01).
002450	   03  WS-MID-LNE.
002460         05  WS-MCHR PIC X(01) OCCURS 80.
	   03  WS-MDGL-LNE REDEFINES WS-MID-LNE.
	       05  WS-MGL1     PIC X(01).
	       05  WS-MGL78    PIC X(78).
	       05  WS-MGL80    PIC X(01).
002450	   03  WS-MID-LNE2.
	       05  FILLER      PIC  X(01) VALUE "³".
	       05  WS-BLNK78   PIC  X(78) VALUE ALL "°".
	       05  FILLER      PIC  X(01) VALUE "³".
002470	   03  WS-BOT-LNE.
002480         05  WS-BCHR PIC X(01) OCCURS 80.
           03  WS-B-LINE REDEFINES WS-BOT-LNE.
               05  FILLER  PIC X(01).
               05  WS-F-LINE
                           PIC X(78).
               05  FILLER  PIC X(01).
002470     03  WS-BOT-LNE2.
002480         05  WS-BCH  PIC X(01) OCCURS 80.

002220 COPY WS.WS.

000290 01  WS-PARID.
000020	   03  WS-SYS-ID       PIC  X(03).

002330 01  W02-FID.

       COPY APACFIDS.ID.

       COPY CONTROL.ID.

000320 COPY GACCNT.ID.

       COPY PARAM.ID.

       COPY W05.GL.

002630 01  W10-H2.
002640     03  FILLER      PIC  X(27).
002650     03  W10-HEAD    PIC  X(13).

       COPY W15.GL.

003060 01  W20-TOTALS.
003070     03  W20-DEBIT   PIC S9(09)V99 COMP-3.
003080     03  W20-CREDIT  PIC S9(09)V99 COMP-3.
003090     03  W20-RESULT  PIC S9(09)V99.
003100     03  W20-RES1    REDEFINES W20-RESULT.
003110         05  W20-WHOLE
003120                     PIC  9(09).
003130         05  W20-DEC PIC S9(02).
003140     03  W20-TOTAL   PIC S9(09)V99 COMP-3.
003150     03  W20-STOTAL  PIC S9(09)V99 COMP-3.
003160     03  W20-BTOTAL  PIC S9(09)    COMP-3.
003170     03  W20-INTOT   PIC S9(09)V99 COMP-3.
003180     03  W20-COTOT   PIC S9(09)V99 COMP-3.
003190     03  W20-GTOT.
003200         05  W20-GRPTOT
003210                     PIC S9(09)V99 COMP-3 OCCURS 12.
003220     03  W20-STOT.
003230         05  W20-SUBTOT
003240                     PIC S9(09)V99 COMP-3 OCCURS 12.
003250 01  W20-INPUT.
003260     03  W20-ACCOUNT PIC  9(06).
003270     03  W20-ACNO1   REDEFINES W20-ACCOUNT.
003280         05  W20-ACNO
003290                     PIC 9(04).
003300         05  W20-SER PIC  9(02).
003310     03  W20-ACNO2   REDEFINES W20-ACCOUNT.
003320         05  W20-GR  PIC  9(02).
003330         05  W20-SGRP
003340                     PIC 9(02).
003350         05  W20-ASER
003360                     PIC 9(02).
003370     03  W20-ACNO3   REDEFINES W20-ACCOUNT.
003380         05  W20-GROUP
003390                     PIC 9(02).
003400         05  W20-REST
003410                     PIC 9(04).

       COPY W20.WS.

002850 01  W25-CALCS.
002860	   03  W25-RESULT  PIC 9(05)V99.
002870     03  W25-RESULT1 REDEFINES W25-RESULT.
002880         05  W25-WHOLE   PIC 9(05).
002890         05  W25-DECIMAL PIC 9(02).
           03  W25-RESULT2 REDEFINES W25-RESULT.
	       05  W25-KEY PIC 9(04).
	       05  W25-SUB PIC 9(01).
	       05  FILLER  PIC 9(02).

003420 01  W25-EDIT.
003430     03  W25-7.
003440         05  W25-1   PIC  ZZZZZZZZ9-.
003450     03  W25-S7V2.
003460         05  W25-V1  PIC  Z(07)9.99CR.
003990	   03  W25-S8V2.
004000	       05  W25-VG1 PIC Z(07)9.99CR.
003470	   03  W25-DATE.
003480	       05  W25-DTE PIC	Z9/99/9999.
003490     03  W25-REF.
003500         05  W25-REFER
003510                     PIC Z(07).
003520     03  W25-RECKEY  PIC  Z(04)9.

003530 01  W30-MONTH-NAMES.
003540     03  W30-MONTHS.
003550         05  FILLER  PIC  X(24) VALUE
003560                     "Jan:Feb:Mar:Apr:May:Jun:".
003570         05  FILLER  PIC X(24) VALUE
003580                     "Jul:Aug:Sep:Oct:Nov:Dec:".
003590     03  W30-MNTHS REDEFINES W30-MONTHS.
003600         05  W30-MONTH OCCURS 12.
003610             07  W30-MTH PIC X(03).
003620             07  FILLER  PIC X(01).

003630 01  W35-MONTH-NAMES.
003640     03  W35-MONTHS.
003650         05  W35-MONTH OCCURS 12.
003660             07  W35-MTH PIC X(03).
003670             07  FILLER  PIC X(01).
003680     03  W35-MTHS REDEFINES W35-MONTHS.
003690         05  W35-MTH1.
003700             07  W35-M1  PIC X(03).
003710             07  FILLER  PIC X(01).
003720         05  W35-MTH2.
003730             07  W35-M2  PIC X(03).
003740             07  FILLER  PIC X(01).
003750         05  W35-MTH3.
003760             07  W35-M3  PIC X(03).
003770             07  FILLER  PIC X(01).
003780         05  W35-MTH4.
003790             07  W35-M4  PIC X(03).
003800             07  FILLER  PIC X(01).
003810         05  W35-MTH5.
003820             07  W35-M5  PIC X(03).
003830             07  FILLER  PIC X(01).
003840         05  W35-MTH6.
003850             07  W35-M6  PIC X(03).
003860             07  FILLER  PIC X(01).
003870         05  W35-MTH7.
003880             07  W35-M7  PIC X(03).
003890             07  FILLER  PIC X(01).
003900         05  W35-MTH8.
003910             07  W35-M8  PIC X(03).
003920             07  FILLER  PIC X(01).
003930         05  W35-MTH9.
003940             07  W35-M9  PIC X(03).
003950             07  FILLER  PIC X(01).
003960         05  W35-MTH10.
003970             07  W35-M10 PIC X(03).
003980             07  FILLER  PIC X(01).
003990         05  W35-MTH11.
004000             07  W35-M11 PIC X(03).
004010             07  FILLER  PIC X(01).
004020         05  W35-MTH12.
004030             07  W35-M12 PIC X(03).
004040             07  FILLER  PIC X(01).

004050 01  W40-CUR-YEAR.
004060	   03  W40-YEAR    PIC	9(04) COMP-5 OCCURS 12.

       COPY W40.WS.

       COPY FUNCTION.WS.

       COPY W50.WS.

004070 01  W50-CALC.
004080     05  W50-ACNTS   OCCURS 30.
004090         07  W50-ANO PIC  9(06)    COMP-3.
004100         07  W50-PER PIC S9(03)V99 COMP-3.
004110 01  W55-TOTALS.
004120     03  W55-VAL     PIC S9(09)    COMP-3 OCCURS 12.
004130 01  W55-TOT         REDEFINES W55-TOTALS.
004140     03  W55-1       PIC S9(09)    COMP-3.
004150     03  W55-2       PIC S9(09)    COMP-3.
004160     03  W55-3       PIC S9(09)    COMP-3.
004170     03  W55-4       PIC S9(09)    COMP-3.
004180     03  W55-5       PIC S9(09)    COMP-3.
004190     03  W55-6       PIC S9(09)    COMP-3.
004200     03  W55-7       PIC S9(09)    COMP-3.
004210     03  W55-8       PIC S9(09)    COMP-3.
004220     03  W55-9       PIC S9(09)    COMP-3.
004230     03  W55-10      PIC S9(09)    COMP-3.
004240     03  W55-11      PIC S9(09)    COMP-3.
004250     03  W55-12      PIC S9(09)    COMP-3.
002930 01  W55-TOTA	   REDEFINES W55-TOTALS.
002940	   03  W55-1A	   PIC S9(07)V99 COMP-3.
002950	   03  W55-2A	   PIC S9(07)V99 COMP-3.
002960	   03  W55-3A	   PIC S9(07)V99 COMP-3.
002970	   03  W55-4A	   PIC S9(07)V99 COMP-3.
002980	   03  W55-5A	   PIC S9(07)V99 COMP-3.
002990	   03  W55-6A	   PIC S9(07)V99 COMP-3.
003000	   03  W55-7A	   PIC S9(07)V99 COMP-3.
003010	   03  W55-8A	   PIC S9(07)V99 COMP-3.
003020	   03  W55-9A	   PIC S9(07)V99 COMP-3.
003030	   03  W55-10A	   PIC S9(07)V99 COMP-3.
003040	   03  W55-11A	   PIC S9(07)V99 COMP-3.
003050	   03  W55-12A	   PIC S9(07)V99 COMP-3.
002930 01  W55-TOTB	   REDEFINES W55-TOTALS.
004120	   03  W55-VALA    PIC S9(07)V99 COMP-3 OCCURS 12.
004260 01  W60-TOTALS.
004270     03  W60-VAL     PIC S9(09)    COMP-3 OCCURS 12.
004280 01  W65-TOTALS.
004290     03  W65-VAL     PIC S9(09)    COMP-3 OCCURS 12.
004300 01  W70-ACTS.
004310     03  W70-BRANCH  PIC  9(04)    COMP-5.

004470 COPY W70.WS.

       01  W75-KEYS.
	   03  W75-S	   PIC 9(02) COMP-5.
	   03  W75-S1	   PIC 9(02) COMP-5.
	   03  W75-GNO	   PIC 9(06) COMP-5
			   OCCURS 18.

004540 01  W90-COMP.
004550     03  W90-CNAME   PIC  X(40).

       LINKAGE SECTION.

       COPY CHAIN.LS.

      /
004560 SCREEN SECTION.

       COPY BLANK.CRT.

       COPY ERROR.CRT.

      /
001230 PROCEDURE DIVISION
		 USING LS-PARID LS-USER-ID LS0-PROGRAMS LS0-SECURITY.
006540 AA000	       SECTION.
006550 AA00.
003240	   IF LS0-GLLEV < 2
	       MOVE "Not Authorised"
				 TO WS-ERR-STRING
003260	       PERFORM ERROR-MESSAGE
	       GO TO AA49.
006560	     PERFORM ZA000.
	     PERFORM LA000.

       AA49.
	     EXIT PROGRAM.

       COPY FUNCTION.SCR.

       COPY ERROR.SCR.

       COPY LOCKED.REC.

       COPY CLEAR.CRT.

007600 AB000           SECTION.

       COPY CONTROL.RD.

       COPY PARAM.RD.

       COPY GACCNT.RD.

      /
008790 AC000           SECTION.

       COPY CONTROL.WR.

       COPY GACCNT.WR.

      /
031660 LA000	     SECTION 5.
031670 LA00.
031680       DISPLAY CLR-SCREEN.
031690	     DISPLAY "Accumulate Group & Sub-Group Totals" AT 0422
031700		      WITH FOREGROUND-COLOR 7 HIGHLIGHT.
031710	     DISPLAY "Are you sure (Y/N)?" AT 0622
031720		      WITH FOREGROUND-COLOR 6 HIGHLIGHT.
031730	     ACCEPT WS-OPTION AT 0642
		    WITH FOREGROUND-COLOR 7 HIGHLIGHT AUTO.
	     CALL "CBL_TOUPPER" USING WS-OPTION
				BY VALUE WS-LENGTH
				RETURNING WS-STATUS.
031790	   IF WS-OPTION = "N"
031800         GO TO LA999.
             MOVE W05-MM         TO WS-PERIOD.
	     DISPLAY "Month to be accumulated :" AT 0822.
       LA02.
	     ACCEPT WS-PERIOD AT 0848
		    WITH FOREGROUND-COLOR 7 HIGHLIGHT
			 BACKGROUND-COLOR 5 UPDATE AUTO.
	     DISPLAY CLEAR-L25.
           IF WS-PERIOD < 01 OR > 12
	       MOVE "Invalid month"
				 TO WS-ERR-STRING
003260	       PERFORM ERROR-MESSAGE
	       GO TO LA02.
031810	     DISPLAY "Account No:" AT 1422.
031820       MOVE 4              TO WS-NETKEY.
031830       PERFORM READ-CONTROL THRU READ-CONTROL-EXIT.
031840       MOVE ZERO TO W15-ACCOUNT W20-ACCOUNT WS-KSTORE
031850                    WS-SKSTORE W20-TOTAL W20-STOTAL W20-BTOTAL
031860                    WS-INKEY WS-COKEY W20-INTOT W20-COTOT. 
	     MOVE 100000	 TO G-AC.
	     PERFORM START-AT-LEDG-AC THRU READ-GACCNT-EXIT.
	   IF WS-F-ERROR = 8
031890	       GO TO LA999.
031900 LA05.
	     PERFORM READ-GACCNT-NEXT THRU READ-GACCNT-EXIT.
027270	   IF WS-F-ERROR = 8
	       GO TO LA100.
031910	     MOVE G-AC		 TO W15-ACCOUNT W20-ACCOUNT.
031920	     DISPLAY G-AC AT 1434
		     WITH FOREGROUND-COLOR 3 HIGHLIGHT
			  BACKGROUND-COLOR 5.
031930     IF W15-REST NOT = ZERO    
031940         GO TO LA90.
031950     IF G-AC NOT = 100000
031960         GO TO LA999.
031970	     MOVE G-AC		 TO WS-KSTORE WS-INKEY.

031990 LA10.
	     PERFORM READ-GACCNT-NEXT THRU READ-GACCNT-EXIT.
027270	   IF WS-F-ERROR = 8
	       GO TO LA100.
032020	     MOVE G-AC		 TO W20-ACCOUNT.
032030	     DISPLAY G-AC AT 1434
		     WITH FOREGROUND-COLOR 3 HIGHLIGHT
			  BACKGROUND-COLOR 5.
032040	   IF G-AC = 200000
032050	       MOVE G-AC	 TO WS-COKEY.
032060     IF W20-ACCOUNT NOT = W70-UNPROF
032070         GO TO LA15. 
031820	     MOVE 4		 TO WS-NETKEY.
031830	     PERFORM READ-CONTROL-LOCK THRU READ-CONTROL-EXIT.
	     ADD G-PL-MTH (WS-PERIOD)
				 TO W20-STOTAL.
032100	     PERFORM REWRITE-CONTROL-UNLOCK THRU WRITE-GACCNT-EXIT.
032110	     GO TO LA30.

032120 LA15.
032130     IF W20-GR = W15-GR
032140         GO TO LA20.
032150     IF W20-REST NOT = ZERO
032160         GO TO LA90.
032170     IF W15-SGRP = ZERO
032180	       MOVE W20-STOTAL	 TO W20-TOTAL
032190         GO TO LA70.
032200       PERFORM LA50 THRU LA60.
032210       GO TO LA70.

032220 LA20.
032230     IF W20-SGRP = ZERO
032240         GO TO LA30.
032250     IF W20-SGRP = W15-SGRP
032260         GO TO LA30.
032270     IF W20-ASER NOT = ZERO
032280         GO TO LA90.
032290     IF W15-SGRP NOT = ZERO
032300         GO TO LA50.
032310     IF W20-STOTAL NOT = ZERO
032320         GO TO LA90.
032330       GO TO LA60.

032340 LA30.
032350	     ADD G-BVAL (WS-PERIOD)
				 TO W20-BTOTAL.
           IF W05-MM NOT = WS-PERIOD
	       ADD G-VAL (WS-PERIOD)
                                 TO W20-STOTAL
           ELSE
032360         ADD G-BAL         TO W20-STOTAL.
032390       GO TO LA10.

032400 LA50.
032410	     MOVE WS-SKSTORE	 TO G-AC.
032420       PERFORM READ-GACCNT THRU READ-GACCNT-EXIT.
032440	     MOVE W20-BTOTAL	 TO G-BVAL (WS-PERIOD).
	     MOVE W20-STOTAL	 TO G-VAL (WS-PERIOD).
	   IF W05-MM = WS-PERIOD
032430	       MOVE W20-STOTAL	 TO G-BAL.
032450       PERFORM REWRITE-GACCNT THRU WRITE-GACCNT-EXIT.
032460 LA60.
032470	     MOVE W20-ACCOUNT	 TO WS-SKSTORE.
032480	     MOVE W20-SGRP	 TO W15-SGRP.
032490	     ADD W20-STOTAL	 TO W20-TOTAL.
032500	     MOVE ZERO		 TO W20-STOTAL W20-BTOTAL.
032510 LA65.
032630	     MOVE W20-ACCOUNT	 TO G-AC.
	     PERFORM READ-GACCNT THRU READ-GACCNT-EXIT.
032520	     GO TO LA10.
032530 LA70.
032540	     MOVE WS-KSTORE	 TO G-AC.
032550       PERFORM READ-GACCNT THRU READ-GACCNT-EXIT.
	     MOVE W20-TOTAL	 TO G-VAL (WS-PERIOD).
	   IF W05-MM = WS-PERIOD
032560	       MOVE W20-TOTAL	 TO G-BAL.
032570       PERFORM REWRITE-GACCNT THRU WRITE-GACCNT-EXIT.
032580     IF G-GRP = 1
032590	       ADD W20-TOTAL	 TO W20-INTOT.
032600     IF G-GRP = 2
032610	       ADD W20-TOTAL	 TO W20-COTOT.
032620 LA80.
032630	     MOVE W20-ACCOUNT	 TO WS-KSTORE G-AC.
032640	     MOVE W20-ACNO	 TO W15-ACNO.
032650	     MOVE ZERO		 TO W20-TOTAL.
	     PERFORM READ-GACCNT THRU READ-GACCNT-EXIT.
032660 LA85.
032670	     GO TO LA10.
032680 LA90.
032690       DISPLAY CLR-SCREEN.
032700	     DISPLAY "Missing Group or Sub-Group heading" AT 0612
032710		      WITH FOREGROUND-COLOR 6 HIGHLIGHT.
032720	     DISPLAY "Last account number at :" AT 0812
032730		      WITH FOREGROUND-COLOR 6 HIGHLIGHT
032740		      W20-ACCOUNT WITH FOREGROUND-COLOR 7 HIGHLIGHT.
	     DISPLAY "Press any key to exit and rectify" AT 1012
		      WITH FOREGROUND-COLOR 3 HIGHLIGHT.
032750	     ACCEPT WS-OPTION AT 1046
		    WITH FOREGROUND-COLOR 7 HIGHLIGHT.
032760       GO TO LA999.
032770 LA100.
032780     IF W15-SGRP NOT = ZERO
032790         PERFORM LA50.
032800	     ADD W20-STOTAL	 TO W20-TOTAL.
032810       PERFORM LA70.
032820	     MOVE WS-INKEY	 TO G-AC.
032830       PERFORM READ-GACCNT THRU READ-GACCNT-EXIT.
           IF W05-MM NOT = WS-PERIOD
032840	       MOVE W20-INTOT	 TO G-BVAL (WS-PERIOD)
           ELSE
032840	       MOVE W20-INTOT	 TO G-BVAL (W05-MM).
032850       PERFORM REWRITE-GACCNT THRU WRITE-GACCNT-EXIT.
032860     IF WS-COKEY > ZERO
032870	       MOVE WS-COKEY	 TO G-AC
032880         PERFORM READ-GACCNT THRU READ-GACCNT-EXIT 
               IF W05-MM NOT = WS-PERIOD
032890             MOVE W20-COTOT 
                                 TO G-BVAL (WS-PERIOD)
               ELSE
032890             MOVE W20-COTOT 
                                 TO G-BVAL (W05-MM)
               END-IF
032900         PERFORM REWRITE-GACCNT THRU WRITE-GACCNT-EXIT.
032910 LA999.
032920       EXIT.
      /
035270 ZA000	     SECTION 9.
035280 ZA00.
             PERFORM ZA55 THRU ZA60.
	     MOVE LS-PARID	 TO WS-PARID.
	     MOVE LS-L-OR-N	 TO W02-L-OR-N.
	     MOVE WS-SYS-ID	 TO W02-SYSID.
	     MOVE LS-TODAY-DDMMYY
				 TO TODAY-DDMMYY.
	     MOVE LS-USUB	 TO WS-USUB.
035290	     DISPLAY CLR-SCREEN.
      *
      *    ****    S E T   U P   T H E   F U N C T I O N   K E Y S
      *
	     MOVE 1		 TO USER-ACTION
				    USER-SETTING.
      *
      *    ESC, F1 to F10 keys
      *
	     MOVE ZERO		 TO USER-NUMBER.
	     MOVE 11		 TO USER-KEYS.
	     CALL X"AF" USING SET-BIT-PAIRS, USER-KEY-CONTROL.
      *
      *    PAGE-UP AND PAGE-DOWN KEYS
      *
	     MOVE 53		 TO USER-NUMBER.
	     MOVE 2		 TO USER-KEYS.
	     CALL X"AF" USING SET-BIT-PAIRS, USER-KEY-CONTROL.
      *
      *    ****    A C T I V A T E   M O U S E
      *
	     MOVE 64		 TO MOUSE-FUNC.
	     MOVE 1		 TO MOUSE-PARAM.
	     CALL X"AF" USING MOUSE-FUNC
			      MOUSE-PARAM.
	   IF MOUSE-FUNC NOT = 255
	       MOVE "Y"		 TO MOUSE-ATTACHED
	       MOVE 66		 TO MOUSE-FUNC
	       MOVE 0		 TO MOUSE-PARAM
	       CALL X"AF" USING MOUSE-FUNC
				MOUSE-PARAM
	   ELSE
	       GO TO ZA00A.
      *
      *    ****    S E T   M O U S E   K E Y   T O   A C T
      * 	   A S	 F U N C T I O N   K E Y
      *
	     MOVE 3		 TO USER-ACTION.
	     MOVE 27		 TO USER-NUMBER.
	     MOVE 2		 TO USER-KEYS.
	     CALL X"AF" USING SET-BIT-PAIRS, USER-KEY-CONTROL.
      *
      *    ****    P A R A M E T E R   F I L E
      *
       ZA00A.
	     MOVE "PARAM"	 TO AFID-KEY.

       ZA00-READ-APACFIDS.
000030	     READ APACFIDS WITH IGNORE LOCK
	       KEY IS AFID-KEY.
	   IF WS-STATUS = "00"
	       GO TO ZA00-READ-APACFIDS-EXIT.
006260	     STRING "Missing " DELIMITED SIZE
		     AFID-KEY DELIMITED BY " "
		     " file ID - Status " DELIMITED SIZE
		     WS-STATUS DELIMITED SIZE
		     INTO WS-ERR-MES.
	     PERFORM ERROR-LENGTH THRU ERROR-EXIT.
006370	     STOP RUN.

       ZA00-READ-APACFIDS-EXIT.
	     EXIT.

       ZA00A-CONTINUE.
	     MOVE AFID-PATH	 TO W02-PARAM.
	     MOVE "GACCNT"	 TO AFID-KEY.
	     PERFORM ZA00-READ-APACFIDS THRU ZA00-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-GACCNT.
	     MOVE "NETWORK"	 TO AFID-KEY.
	     PERFORM ZA00-READ-APACFIDS THRU ZA00-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-NETWORK.

042170 ZA02.
	     MOVE 4		 TO WS-NETKEY.
035770       PERFORM READ-CONTROL THRU READ-CONTROL-EXIT.
035900	   IF G-YEAR-END = ZERO
035910	       MOVE 2		 TO G-YEAR-END
035920	       PERFORM REWRITE-CONTROL THRU WRITE-CONTROL-EXIT.
      *
      *    ****    S E T   U P   M O N T H S   ( Y E A R   E N D)
      *
035930	     MOVE 1		 TO WS-S1.
035940	     MOVE G-YEAR-END	 TO WS-S2 WS-Y-END.
035160	     MOVE G-LAST-YE	 TO WS-L-END.
	     MOVE G-OPEN	 TO WS-OPEN.
	     MOVE 6		 TO WS-PARKEY.
034380       PERFORM READ-PARAM THRU READ-PARAM-EXIT.
             MOVE PAR-UNPROF     TO W70-UNPROF.             
035680	     MOVE 1		 TO WS-PARKEY.
035690       PERFORM READ-PARAM THRU READ-PARAM-EXIT.
035700	     MOVE PAR-COMPANY	 TO W90-CNAME.
035710	     MOVE PAR-DMY	 TO W05-TODAY.
035720	     MOVE PAR-YMD	 TO W05-TYMD.
036120	     MOVE WS-Y-END	 TO WS-S1.
036130	     MOVE W05-CY	 TO WS-S2.
036140     IF W05-MM < WS-Y-END
036150	       SUBTRACT 1	 FROM WS-S2.

036160 ZA20.
036170	     ADD 1		 TO WS-S1.
036180     IF WS-S1 > 12
036190	       MOVE 1		 TO WS-S1
036200	       ADD 1		 TO WS-S2.
036210	     MOVE WS-S2 	 TO W40-YEAR (WS-S1).
036220     IF WS-S1 NOT = WS-Y-END
036230         GO TO ZA20.
	     DISPLAY SPACES AT 2525
		     WITH BACKGROUND-COLOR 3 FOREGROUND-COLOR 1.
036250	     GO TO ZA999.

       ZA55.
041220	     MOVE 1		 TO WS-S1.
021870	     MOVE SPACES	 TO WS-MID-LNE.

041240 ZA60.
041250	     MOVE WS-G1 	 TO WS-TCHR(WS-S1) WS-BCHR(WS-S1).
	     MOVE WS-G8 	 TO WS-TCH(WS-S1)  WS-BCH(WS-S1).
041260     IF WS-S1 < 80
041270	       ADD 1		 TO WS-S1
041280         GO TO ZA60.
	     MOVE WS-G9 	 TO WS-TCH(1).
	     MOVE WS-G10	 TO WS-TCH(80).
	     MOVE WS-G11	 TO WS-BCH(1).
	     MOVE WS-G12	 TO WS-BCH(80).
	     MOVE WS-G14	 TO WS-TCHR(1)	WS-BCHR(1).
	     MOVE WS-G13	 TO WS-TCHR(80) WS-BCHR(80).
021930	     MOVE WS-G2 	 TO WS-TCHR(11) WS-TCHR(45)
021940				    WS-TCHR(63).
021950	     MOVE WS-G3 	 TO WS-MCHR(11) WS-MCHR(45)
021960				    WS-MCHR(63)
				    WS-MCHR(1)	WS-MCHR(80).
021970	     MOVE WS-G4 	 TO WS-BCHR(11) WS-BCHR(45)
021980				    WS-BCHR(63).
	     MOVE LS-COMPANY	 TO WS-TOP-COMP.
	   IF LS-USER = LS-SYS-ID
	       MOVE "SupervisorÄ"  TO WS-WRKHD
	   ELSE
	       MOVE "Workstation"  TO WS-WRKHD
	       MOVE LS-USER	   TO WS-WRKST.
036340 ZA999.
036350       EXIT.
      /
036360 ZB000	     SECTION 9.

       COPY ERRORS.PRO.

041560 DISPLAY-FILE-NAME.
041610     IF WS-F-ERROR = 2
041620         MOVE W02-NETWORK TO WS-FILE
041630         MOVE WS-NETKEY TO WS-KEY
041640     ELSE
041810     IF WS-F-ERROR = 8
041820	       MOVE W02-GACCNT	 TO WS-FILE
041830	       MOVE ZERO	 TO WS-KEY
	       MOVE G-AC	 TO WS-KEYX
041840     ELSE
041850     IF WS-F-ERROR = 15
041860         MOVE WS-PARID TO WS-FILE
041870	       MOVE WS-PARKEY TO WS-KEY.

       COPY DISPERR.PRO.
