      ******************************************************************
      *                                                                *
      *    ******    ******   *******	*******   *******   ******     *
      *   **	**  **	  **  **    **	**    **  **	   **	 **    *
      *   **	    **	      **    **	**   **   **	   **	       *
      *   **	     ******   *******	******	  *****    **	       *
      *   **		  **  **	**   **   **	   **	       *
      *   **	**  **	  **  **	**    **  **	   **	 **    *
      *    ******    ******   **	**    **  *******   ******     *
      *                                                                *
      *       ENGLISH                                                  *
      *                                                                *
      *       C A S H	B O O K   R E C O V E R Y   P R O G R A M      *
      *                                                                *
      *     VERSION 8.06 - August 2002			       *
      * 							       *
      ******************************************************************
000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID.     CSPREC.
000030 AUTHOR.         J W LEMMON (APAC).
000040 DATE-WRITTEN.   DECEMBER 1986.

		   COPYRIGHT NOTICE: COPYRIGHT (C) 1986 - 2002
				     by James William Lemmon.

		   All rights reserved.

000050 SECURITY.   PROGRAM MATERIAL IS THE SOLE PROPERTY OF
000060		   James William Lemmon.(Id No. 4412165050082).

000050 ENVIRONMENT DIVISION.
000060 CONFIGURATION SECTION.
000070 SPECIAL-NAMES.
000080                CONSOLE IS CRT.
000090 INPUT-OUTPUT SECTION.
000100 FILE-CONTROL.

       COPY APACFIDS.SL.

000110	   SELECT NETWORK ASSIGN DISK
                          LOCK EXCLUSIVE
000120                    STATUS WS-STATUS
000130                    ACCESS RANDOM
000140                    ORGANIZATION RELATIVE
000150                    RELATIVE WS-NETKEY.
000110	   SELECT PARAM  ASSIGN DISK
                         LOCK EXCLUSIVE
000120                   STATUS WS-STATUS
000130                   ACCESS RANDOM
000140                   ORGANIZATION RELATIVE
000150                   RELATIVE WS-PARKEY.
      $SET KEYCOMPRESS "7"
000160	   SELECT CASHBOOK ASSIGN DISK
			   LOCK EXCLUSIVE
000170			   STATUS WS-STATUS
000180			   ACCESS DYNAMIC
000260			   ORGANIZATION INDEXED
000270			   RECORD CSH-KEY
			   ALTERNATE RECORD CSH-AC DUPLICATES
			   ALTERNATE RECORD CSH-NKEY DUPLICATES.
000210	   SELECT CASHTRAN ASSIGN DISK
			   LOCK EXCLUSIVE
000220			   STATUS WS-STATUS
000230			   ACCESS DYNAMIC
000240			   ORGANIZATION INDEXED
000250			   RECORD CTR-KEY
			   ALTERNATE RECORD CTR-AKEY DUPLICATES
			   ALTERNATE RECORD CTR-VKEY =
			       CTR-AC CTR-VAL CTR-DATE DUPLICATES.
000210	   SELECT LEDTRF ASSIGN DISK
                         LOCK EXCLUSIVE
000220                   STATUS WS-STATUS
000230                   ACCESS DYNAMIC
000240                   ORGANIZATION INDEXED
000250                   RECORD XFR-KEY.
      $SET NOKEYCOMPRESS

000240 COPY RECOVER.SL.

      /
000260 DATA DIVISION.
000270 FILE SECTION.

       COPY APACFIDS.FDE.

000290 COPY CONTROL.IFD.

000290 COPY PARAM.IFD.

000140 COPY CASHBOOK.FD.

000160 COPY CASHTRAN.FD.

       COPY LEDTRF.FD.

000410 COPY RECOVER.GFD.

      /
000430 WORKING-STORAGE SECTION.
       77  WS-CHECK	   PIC	X(18)	 VALUE
			   "aeWlimemnomLalismJ".
000440 77  WS-S1	    PIC 9(04)	  COMP-5.
000440 77  WS-SUB           PIC 9(04)     COMP-5.
003290 77  WS-NETKEY        PIC 9(04)     COMP-5 VALUE 1.
003340 77  WS-PARKEY        PIC 9(04)     COMP-5 VALUE 1.
003350 77  WS-OTRKEY        PIC 9(04)     COMP-5 VALUE 1.
003360 77  WS-RECKEY        PIC 9(04)     COMP-5.
000520 77  WS-RECOVER       PIC 9(05)     COMP-0.
000530 77  WS-TRANS         PIC 9(05)     COMP-0 VALUE 1.
000540 77  WS-EKEY          PIC Z(04)9.
000560 77  WS-ERROR         PIC 9(01)     VALUE ZERO.
000570 77  WS-PROG          PIC X(02).
       77  WS-OPTION        PIC X(01).
       77  TODAY-DDMMYY	   PIC	9(08) COMP-5.
       77  WS-USUB	   PIC	9(04) COMP-5.
002420 01  WS-DB-LINE.
002430     03  WS-TOP-LNE.
002440         05  WS-TCHR PIC  X(01) OCCURS 80.
           03  WS-T-LINE REDEFINES WS-TOP-LNE.
               05  FILLER  PIC  X(01).
               05  WS-H-LINE
                           PIC  X(78).
               05  FILLER  PIC  X(01).
002430     03  WS-TOP-LNE2.
002440         05  WS-TCH  PIC  X(01) OCCURS 80.
           03  WS-TP-LINE2 REDEFINES WS-TOP-LNE2.
               05  FILLER      PIC  X(01).
               05  WS-TOP-COMP PIC  X(40).
001430	       05  FILLER      PIC  X(23).
	       05  WS-WRKHD    PIC  X(11).
001430	       05  FILLER      PIC  X(01).
	       05  WS-WRKST    PIC  X(03).
001430	       05  FILLER      PIC  X(01).
002450	   03  WS-MID-LNE.
002460         05  WS-MCHR PIC  X(01) OCCURS 80.
002450     03  WS-MID-LNE2.
	       05  FILLER      PIC  X(01) VALUE "³".
	       05  WS-BLNK78   PIC  X(78) VALUE ALL "°".
	       05  FILLER      PIC  X(01) VALUE "³".
002470	   03  WS-BOT-LNE.
002480         05  WS-BCHR PIC  X(01) OCCURS 80.
           03  WS-B-LINE REDEFINES WS-BOT-LNE.
               05  FILLER  PIC  X(01).
               05  WS-F-LINE
                           PIC  X(78).
               05  FILLER  PIC  X(01).
002470     03  WS-BOT-LNE2.
002480         05  WS-BCH  PIC  X(01) OCCURS 80.

000590 COPY WS.WS.

000290 01  WS-PARID.
000020	   03  WS-SYS-ID       PIC  X(03).

004000 01  W02-FID.

       COPY APACFIDS.ID.

000290 COPY CONTROL.ID.

000140 COPY CASHBOOK.ID.

000160 COPY CASHTRAN.ID.

       COPY LEDTRF.ID.

       COPY PARAM.ID.

000410 COPY RECOVER.ID.

       COPY W12.WS.

       LINKAGE SECTION.

       COPY CHAIN.LS.

      /
000850 SCREEN SECTION.

       COPY BLANK.CRT.

000860 01  S00.
000910	   03  LINE  2 COLUMN 31 FOREGROUND-COLOR 3
000920		       VALUE "Cash Book Recovery Program".
000930     03  LINE  4 COLUMN  1 FOREGROUND-COLOR 3
000940                 VALUE "Checking Recovery file".
000950     03  LINE  6 COLUMN 12 FOREGROUND-COLOR 3
000960                 VALUE "RECOVER :".
000970 01  S01.
000980     03  LINE  6 COLUMN 22 FOREGROUND-COLOR 15
000990                 PIC Z(04)9 USING WS-RECKEY.
001000 01  S02.
001010     03  LINE  8 COLUMN 12 FOREGROUND-COLOR 3
001020                 VALUE "Busy recovering files".
001030     03  LINE 10 COLUMN 12 FOREGROUND-COLOR 3
001040                 VALUE "RECOVER :".
001050 01  S03.
001060     03  LINE 10 COLUMN 22 FOREGROUND-COLOR 15
001070                 PIC Z(04)9 USING WS-RECKEY.
001080 01  S04.
001090     03  LINE 12 COLUMN 12 FOREGROUND-COLOR 11
001100                 VALUE "Recovery complete".
001110     03  LINE 14 COLUMN 12 FOREGROUND-COLOR 11
001120                 VALUE "You may now restart the system".
001130 01  S05.
001140     03  LINE 12 COLUMN 12 FOREGROUND-COLOR 11
001150                 VALUE "Recovery unsuccessfull !".
001160     03  LINE 14 COLUMN 12 FOREGROUND-COLOR 11
001170                 VALUE "Reload files from last backup and rekey al
001180-                      "l updates and transactions".
001190     03  LINE 16 COLUMN 12 FOREGROUND-COLOR 11
001200                 VALUE "since creating the last backup disk/s".
      /
001230 PROCEDURE DIVISION
		 USING LS-PARID LS-USER-ID LS0-PROGRAMS LS0-SECURITY.
001220 AA000	       SECTION.
001230 AA00.
041220	     MOVE 1		 TO WS-S1.
021870	     MOVE SPACES	 TO WS-MID-LNE.
041240 AA02.
041250	     MOVE WS-G1 	 TO WS-TCHR(WS-S1) WS-BCHR(WS-S1).
	     MOVE WS-G8 	 TO WS-TCH(WS-S1)  WS-BCH(WS-S1).
041260     IF WS-S1 < 80
041270	       ADD 1		 TO WS-S1
041280         GO TO AA02.
             MOVE WS-G9  TO WS-TCH  (1).
             MOVE WS-G10 TO WS-TCH  (80).
             MOVE WS-G11 TO WS-BCH  (1).
             MOVE WS-G12 TO WS-BCH  (80).
             MOVE WS-G14 TO WS-TCHR (1)  WS-BCHR (1).
             MOVE WS-G13 TO WS-TCHR (80) WS-BCHR (80).
021930       MOVE WS-G2  TO WS-TCHR (16) WS-TCHR (41)
021940                      WS-TCHR (64) WS-TCHR (71).
021950       MOVE WS-G3  TO WS-MCHR (16) WS-MCHR (41)
021960                      WS-MCHR (64) WS-MCHR (71)
			    WS-MCHR (1)  WS-MCHR (80).
021970       MOVE WS-G4  TO WS-BCHR (16) WS-BCHR (41)
021980                      WS-BCHR (64) WS-BCHR (71).
	     MOVE LS-COMPANY	 TO WS-TOP-COMP.
	   IF LS-USER = LS-SYS-ID
	       MOVE "SupervisorÄ"  TO WS-WRKHD
	   ELSE
	       MOVE "Workstation"  TO WS-WRKHD
	       MOVE LS-USER	   TO WS-WRKST.
001250	     DISPLAY CLR-SCREEN.
001270       PERFORM ZA000.
001260       DISPLAY S00.
001280     IF WS-ERROR = 9
001290         GO TO AA50.
001320       OPEN INPUT RECOVER.
001330       MOVE 1 TO WS-RECKEY.
001340 AA05.
001350       READ RECOVER.
001360     IF WS-STATUS NOT = "00"
001370         GO TO AA10.
001380       DISPLAY S01.
001390     IF REC-FILE = 99
001400         MOVE ZERO TO WS-TRANS
001410     ELSE
001420         MOVE REC-TRAN TO WS-TRANS.
001430       ADD 1 TO WS-RECKEY.
001440       GO TO AA05.
001450 AA10.
001460     IF WS-TRANS = ZERO
001470         GO TO AA20.
001480       DISPLAY S02.
001490 AA15.
001500       SUBTRACT 1 FROM WS-RECKEY.
001510     IF WS-RECKEY = ZERO
001520         GO TO AA20.
001530       READ RECOVER.
001540     IF WS-STATUS NOT = "00"
               DISPLAY "AA15" AT 2002
001550         GO TO AA50.
001560     IF REC-TRAN NOT = WS-TRANS
001570         GO TO AA20.
001580       DISPLAY S03.
001590     IF REC-FILE = 01
001600         PERFORM AY01 THRU AY999
001700	   ELSE
001650	   IF REC-FILE = 29
001660	       PERFORM AY29 THRU AY999
001670     ELSE
001680	   IF REC-FILE = 30
001690	       PERFORM AY30 THRU AY999
001730	   ELSE
001740	   IF REC-FILE = 39
001750         PERFORM AY39 THRU AY999
001730     ELSE
001740     IF REC-FILE = 40
001750         PERFORM AY40 THRU AY999.
001760       GO TO AA15.
001770 AA20.
001780       MOVE 4              TO WS-PARKEY.
001790       READ PARAM.
001800       SUBTRACT 1 FROM PAR-USERS.
001810       MOVE SPACES TO PAR-USR (WS-SUB) PAR-PROG (WS-SUB).
001820       REWRITE PAR-RECORD1.
001830       CLOSE PARAM
		   CASHBOOK
001860		   CASHTRAN
                   LEDTRF
001870             RECOVER.
001910       DISPLAY S04.
001920       STOP RUN.
001930 AA50.
001940       DISPLAY S05.
001950       STOP RUN.
      /
      *    THIS ROUTINE REWRITES THE BEFORE IMAGES OF THE FILES.
      *
001960 AY000           SECTION.
001970 AY01.
001980       MOVE REC-KEY TO WS-PARKEY.
001990       MOVE REC-PARAM TO PAR-RECORD1.
002000       REWRITE PAR-RECORD1.
002010     IF WS-STATUS NOT = "00"
002020         PERFORM AA50.
002030       GO TO AY999.
011840 AY29.
011870	     MOVE REC-CASHBK	 TO CSH-RECORD.
           IF REC-TYPE = 0
002310	       REWRITE CSH-RECORD
           ELSE
           IF REC-TYPE = 1
	       DELETE CASHBOOK RECORD
           ELSE
           IF REC-TYPE = 2
	       WRITE CSH-RECORD.
011880       GO TO AY999.
011890 AY30.
012020	     MOVE REC-CASHTR	 TO CTR-REC.
           IF REC-TYPE = 0
002310	       REWRITE CTR-REC
           ELSE
           IF REC-TYPE = 1
	       DELETE CASHTRAN RECORD
           ELSE
           IF REC-TYPE = 2
	       WRITE CTR-REC.
011930	     GO TO AY999.
       AY39.
002370       MOVE REC-KEY TO WS-NETKEY.
002380       MOVE REC-NETWORK TO NET-RECORD.
002390       REWRITE NET-RECORD.
002400     IF WS-STATUS NOT = "00"
002420         PERFORM AA50.
002430       GO TO AY999.
       AY40.
             MOVE REC-LEDTRF     TO XFR-REC.
           IF REC-TYPE = 0
002310         REWRITE XFR-REC
           ELSE
           IF REC-TYPE = 1
               DELETE LEDTRF RECORD
           ELSE
           IF REC-TYPE = 2
               WRITE XFR-REC.
002350       GO TO AY999.
002440 AY999.
002450       EXIT.
      /
002460 ZA000           SECTION.
002470 ZA00.
	     MOVE LS-PARID	 TO WS-PARID.
	     MOVE LS-L-OR-N	 TO W02-L-OR-N.
	     MOVE WS-SYS-ID	 TO W02-SYSID.
	     MOVE LS-TODAY-DDMMYY
				 TO TODAY-DDMMYY.
	     MOVE LS-USUB	 TO WS-USUB.
      *
      *    ****    P A R A M E T E R   F I L E
      *
       ZA00A.
	     MOVE "PARAM"	 TO AFID-KEY.

       ZA00-READ-APACFIDS.
000030	     READ APACFIDS WITH IGNORE LOCK
	       KEY IS AFID-KEY.
	   IF WS-STATUS = "00"
	       GO TO ZA00-READ-APACFIDS-EXIT.
006260	     STRING "Missing " DELIMITED SIZE
		     AFID-KEY DELIMITED BY " "
		     " file ID - Status " DELIMITED SIZE
		     WS-STATUS DELIMITED SIZE
		     INTO WS-ERR-MES.
	     PERFORM ERROR-LENGTH THRU ERROR-EXIT.
006370	     STOP RUN.

       ZA00-READ-APACFIDS-EXIT.
	     EXIT.

       ZA00A-CONTINUE.
	     MOVE AFID-PATH	 TO W02-PARAM.




002480	     OPEN I-O PARAM.
002490     IF WS-STATUS NOT = "00"
002500         MOVE 15    TO WS-F-ERROR
002510         PERFORM OPEN-ERROR.
002520       MOVE 3 TO WS-PARKEY.
002530       READ PARAM.
002540     IF WS-STATUS NOT = "00"
002550	       MOVE 15		 TO WS-F-ERROR
002560         PERFORM READ-ERROR.
002660	     MOVE WS-PTH15	 TO W02-PTH2
				    W02-PTH3 W02-PTH11
				    W02-PTH4 W02-PTH18
				    W02-PTH7 W02-PTH32
				    W02-PTH8 W02-PTH40.
042030	     MOVE LS-USER	 TO W02-USE18.
042140       OPEN I-O NETWORK.
042150     IF WS-STAT1 = "9"
042160         GO TO ZA200.
003050     IF WS-STATUS NOT = "00"
003060	       MOVE 2		 TO WS-F-ERROR
003070         PERFORM OPEN-ERROR.
042140       OPEN I-O DEPART.
042150     IF WS-STAT1 = "9"
042160         GO TO ZA200.
003050     IF WS-STATUS NOT = "00"
003060	       MOVE 7		 TO WS-F-ERROR
003070         PERFORM OPEN-ERROR.
042170       OPEN I-O GACCNT.
042180     IF WS-STAT1 = "9"
	       IF FLE-LOCKED
042190		   GO TO ZA200
               ELSE
	       IF IDX-CORRUPT OR
		 (WS-STATUS = "39")
		   CLOSE PARAM
		   CALL "UTP\GACREB"
			 USING LS-PARID LS-USER-ID LS0-PROGRAMS
			       LS0-SECURITY
		   CANCEL "UTP\GACREB"
		   OPEN I-O PARAM NETWORK
		   GO TO ZA02.
003050     IF WS-STATUS NOT = "00"
003060         MOVE 8 TO WS-F-ERROR
003070         PERFORM OPEN-ERROR.
       ZA02.
003040       OPEN I-O GLTRAN.
042120     IF WS-STAT1 = "9"
	       IF FLE-LOCKED
042130             GO TO ZA200
               ELSE
	       IF IDX-CORRUPT OR
		 (WS-STATUS = "39")
		   CLOSE PARAM
		   CALL "UTP\GTRREB"
			 USING LS-PARID LS-USER-ID LS0-PROGRAMS
			       LS0-SECURITY
		   CANCEL "UTP\GTRREB"
		   OPEN I-O PARAM NETWORK
		   GO TO ZA02.
003050	   IF WS-STATUS NOT = "00"
003060         MOVE 11 TO WS-F-ERROR
003070         PERFORM OPEN-ERROR.
       ZA03.
002670       OPEN I-O TXTRAN.
042120     IF WS-STAT1 = "9"
               IF FLE-LOCKED
042130             GO TO ZA200
               ELSE
	       IF IDX-CORRUPT OR
		 (WS-STATUS = "39")
		   CLOSE PARAM
		   CALL "UTP\TAXREB"
			 USING LS-PARID LS-USER-ID LS0-PROGRAMS
			       LS0-SECURITY
		   CANCEL "UTP\TAXREB"
		   OPEN I-O PARAM NETWORK
                   GO TO ZA03.
002680     IF WS-STATUS NOT = "00"
002690         MOVE 32 TO WS-ERROR
002700         PERFORM OPEN-ERROR.
       ZA04.
002670       OPEN I-O LEDTRF.
042120     IF WS-STAT1 = "9"
               IF FLE-LOCKED
042130             GO TO ZA200
               ELSE
	       IF IDX-CORRUPT OR
		 (WS-STATUS = "39")
		   CLOSE PARAM
		   CALL "UTP\LEDREB"
			 USING LS-PARID LS-USER-ID LS0-PROGRAMS
			       LS0-SECURITY
		   CANCEL "UTP\LEDREB"
		   OPEN I-O PARAM NETWORK
                   GO TO ZA04.
002680     IF WS-STATUS NOT = "00"
002690         MOVE 40 TO WS-F-ERROR
002700         PERFORM OPEN-ERROR.
	   IF LS0-CRP NOT = 2
               GO TO ZA04B.
042210       OPEN I-O CTRANS.
042220     IF WS-STAT1 = "9"
042230         GO TO ZA200.
003050     IF WS-STATUS NOT = "00"
003060         MOVE 4 TO WS-F-ERROR
003070         PERFORM OPEN-ERROR.
       ZA04A.
042240       OPEN I-O CREDIT.
042250     IF WS-STAT1 = "9"
               IF FLE-LOCKED
042130             GO TO ZA200
               ELSE
	       IF IDX-CORRUPT OR
		 (WS-STATUS = "39")
		   CLOSE PARAM
		   CALL "UTP\CRDREB"
			 USING LS-PARID LS-USER-ID LS0-PROGRAMS
			       LS0-SECURITY
		   CANCEL "UTP\CRDREB"
		   OPEN I-O PARAM NETWORK
                   GO TO ZA04A.
003050     IF WS-STATUS NOT = "00"
003060         MOVE 3 TO WS-F-ERROR
003070         PERFORM OPEN-ERROR.
       ZA04B.
002520       MOVE 4 TO WS-PARKEY.
002530       READ PARAM.
002540     IF WS-STATUS NOT = "00"
002550         MOVE 15 TO WS-F-ERROR
002560         PERFORM READ-ERROR.
002840     IF PAR-USERS = ZERO
002850         MOVE 9 TO WS-ERROR
002860         GO TO ZA999-EXIT.
002870       MOVE 1 TO WS-SUB.
002880 ZA05.
002890	   IF PAR-USR (WS-SUB) = LS-USER
002900         MOVE PAR-PROG (WS-SUB) TO WS-PROG
002910         GO TO ZA999-EXIT.
002920     IF WS-SUB < 24
002930         ADD 1 TO WS-SUB
002940         GO TO ZA05.
002950       MOVE 9 TO WS-ERROR.
002960       GO TO ZA999-EXIT.
020110 ZA200.
020120       DISPLAY "Files locked - Try later" AT 2412
020130                WITH FOREGROUND-COLOR 14.
020140       DISPLAY "Press any key" AT 2512 
020150		      WITH BACKGROUND-COLOR 3 FOREGROUND-COLOR 14.
020160	     ACCEPT WS-OPTION AT 2526
		    WITH BACKGROUND-COLOR 3 FOREGROUND-COLOR 15 AUTO.
             MOVE 9 TO WS-ERROR.
003080 ZA999-EXIT.
003090       EXIT.
      /
003100 ZB000-ERROR           SECTION.
      
041480 OPEN-ERROR.
041490       DISPLAY CLR-SCREEN.
041500       DISPLAY "Open error" AT 0812 WITH FOREGROUND-COLOR 14.
041510       PERFORM DISPLAY-FILE-NAME.
      
041480 READ-ERROR.
041490       DISPLAY CLR-SCREEN.
041500       DISPLAY "Read error" AT 0812 WITH FOREGROUND-COLOR 14.
041510       PERFORM DISPLAY-FILE-NAME.
      
041520 WRITE-ERROR.
041530       DISPLAY CLR-SCREEN.
041540       DISPLAY "Write error" AT 0812 WITH FOREGROUND-COLOR 14.
041510       PERFORM DISPLAY-FILE-NAME.
      
041560 DISPLAY-FILE-NAME.
041610     IF WS-F-ERROR = 2
041620         MOVE W02-NETWORK TO WS-FILE
041630         MOVE WS-NETKEY TO WS-KEY
041640     ELSE
041650     IF WS-F-ERROR = 3
041660         MOVE W02-CREDIT TO WS-FILE
041670         MOVE ZERO      TO WS-KEY
               MOVE P-NUMBER     TO WS-KEYX
041680     ELSE
041690     IF WS-F-ERROR = 4
041700         MOVE W02-CRTRAN TO WS-FILE
041710         MOVE WS-CTRKEY TO WS-KEY 
041800     ELSE
041810     IF WS-F-ERROR = 7
041820         MOVE W02-DEPART TO WS-FILE
041830         MOVE WS-DEPKEY TO WS-KEY
041840     ELSE
041810     IF WS-F-ERROR = 8
041820         MOVE W02-GACCNT TO WS-FILE
041830         MOVE WS-GLKEY TO WS-KEY
041840     ELSE
041850     IF WS-F-ERROR = 11
041860         MOVE W02-GLTRAN TO WS-FILE
041870         MOVE WS-GTRKEY TO WS-KEY
041840     ELSE
041850     IF WS-F-ERROR = 15
041860         MOVE WS-PARID TO WS-FILE
041870         MOVE WS-PARKEY TO WS-KEY
041840     ELSE
041850     IF WS-F-ERROR = 18
041860         MOVE W02-RECOVER TO WS-FILE
041870         MOVE WS-RECKEY TO WS-KEY
041840     ELSE
041850     IF WS-F-ERROR = 32
041860         MOVE W02-TXTRAN TO WS-FILE
041870         MOVE ZERO       TO WS-KEY
               MOVE TAX-KEY      TO WS-KEYX
041840     ELSE
041850     IF WS-F-ERROR = 40
041860         MOVE W02-LEDTRF TO WS-FILE
041870         MOVE ZERO       TO WS-KEY
               MOVE XFR-KEY    TO WS-KEYX.
041880     IF WS-STATUS = "10"
041890         MOVE "End of FILE" TO WS-STAT-MESSAGE
041900     ELSE
041910     IF WS-STATUS = "22"
041920         MOVE "Duplicate record number" TO WS-STAT-MESSAGE
041930     ELSE
041940     IF WS-STATUS = "23"
041950         MOVE "Invalid record number" TO WS-STAT-MESSAGE
041960     ELSE
041970     IF WS-STATUS = "24"
041980         MOVE "DISK full" TO WS-STAT-MESSAGE
041990     ELSE
042000     IF WS-STATUS = "30"
042010         MOVE "DISK error" TO WS-STAT-MESSAGE
042020     ELSE
042030     IF WS-STATUS = "94"
042040         MOVE "FILE locked" TO WS-STAT-MESSAGE.
045380       DISPLAY "File - " AT 1012 WS-FILE WITH FOREGROUND-COLOR 11.
045390       DISPLAY "Status " AT 1212 
                      WS-STATUS WITH FOREGROUND-COLOR 11
                     ": " WS-STAT-MESSAGE WITH FOREGROUND-COLOR 14.
045400     IF WS-STATUS NOT = "94" 
045410         DISPLAY "Key    " AT 1412 
                        WS-KEY WITH FOREGROUND-COLOR 11
                        " " WS-KEYX WITH FOREGROUND-COLOR 11
045420         DISPLAY "Reverse backup or contact program Support"
                        AT 1612.
045440         DISPLAY "Please make a note of these details" AT 1812.
042170       STOP RUN.
