      ******************************************************************
      *                                                                *
      *   ******   ********  **     **	********  **	 **  ********  *
      *  **    **     **     ***   ***	**	  ***	***	**     *
      *  **	      **     ** * * **	**	  ** * * **	**     *
      *   ******      **     **  *  **	*****	  **  *  **	**     *
      *        **     **     **     **	**	  **	 **	**     *
      *  **    **     **     **     **	**	  **	 **	**     *
      *   ******      **     **     **	**	  **	 **	**     *
      * 							       *
      *     ENGLISH                                                    *
      *                                                                *
      *     C R E A T E   S T A T E M E N T   F O R M A T   A / R      *
      *                                                                *
      *     VERSION 8.15.00 - December 2010			       *
      * 							       *
      ******************************************************************
000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID.     STPMENU.
000030 AUTHOR.         J W LEMMON (APAC).
000040 DATE-WRITTEN.   AUGUST 2006.

		   COPYRIGHT NOTICE: COPYRIGHT (C) 2005 - 2011
				     by James William Lemmon.
				       (Id No. 4412165050082).

		   All rights reserved.

		   e-mail jwlemmon@gmail.com.

000050 SECURITY.
		   This program is free software; you can redistribute
		   it and/or modify it under the terms of the GNU General
		   Public License as published by the Free Software
		   Foundation; either version 2 of the License, or (at
		   your option) any later version.

		   This program is distributed in the hope that it will
		   be useful, but WITHOUT ANY WARRANTY; without even the
		   implied warranty of MERCHANTABILITY or FITNESS FOR A
		   PARTICULAR PURPOSE.	See the GNU General Public License
		   for more details.

		   You should have received a copy of the GNU General
		   Public License along with this program; if not, write
		   to the Free Software Foundation, Inc., 59 Temple Place
		   - Suite 330, Boston, MA 02111-1307, USA.

000050 ENVIRONMENT DIVISION.
000060 CONFIGURATION SECTION.
000070 SPECIAL-NAMES.  
000080                 CURSOR IS CSTART
000090		       CONSOLE IS CRT
		       CRT STATUS IS KEY-STATUS.
000100 INPUT-OUTPUT SECTION.
000110 FILE-CONTROL.

       COPY APACFIDS.SL.


      /
000330 DATA DIVISION.
000340 FILE SECTION.

       COPY APACFIDS.FDE.


      /
000560 WORKING-STORAGE SECTION.
       77  WS-CHECK	   PIC	X(18)	 VALUE
			   "aeWlimemnomLalismJ".
000610 77  WS-S1	   PIC	9(04)	 COMP-5.
000620 77  WS-S2           PIC  9(04)    COMP-5.
000630 77  WS-S3           PIC  9(04)    COMP-5.
000640 77  WS-S4           PIC  9(04)    COMP-5.
000610 77  WS-S5	   PIC	9(04)	 COMP-5.
000620 77  WS-S6	   PIC	9(04)	 COMP-5.
000630 77  WS-S7	   PIC	9(04)	 COMP-5.
000640 77  WS-S8	   PIC	9(04)	 COMP-5.
       77  WS-LINES	   PIC	9(04)	 COMP-5.
       77  WS-COLS	   PIC	9(04)	 COMP-5.


       77  TODAY-DDMMYY	   PIC	9(08) COMP-5.

001350 01  WS-CRT-LINES.
001380	   03  WS-TOP-LNE2.
001390	       05  WS-TCR   PIC  X(80) VALUE "кФФФФФФФФФФФФФФФФФФФФФФФФФ
      -        "ФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФФП".
001400	   03  WS-TP-LINE2 REDEFINES WS-TOP-LNE2.
001410         05  FILLER      PIC  X(01).
001420         05  WS-TOP-COMP PIC  X(40).
001430	       05  FILLER      PIC  X(23).
	       05  WS-WRKHD    PIC  X(11).
001430	       05  FILLER      PIC  X(01).
	       05  WS-WRKST    PIC  X(03).
001430	       05  FILLER      PIC  X(01).
001460	   03  WS-MID-LNE2.
	       05  FILLER      PIC  X(01) VALUE "Г".
	       05  WS-BLNK78   PIC  X(78) VALUE ALL "А".
	       05  FILLER      PIC  X(01) VALUE "Г".

001840 COPY WS.WS.

000290 01  WS-PARID.
000020	   03  WS-SYS-ID       PIC  X(03).

002040 01  W02-FID.

       COPY APACFIDS.ID.



       01  W10-FORMAT.
	   03  W10-FORMAT-CRT.
	       05  FILLER  PIC	X(148) VALUE
		   "                                STATEMENT LAYOUT".
	       05  FILLER  PIC	X(148) VALUE
	   "ЩЭЭЭЭбЭЭЭбЭЭЭЭЭЭЭЭЭ1ЭЭЭЭЭЭЭЭЭ2ЭЭЭЭЭЭЭЭЭ3ЭЭЭЭЭЭЭЭЭ4ЭЭЭЭЭЭЭЭЭ5
      -	   "ЭЭЭЭЭЭЭЭЭ6ЭЭЭЭЭЭЭЭЭ7ЭЭЭЭЭЭЭЭЭ8ЭЭЭЭЭЭЭЭЭ9ЭЭЭЭЭЭЭЭ10ЭЭЭЭЭЭЭЭ11
      -    "ЭЭЭЭЭЭЭЭ12ЭЭЭЭЭЭЭЭ13ЭЭЭЭЭЭЛ".
	       05  FILLER  PIC	X(148) VALUE
	   "КLineГCPIГ12345678901234567890123456789012345678901234567890
      -	   "123456789012345678901234567890123456789012345678901234567890
      -    "12345678901234567890123456К".
	       05  FILLER  PIC	X(148) VALUE
	   "ЬЭЭЭЭиЭЭЭиЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭ
      -	   "ЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭ
      -	   "ЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЙ".
	       05  FILLER  PIC	X(148) VALUE
	   "К  1 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К  2 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К  3 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К  4 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К  5 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К  6 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К  7 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К  8 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К  9 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 10 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 11 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 12 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 13 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 14 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 15 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 16 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 17 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 18 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 19 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 20 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 21 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 22 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 23 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 24 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 25 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 26 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 27 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 28 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 29 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 30 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 31 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 32 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 33 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 34 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 35 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 36 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 37 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 38 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 39 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 40 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 41 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 42 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 43 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 44 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 45 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 46 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 47 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 48 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 49 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 50 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 51 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 52 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 53 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 54 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 55 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 56 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 57 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 58 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 59 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 60 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 61 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 62 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 63 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 64 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 65 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "К 66 Г   Г
      -	   "
      -	   "                          К".
	       05  FILLER  PIC	X(148) VALUE
	   "ШЭЭЭЭЯЭЭЭЯЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭ
      -	   "ЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭ
      -	   "ЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭМ".
	   03  W10-FORMAT-CRT-LINES REDEFINES W10-FORMAT-CRT.
	       05  W10-LINE OCCURS 71 TIMES.
		   07  W10-CHAR PIC  X(01) OCCURS 148 TIMES


       01  W15-LAYOUT.
	   03  W15-LINES OCCURS 66.
	       05  W15-CPI    PIC  9(02).
	       05  W15-COLS   PIC  9(04).
	       05  W15-DETAIL PIC  X(136).

				STATEMENT LAYOUT
ЩЭЭЭЭбЭЭЭбЭЭЭЭЭЭЭЭЭ1ЭЭЭЭЭЭЭЭЭ2ЭЭЭЭЭЭЭЭЭ3ЭЭЭЭЭЭЭЭЭ4ЭЭЭЭЭЭЭЭЭ5ЭЭЭЭЭЭЭЭЭ6ЭЭЭЭЭЭЭЭЭ7ЭЭЭЭЭЭЭЭЭ8ЭЭЭЭЭЭЭЭЭ9ЭЭЭЭЭЭЭЭ10ЭЭЭЭЭЭЭЭ11ЭЭЭЭЭЭЭЭ12ЭЭЭЭЭЭЭЭ13ЭЭЭЭЭЭЛ
КLineГCPIГ1234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456К
ЬЭЭЭЭиЭЭЭиЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЙ
К  1 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К  2 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К  3 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К  4 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К  5 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К  6 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К  7 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К  8 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К  9 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 10 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 11 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 12 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 13 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 14 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 15 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 16 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 17 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 18 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 19 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 20 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 21 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 22 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 23 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 24 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 25 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 26 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 27 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 28 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 29 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 30 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 31 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 32 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 33 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 34 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 35 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 36 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 37 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 38 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 39 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 40 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 41 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 42 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 43 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 44 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 45 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 46 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 47 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 48 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 49 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 50 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 51 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 52 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 53 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 54 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 55 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 56 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 57 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 58 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 59 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 60 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 61 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 62 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 63 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 64 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 65 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
К 66 Г	 ГллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллллК
ШЭЭЭЭЯЭЭЭЯЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭЭМ
