      $set LINKCOUNT"576"
      ******************************************************************
      *                                                                *
      *   ******   ********  *******   **     **  ********  **	   **  *
      *  **    **     **     **	   **  ***   ***  **	    ***	   **  *
      *  **	      **     **	   **  ** * * **  **	    ** *   **  *
      *   ******      **     *******   **  *  **  *****	    **	*  **  *
      *        **     **     **	       **     **  **	    **	 * **  *
      *  **    **     **     **	       **     **  **	    **	  ***  *
      *   ******      **     **        **     **  *******   **	   **  *
      *                                                                *
      *     ENGLISH                                                    *
      *                                                                *
      *     S T O C K	M O D U L E   M E N U	P R O G R A M	       *
      *                                                                *
      *     VERSION 8.15.01 - August 2011			       *
      * 							       *
      ******************************************************************
      * 							       *
      *  Aug 2008	- New file (STKALT) - Stock alternate index    *
      * 		  included for lookups, using any word con-    *
      * 		  tained in the Stock description.	       *
      * 							       *
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		    VERSIONS OF THE APAC SYSTEM		       Ё
      *    фммммммммммммммммммммммммммммммммммммммммммммммммммммммммммм╣
      *    Ё While developing this system the requirements and budgets Ё
      *    Ё (originally this was a propriety package) for various     Ё
      *    Ё businesses necessitated that at least 4 separate systems  Ё
      *    Ё be produced. As the maintenance and amendments to the 4   Ё
      *    Ё different systems would require man hours that would not  Ё
      *    Ё enable me to do much development, it was decided to use   Ё
      *    Ё one system with the various requirements controlled by    Ё
      *    Ё the various menu programs using a version indicator. This Ё
      *    Ё indicator is located in the second record of the SYSTEM   Ё
      *    Ё file SEC-LEV, which is in the SEC-MODULES. This indicator Ё
      *    Ё together with all the other indicators in SEC-MODULES, is Ё
      *    Ё moved to WS0-MODULES in BUP000 or BUP001 and then passed  Ё
      *    Ё via the LINKAGE SECTION from program to program in the    Ё
      *    Ё LS0-MODULES group. The other indicators in this group are Ё
      *    Ё used to show which modules of the system are installed.   Ё
      *    фмммммммммммммммммммямммммммммммммммммммяммммммммммммммммммм╣
      *    Ё	SYSTEM FILE    Ё      CHAIN.WS	   Ё	 CHAIN.LS      Ё
      *    цдддддддддддддддддддедддддддддддддддддддеддддддддддддддддддд╢
      *    Ё03	SEC-MODULES.   Ё03  WS0-MODULES.   Ё03 LS0-MODULES.    Ё
      *    Ё  05  SEC-DTP 9(01)Ё  05  WS0-DTP 9(01)Ё  05  LS0-DTP 9(01)Ё
      *    Ё  05  SEC-STP 9(01)Ё  05  WS0-STP 9(01)Ё  05  LS0-STP 9(01)Ё
      *    Ё  05  SEC-HPD 9(01)Ё  05  WS0-HPD 9(01)Ё  05  LS0-HPD 9(01)Ё
      *    Ё  05  SEC-CRP 9(01)Ё  05  WS0-CRP 9(01)Ё  05  LS0-CRP 9(01)Ё
      *    Ё  05  SEC-GLP 9(01)Ё  05  WS0-GLP 9(01)Ё  05  LS0-GLP 9(01)Ё
      *    Ё  05  SEC-POS 9(01)Ё  05  WS0-POS 9(01)Ё  05  LS0-POS 9(01)Ё
      *    Ё  05  SEC-JCP 9(01)Ё  05  WS0-JCP 9(01)Ё  05  LS0-JCP 9(01)Ё
      *    Ё  05  SEC-VHP 9(01)Ё  05  WS0-VHP 9(01)Ё  05  LS0-VHP 9(01)Ё
      *    Ё  05  SEC-WAG 9(01)Ё  05  WS0-WAG 9(01)Ё  05  LS0-WAG 9(01)Ё
      *    Ё  05  SEC-SAL 9(01)Ё  05  WS0-SAL 9(01)Ё  05  LS0-SAL 9(01)Ё
      *    Ё  05  SEC-LEV 9(01)Ё  05  WS0-LEV 9(01)Ё  05  LS0-LEV 9(01)Ё
      *    Ё  05  SEC-WHS 9(01)Ё  05  WS0-WHS 9(01)Ё  05  LS0-WHS 9(01)Ё
      *    Ё  05  SEC-RTE 9(01)Ё  05  WS0-RTE 9(01)Ё  05  LS0-RTE 9(01)Ё
      *    Ё  05  FILLER  X(07)Ё  05  FILLER  X(07)Ё  05  FILLER  X(07)Ё
      *    юдддддддддддддддддддадддддддддддддддддддаддддддддддддддддддды
      *
000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID.     STPMENU.
000030 AUTHOR.         J W LEMMON (APAC).
000040 DATE-WRITTEN.   JANUARY 1983.

		   COPYRIGHT NOTICE: COPYRIGHT (C) 1983 - 2010
				     by James William Lemmon.
				       (Id No. 4412165050082).

		   All rights reserved.

		   e-mail jwlemmon@gmail.com.

000050 SECURITY.
		   This program is free software; you can redistribute
		   it and/or modify it under the terms of the GNU General
		   Public License as published by the Free Software
		   Foundation; either version 2 of the License, or (at
		   your option) any later version.

		   This program is distributed in the hope that it will
		   be useful, but WITHOUT ANY WARRANTY; without even the
		   implied warranty of MERCHANTABILITY or FITNESS FOR A
		   PARTICULAR PURPOSE.	See the GNU General Public License
		   for more details.

		   You should have received a copy of the GNU General
		   Public License along with this program; if not, write
		   to the Free Software Foundation, Inc., 59 Temple Place
		   - Suite 330, Boston, MA 02111-1307, USA.

000050 ENVIRONMENT DIVISION.
000060 CONFIGURATION SECTION.
000070 SPECIAL-NAMES.  
000080                 CURSOR IS CSTART
000090		       CONSOLE IS CRT
		       CRT STATUS IS KEY-STATUS.
000100 INPUT-OUTPUT SECTION.
000110 FILE-CONTROL.

       COPY APACFIDS.SL.

       COPY CARDEX.SL.

       COPY CONTROL.SL.

       COPY CREDIT.SL.

       COPY LEDTRF.SL.

000210 COPY PARAM.SL.

       COPY PORDER.SL.

       COPY PURDEX.SL.

000200 COPY SPARTS.SL.

       COPY STKALT.SL.

       COPY STKDEX.SL.

000140 COPY STKMEM.SL.

000140 COPY STOCK.SL.

000140 COPY WARHSE.SL.

000140 COPY WSTOCK.SL.

      /
000330 DATA DIVISION.
000340 FILE SECTION.

       COPY APACFIDS.FDE.

       COPY CARDEX.FDE.

000360 COPY CONTROL.FDE.

000160 COPY CREDIT.FDE.

       COPY LEDTRF.FDE.

000440 COPY PARAM.FDE.

       COPY PORDER.FDE.

       COPY PURDEX.FDE.

000360 COPY SPARTS.FDE.

       COPY STKALT.FDE.

       COPY STKDEX.FDE.

000140 COPY STKMEM.FDE.

000300 COPY STOCK.FDE.

000300 COPY WARHSE.FDE.

000300 COPY WSTOCK.FDE.

      /
000560 WORKING-STORAGE SECTION.
       77  WS-CHECK	   PIC	X(18)	 VALUE
			   "aeWlimemnomLalismJ".
000610 77  WS-S1	   PIC	9(04)	 COMP-5.
000620 77  WS-S2           PIC  9(04)    COMP-5.
000630 77  WS-S3           PIC  9(04)    COMP-5.
000640 77  WS-S4           PIC  9(04)    COMP-5.
000820 77  WS-NETKEY	   PIC	9(04)	 COMP-5.
000750 77  WS-PARKEY       PIC  9(04)    COMP-5.
       77  WS-TEMP-LIN	   PIC	9(02)	 COMP-5.
       77  WS-OPTION	   PIC	X(01).
       77  WS-REOPEN	   PIC	X(01) VALUE SPACE.
002270 77  WS-PASSWORD	   PIC	X(08).
002280 77  WS-PASS	   PIC	X(08).
       77  PRG-NAME	   PIC	X(12) VALUE SPACES.
       77  TODAY-DDMMYY	   PIC	9(08) COMP-5.

001350 01  WS-CRT-LINES.
001380	   03  WS-TOP-LNE2.
001390	       05  WS-TCR   PIC  X(80) VALUE "зддддддддддддддддддддддддд
      -        "ддддддддддддддддддддддддддддддддддддддддддддддддддддд©".
001400	   03  WS-TP-LINE2 REDEFINES WS-TOP-LNE2.
001410         05  FILLER      PIC  X(01).
001420         05  WS-TOP-COMP PIC  X(40).
001430	       05  FILLER      PIC  X(23).
	       05  WS-WRKHD    PIC  X(11).
001430	       05  FILLER      PIC  X(01).
	       05  WS-WRKST    PIC  X(03).
001430	       05  FILLER      PIC  X(01).
001460	   03  WS-MID-LNE2.
	       05  FILLER      PIC  X(01) VALUE "Ё".
	       05  WS-BLNK78   PIC  X(78) VALUE ALL "╟".
	       05  FILLER      PIC  X(01) VALUE "Ё".

001840 COPY WS.WS.

000290 01  WS-PARID.
000020	   03  WS-SYS-ID       PIC  X(03).

002040 01  W02-FID.

       COPY APACFIDS.ID.

       COPY CARDEX.ID.

002060 COPY CONTROL.ID.

000160 COPY CREDIT.ID.

       COPY LEDTRF.ID.

       COPY PARAM.ID.

       COPY PORDER.ID.

       COPY PURDEX.ID.

002200 COPY SPARTS.ID.

       COPY STKDEX.ID.

       COPY STKALT.ID.

000140 COPY STKMEM.ID.

002220 COPY STOCK.ID.

002220 COPY WARHSE.ID.

002220 COPY WSTOCK.ID.

       01  BLOCK-DETAIL1.
	   03  ORIGINAL-VID1.
	       05  ORIGINAL-CHAR1 PIC  X(01) OCCURS 80.
	   03  REVERSE-VID1.
	       05  REVERSE-CHAR1  PIC  X(01) OCCURS 80.

       01  SHADOW-DETAIL1.
	   03  SHAD1-ROW       PIC  9(02) COMP-X.
	   03  SHAD1-COL       PIC  9(02) COMP-X.
	   03  SHAD1-LINES     PIC  9(02) COMP-X.
	   03  SHAD1-WIDTH     PIC  9(02) COMP-X.
	   03  SHAD1-CHAR      PIC  X(01).

       01  CRT-DETAIL1.
	   03  TOP-ROW1        PIC  9(02) COMP-X.
	   03  BOTTOM-ROW1     PIC  9(02) COMP-X.
	   03  STRING-LENGTH1  PIC  9(04) COMP-X.
	   03  SCREEN-POSITION1.
	       05  SCREEN-LIN1 PIC  9(02) COMP-X.
	       05  SCREEN-COL1 PIC  9(02) COMP-X.

       01  BLOCK-DETAIL2.
	   03  ORIGINAL-VID2.
	       05  ORIGINAL-CHAR2 PIC  X(01) OCCURS 80.
	   03  REVERSE-VID2.
	       05  REVERSE-CHAR2  PIC  X(01) OCCURS 80.

       01  SHADOW-DETAIL2.
	   03  SHAD2-ROW       PIC  9(02) COMP-X.
	   03  SHAD2-COL       PIC  9(02) COMP-X.
	   03  SHAD2-LINES     PIC  9(02) COMP-X.
	   03  SHAD2-WIDTH     PIC  9(02) COMP-X.
	   03  SHAD2-CHAR      PIC  X(01).

       01  CRT-DETAIL2.
	   03  TOP-ROW2        PIC  9(02) COMP-X.
	   03  BOTTOM-ROW2     PIC  9(02) COMP-X.
	   03  STRING-LENGTH2  PIC  9(04) COMP-X.
	   03  SCREEN-POSITION2.
	       05  SCREEN-LIN2 PIC  9(02) COMP-X.
	       05  SCREEN-COL2 PIC  9(02) COMP-X.

       COPY W40.WS.

       COPY FUNCTION.WS.

004540 COPY W50.WS.

       LINKAGE SECTION.

       COPY CHAIN.LS.

      /
000750 SCREEN SECTION.

       COPY BLANK.CRT.

       01  MENU-INSTRUCT.
	   03  LINE 25 COLUMN  2 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 1
				 VALUE "Use ".
	   03	       COLUMN  6 HIGHLIGHT
				 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 6
				 VALUE "".
	   03	       COLUMN  7 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 1
				 VALUE " or ".
	   03	       COLUMN 11 HIGHLIGHT
				 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 6
				 VALUE "".
	   03	       COLUMN 12 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 1
				 VALUE " to point to an item, and ".
	   03	       COLUMN 38 HIGHLIGHT
				 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 6
				 VALUE "<Enter>".
	   03	       COLUMN 45 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 1
				 VALUE " to Select ".
	   03	       COLUMN 56 HIGHLIGHT
				 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 6
				 VALUE "<Esc>".
	   03	       COLUMN 61 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 1
				 VALUE " to Exit".

       01  S01.
001450	   03  LINE  2 COLUMN 31 BACKGROUND-COLOR 1
				 FOREGROUND-COLOR 7 HIGHLIGHT
001460				 VALUE "STOCK CONTROL MODULE".
       01  S02.
	   03  LINE  4 COLUMN  7 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 2 HIGHLIGHT
				 VALUE "зддддддддддддддддддд".
	   03	       COLUMN 27 BACKGROUND-COLOR 2 FOREGROUND-COLOR 0
				 VALUE "©".
	   03  LINE  5 COLUMN  7 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 2 HIGHLIGHT
				 VALUE "Ё  ".
	   03	       COLUMN 10 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "STOCK PROGRAMS".
	   03	       COLUMN 24 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 0
				 VALUE "   Ё".
	   03  LINE  6 COLUMN  7 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 2 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN  9 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "1".
	   03	       COLUMN 10 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 0
				 VALUE " Maintenance	 Ё".
001470	   03  LINE  7 COLUMN  7 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 2 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN  9 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "2".
	   03	       COLUMN 10 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 0
				 VALUE " Reports    	 Ё".
001570	   03  LINE  8 COLUMN  7 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 2 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN  9 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "3".
	   03	       COLUMN 10 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 0
				 VALUE " Export Options  Ё".
001570	   03  LINE  9 COLUMN  7 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 2 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN  9 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "4".
	   03	       COLUMN 10 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 0
				 VALUE " Enquiries       Ё".
001570	   03  LINE 10 COLUMN  7 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 2 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN  9 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "5".
	   03	       COLUMN 10 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 0
				 VALUE " Login/Logout    Ё".
001570	   03  LINE 11 COLUMN  7 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 2 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN  9 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "6".
	   03	       COLUMN 10 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 0
				 VALUE " Enquiries (Ord) Ё".
001570	   03  LINE 12 COLUMN  7 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 2 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN  9 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "7".
	   03	       COLUMN 10 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 0
				 VALUE " Sales Tracking  Ё".
001570	   03  LINE 13 COLUMN  7 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 2 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN  9 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "8".
	   03	       COLUMN 10 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 0
				 VALUE " Purch. Tracking Ё".
001570	   03  LINE 14 COLUMN  7 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 2 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN  9 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "A".
	   03	       COLUMN 10 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 0
				 VALUE " Adjust. TrackingЁ".
001570	   03  LINE 15 COLUMN  7 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 2 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN  9 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "B".
	   03	       COLUMN 10 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 0
				 VALUE " Price Labels    Ё".
001570	   03  LINE 16 COLUMN  7 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 2 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN  9 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "C".
	   03	       COLUMN 10 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 0
				 VALUE " Barcode Labels  Ё".
001570	   03  LINE 17 COLUMN  7 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 2 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN  9 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "D".
	   03	       COLUMN 10 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 0
				 VALUE " Barcode System  Ё".
001500	   03  LINE 18 COLUMN  7 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 2 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN  9 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "E".
	   03	       COLUMN 10 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 0
				 VALUE " Stock Options   Ё".
001500	   03  LINE 19 COLUMN  7 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 2 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN  9 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "F".
	   03	       COLUMN 10 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 0
				 VALUE " Promotions/Spec.Ё".
001500	   03  LINE 20 COLUMN  7 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 2 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN  9 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "G".
	   03	       COLUMN 10 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 0
				 VALUE " Utilities       Ё".
001500	   03  LINE 21 COLUMN  7 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 2 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN  9 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "0".
	   03	       COLUMN 10 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 0
				 VALUE " Exit	         Ё".
	   03  LINE 22 COLUMN  7 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 2 HIGHLIGHT
				 VALUE "ю".
	   03	       COLUMN  8 BACKGROUND-COLOR 2 FOREGROUND-COLOR 0
				 VALUE "ддддддддддддддддддды".

       01  S03.
	   03  LINE  6 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "зддддддддддддддддддддддд".
	   03	       COLUMN 50 BACKGROUND-COLOR 3 FOREGROUND-COLOR 0
				 VALUE "©".
	   03  LINE  7 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "Ё   ".
	   03	       COLUMN 30 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "STOCK MAINTENANCE".
	   03	       COLUMN 47 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE "   Ё".
	   03  LINE  8 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "1".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Record Maintenance  Ё".
001470	   03  LINE  9 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "2".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Price/Quant Adjust  Ё".
001570	   03  LINE 10 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "3".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Production Routines Ё".
001570	   03  LINE 11 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "4".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Month-End Routine   Ё".
001570	   03  LINE 12 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "5".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Enquiries           Ё".
001570	   03  LINE 13 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "6".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Enquiries (Orders)  Ё".
001570	   03  LINE 14 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "7".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Descript/Price NamesЁ".
001570	   03  LINE 15 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "8".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " W/House Maintenance Ё".
001570	   03  LINE 16 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "0".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Exit	             Ё".
	   03  LINE 17 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "ю".
	   03	       COLUMN 27 BACKGROUND-COLOR 3 FOREGROUND-COLOR 0
				 VALUE "ддддддддддддддддддддддды".

       01  S04.
	   03  LINE  8 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "зддддддддддддддддддддддд".
	   03	       COLUMN 72 BACKGROUND-COLOR 7 FOREGROUND-COLOR 0
				 VALUE "©".
	   03  LINE  9 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё  ".
	   03	       COLUMN 51 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "RECORD MAINTENANCE".
	   03	       COLUMN 69 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "   Ё".
	   03  LINE 10 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "1".
	   03	       COLUMN 51 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Create New Record   Ё".
001470	   03  LINE 11 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "2".
	   03	       COLUMN 51 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Amend Existing Rec. Ё".
001570	   03  LINE 12 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "3".
	   03	       COLUMN 51 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Change Item Code    Ё".
001570	   03  LINE 13 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "4".
	   03	       COLUMN 51 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Delete Stock Record Ё".
001570	   03  LINE 14 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "5".
	   03	       COLUMN 51 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Flag Redundant Item Ё".
001470	   03  LINE 15 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "6".
	   03	       COLUMN 51 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Amend Supplier Code Ё".
001570	   03  LINE 16 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "7".
	   03	       COLUMN 51 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Enquiries           Ё".
001570	   03  LINE 17 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "0".
	   03	       COLUMN 51 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Exit	             Ё".
	   03  LINE 18 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "ю".
	   03	       COLUMN 49 BACKGROUND-COLOR 7 FOREGROUND-COLOR 0
				 VALUE "ддддддддддддддддддддддды".

       01  S05.
	   03  LINE  8 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "зддддддддддддддддддддддд".
	   03	       COLUMN 72 BACKGROUND-COLOR 7 FOREGROUND-COLOR 0
				 VALUE "©".
	   03  LINE  9 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "PRICE/QUANT ADJUSTMENTS".
	   03	       COLUMN 72 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "Ё".
	   03  LINE 10 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "1".
	   03	       COLUMN 51 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Price Changes       Ё".
001470	   03  LINE 11 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "2".
	   03	       COLUMN 51 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Price Changes (Dept)Ё".
001570	   03  LINE 12 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "3".
	   03	       COLUMN 51 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Price Adjust (Dept) Ё".
001570	   03  LINE 13 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "4".
	   03	       COLUMN 51 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Stock Quantities    Ё".
001570	   03  LINE 14 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "5".
	   03	       COLUMN 51 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Quantities per Dept.Ё".
001570	   03  LINE 15 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "6".
	   03	       COLUMN 51 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Lead-Time/ReOrd Adj Ё".
001570	   03  LINE 16 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "7".
	   03	       COLUMN 51 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Enquiries           Ё".
001570	   03  LINE 17 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "8".
	   03	       COLUMN 51 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Adjust Quantities   Ё".
001570	   03  LINE 18 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "0".
	   03	       COLUMN 51 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Exit	             Ё".
	   03  LINE 19 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "ю".
	   03	       COLUMN 49 BACKGROUND-COLOR 7 FOREGROUND-COLOR 0
				 VALUE "ддддддддддддддддддддддды".

       01  S06.
	   03  LINE  8 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "зддддддддддддддддддддддд".
	   03	       COLUMN 72 BACKGROUND-COLOR 7 FOREGROUND-COLOR 0
				 VALUE "©".
	   03  LINE  9 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё  ".
	   03	       COLUMN 51 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "PRODUCTION ROUTINES".
	   03	       COLUMN 70 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "  Ё".
	   03  LINE 10 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "1".
	   03	       COLUMN 51 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Change to Produced  Ё".
001470	   03  LINE 11 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "2".
	   03	       COLUMN 51 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Recorded Details    Ё".
001570	   03  LINE 12 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "3".
	   03	       COLUMN 51 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Details - all Items Ё".
001570	   03  LINE 13 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "4".
	   03	       COLUMN 51 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Details - per Item  Ё".
001570	   03  LINE 14 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "5".
	   03	       COLUMN 51 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Update Prod Prices  Ё".
001570	   03  LINE 15 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "6".
	   03	       COLUMN 51 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Enquiries           Ё".
001570	   03  LINE 16 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "7".
	   03	       COLUMN 51 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Change to NOT Prod. Ё".
001570	   03  LINE 17 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "0".
	   03	       COLUMN 51 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Exit	             Ё".
	   03  LINE 18 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "ю".
	   03	       COLUMN 49 BACKGROUND-COLOR 7 FOREGROUND-COLOR 0
				 VALUE "ддддддддддддддддддддддды".

       01  S07.
	   03  LINE  6 COLUMN 26 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "зддддддддддддддддддддддд".
	   03	       COLUMN 50 BACKGROUND-COLOR 7 FOREGROUND-COLOR 0
				 VALUE "©".
	   03  LINE  7 COLUMN 26 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "      UTILITIES      ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Ё".
	   03  LINE  8 COLUMN 26 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "1".
	   03	       COLUMN 29 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Create ALT DESC Idx Ё".
001470	   03  LINE  9 COLUMN 26 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "2".
	   03	       COLUMN 29 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Clear Guarantees    Ё".
001570	   03  LINE 10 COLUMN 26 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "3".
	   03	       COLUMN 29 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Clear Quantities    Ё".
001570	   03  LINE 11 COLUMN 26 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "4".
	   03	       COLUMN 29 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Clr Quantities -DeptЁ".
001570	   03  LINE 12 COLUMN 26 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "5".
	   03	       COLUMN 29 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Delete Item Range   Ё".
001570	   03  LINE 13 COLUMN 26 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "6".
	   03	       COLUMN 29 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Price Label Code    Ё".
001570	   03  LINE 14 COLUMN 26 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "7".
	   03	       COLUMN 29 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " ReCalculate Prices  Ё".
001570	   03  LINE 15 COLUMN 26 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "8".
	   03	       COLUMN 29 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Enquiries           Ё".
001570	   03  LINE 16 COLUMN 26 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "A".
	   03	       COLUMN 29 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Fix Average Prices  Ё".
001570	   03  LINE 17 COLUMN 26 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "0".
	   03	       COLUMN 29 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Exit	             Ё".
	   03  LINE 18 COLUMN 26 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "ю".
	   03	       COLUMN 27 BACKGROUND-COLOR 7 FOREGROUND-COLOR 0
				 VALUE "ддддддддддддддддддддддды".

       01  S08.
	   03  LINE  5 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "зддддддддддддддддддддддд".
	   03	       COLUMN 50 BACKGROUND-COLOR 3 FOREGROUND-COLOR 0
				 VALUE "©".
	   03  LINE  6 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "Ё    ".
	   03	       COLUMN 31 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "STOCK REPORTING".
	   03	       COLUMN 46 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE "    Ё".
	   03  LINE  7 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "1".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Price Lists         Ё".
001470	   03  LINE  8 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "2".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Departmental Lists  Ё".
001570	   03  LINE  9 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "3".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " List - Item Code SeqЁ".
001570	   03  LINE 10 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "4".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Stock Take List     Ё".
001570	   03  LINE 11 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "5".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Movement Report     Ё".
001570	   03  LINE 12 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "6".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " LowLevels / ReOrder Ё".
001570	   03  LINE 13 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "7".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Bill of Quantities  Ё".
001570	   03  LINE 14 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "8".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Quantity/Price List Ё".
001570	   03  LINE 15 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "A".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Price Labels        Ё".
001570	   03  LINE 16 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "B".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Slow Moving Stock   Ё".
001570	   03  LINE 17 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "C".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Exceptions          Ё".
001570	   03  LINE 18 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "D".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Redundant Stock     Ё".
001570	   03  LINE 19 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "E".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Stock per Supplier  Ё".
001570	   03  LINE 20 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "F".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Price Catalogue     Ё".
001570	   03  LINE 21 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "0".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Exit	             Ё".
	   03  LINE 22 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "ю".
	   03	       COLUMN 27 BACKGROUND-COLOR 3 FOREGROUND-COLOR 0
				 VALUE "ддддддддддддддддддддддды".

       01  S09.
	   03  LINE  6 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "зддддддддддддддддддддддд".
	   03	       COLUMN 50 BACKGROUND-COLOR 3 FOREGROUND-COLOR 0
				 VALUE "©".
	   03  LINE  7 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "Ё  ".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "STOCK EXPORT/IMPORT".
	   03	       COLUMN 48 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE "  Ё".
	   03  LINE  8 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "1".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Transfers In        Ё".
001470	   03  LINE  9 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "2".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Transfers Out       Ё".
001570	   03  LINE 10 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "3".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Prices - Branch (In)Ё".
001570	   03  LINE 11 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "4".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Prices - Branch(Out)Ё".
001570	   03  LINE 12 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "5".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Export Options      Ё".
001570	   03  LINE 13 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "6".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Import Options      Ё".
001570	   03  LINE 14 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "0".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Exit	             Ё".
	   03  LINE 15 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "ю".
	   03	       COLUMN 27 BACKGROUND-COLOR 3 FOREGROUND-COLOR 0
				 VALUE "ддддддддддддддддддддддды".

       01  S10.
	   03  LINE  8 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "зддддддддддддддддддддддд".
	   03	       COLUMN 72 BACKGROUND-COLOR 7 FOREGROUND-COLOR 0
				 VALUE "©".
	   03  LINE  9 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "  WAREHOUSE ROUTINES".
	   03	       COLUMN 69 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "   Ё".
	   03  LINE 10 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "1".
	   03	       COLUMN 51 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Add a new Location  Ё".
001470	   03  LINE 11 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "2".
	   03	       COLUMN 51 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Amend a Location    Ё".
001570	   03  LINE 12 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "3".
	   03	       COLUMN 51 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Delete a Location   Ё".
001570	   03  LINE 13 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "4".
	   03	       COLUMN 51 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Stock Transfers     Ё".
001570	   03  LINE 14 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "5".
	   03	       COLUMN 51 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Add Stock Records   Ё".
001570	   03  LINE 15 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "6".
	   03	       COLUMN 51 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Location Report     Ё".
001570	   03  LINE 16 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "7".
	   03	       COLUMN 51 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Enquiries           Ё".
001570	   03  LINE 17 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "Ё ".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "0".
	   03	       COLUMN 51 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Exit	             Ё".
	   03  LINE 18 COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "ю".
	   03	       COLUMN 49 BACKGROUND-COLOR 7 FOREGROUND-COLOR 0
				 VALUE "ддддддддддддддддддддддды".

       COPY ERROR.CRT.

      /
001230 PROCEDURE DIVISION
		 USING LS-PARID LS-USER-ID LS0-PROGRAMS LS0-SECURITY.
       AA000	       SECTION.
       AA00.
	     PERFORM ZA000-INIT.
	     DISPLAY CLR-L1-2.
	     DISPLAY S01.
003240	   IF LS0-STP NOT = 2
	       MOVE "Not Installed"
				 TO WS-ERR-STRING
003260	       PERFORM ERROR-MESSAGE
	   ELSE
003240	   IF LS0-STOCK = "N"
	       MOVE "Not Authorised"
				 TO WS-ERR-STRING
003260	       PERFORM ERROR-MESSAGE
	   ELSE
	       PERFORM BA000.
	   IF MOUSE-ATTACHED = "Y"
	       MOVE 66		 TO MOUSE-FUNC
	       MOVE 0		 TO MOUSE-PARAM
	       CALL X"AF" USING MOUSE-FUNC
				MOUSE-PARAM.
	     CLOSE CARDEX
		   CREDIT
		   LEDTRF
		   PORDER
		   PURDEX
		   SPARTS
		   STKALT
		   STKDEX
		   STKMEM
		   STOCK
		   WARHSE
		   WSTOCK.
013140 AA99.
013150       EXIT PROGRAM.

       AA100	       SECTION.
       AA101.
	   IF MOUSE-ATTACHED = "Y"
	       MOVE 66		 TO MOUSE-FUNC
	       MOVE 0		 TO MOUSE-PARAM
	       CALL X"AF" USING MOUSE-FUNC
				MOUSE-PARAM.
	     PERFORM SAVE-SCREEN-3.
	     CALL PRG-NAME
		  USING LS-PARID LS-USER-ID LS0-PROGRAMS LS0-SECURITY
		  ON EXCEPTION
		      GO TO AA110
	     END-CALL.
	     CANCEL PRG-NAME.

       AA105.
	     PERFORM RESTORE-SCREEN-3.
	   IF MOUSE-ATTACHED = "Y"
	       MOVE 66		 TO MOUSE-FUNC
	       MOVE 1		 TO MOUSE-PARAM
	       CALL X"AF" USING MOUSE-FUNC
				MOUSE-PARAM.
	     GO TO AA199.
       AA110.
	     MOVE SPACE 	 TO WS-ERR-MES.
	     STRING "Program- " DELIMITED SIZE
		     PRG-NAME DELIMITED " "
		     " not on disk, press ANY key"
		     DELIMITED SIZE
		     INTO WS-ERR-MES.
	     MOVE W43-SCREEN	 TO W43-SCREEN2.
	     MOVE W42-ATTRIB	 TO W42-ATTRIB2.
	     PERFORM ERROR-LENGTH THRU ERROR-EXIT.
	     MOVE W43-SCREEN2	 TO W43-SCREEN.
	     MOVE W42-ATTRIB2	 TO W42-ATTRIB.
	     GO TO AA105.

       AA199.
	     EXIT.

      /    *************************************************************
      *    ****    ROUTINES TO HANDLE VARIOUS FUNCTIONS FOR THE
      * 	   S C R E E N ,   K E Y B O A R D   &	 M O U S E
      *    *************************************************************
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё	   SAVE-SCREEN /-2/-3  and  RESTORE-SCREEN /-2/-3      Ё
      *    фммммммммммммммммммммммммммммммммммммммммммммммммммммммммммм╣
      *    Ё			  SCREEN-SHADOW 		       Ё
      *    цддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд╢
      *    Ё To routine is used to display a shadow down the right and Ё
      *    Ё along the bottom of a pop-up box. The parameters that are Ё
      *    Ё required:						       Ё
      *	   Ё	       SHADE-ROW   - Top line of the box + 1.	       Ё
      *	   Ё	       SHADE-COL   - Left line of box + 2.	       Ё
      *	   Ё	       SHADE-WIDTH - Width of the box - 2.	       Ё
      *	   Ё	       SHADE-LINES - Hight of box - 1.		       Ё
      *    фммммммммммммммммммммммммммммммммммммммммммммммммммммммммммм╣
      *    Ё			  ERROR-MESSAGE 		       Ё
      *    цддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд╢
      *    Ё To display an error message with " - Press ANY key" at    Ё
      *    Ё the end; use PERFORM ERROR-MESSAGE.		       Ё
      *    Ё							       Ё
      *    Ё To display just the error message; use PERFORM	       Ё
      *    Ё ERROR-LENGTH THRU ERROR-EXIT.			       Ё
      *    Ё							       Ё
      *    Ё To display the error message higher or lower (default is  Ё
      *    Ё line 13) firstly use PERFORM ERROR-SETUP THRU ERROR-POS   Ё
      *    Ё or PERFORM ERROR-LENGTH THRU ERROR-POS. Move the line     Ё
      *    Ё number to be used to SLIN and then PERFORM ERROR-DISPLAY  Ё
      *    Ё THRU ERROR-EXIT.					       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды

       COPY FUNCTION.SCR.

      /    *************************************************************
      *    ****   T H I S   R O U T I N E   I S   U S E D   T O
      * 	  D I S P L A Y   E R R O R   M E S S A G E S
      *    *************************************************************
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			  ERROR-MESSAGE 		       Ё
      *    цддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд╢
      *    Ё To display an error message with " - Press ANY key" at    Ё
      *    Ё the end; use PERFORM ERROR-MESSAGE.		       Ё
      *    Ё							       Ё
      *    Ё To display just the error message; use PERFORM	       Ё
      *    Ё ERROR-LENGTH THRU ERROR-EXIT.			       Ё
      *    Ё							       Ё
      *    Ё To display the error message higher or lower (default is  Ё
      *    Ё line 13) firstly use PERFORM ERROR-SETUP THRU ERROR-POS   Ё
      *    Ё or PERFORM ERROR-LENGTH THRU ERROR-POS. Move the line     Ё
      *    Ё number to be used to SLIN and then PERFORM ERROR-DISPLAY  Ё
      *    Ё THRU ERROR-EXIT.					       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды

       COPY ERROR.SC2.

      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё	      ERASE SCREEN FROM SPECIFIED LOCATION	       Ё
      *    цддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд╢
      *    Ё Uses CPOS (CLIN,CCOL) as starting position and increases  Ё
      *    Ё CLIN by 1 until CLIN reaches the line allocated to exit.  Ё
      *    Ё The screen is cleared with Column 1 and 80 containing "Ё" Ё
      *    Ё and columns 2 to 79 containing spaces.		       Ё
      *    Ё  eg.						       Ё
      *    Ё	  MOVE 0801	 TO CPOS.			       Ё
      *    Ё	  PERFORM ERASE-SCREEN-LOOP UNTIL CLIN > 19.	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды

011433 COPY CLEAR.CRT.

      *    *************************************************************
      *    ****    M A I N   S T O C K	 P R O G R A M	 M E N U    ****
      *    *************************************************************
       BA000	       SECTION 50.
       BA00.
	     MOVE 5		 TO SHADE-ROW.
	     MOVE 9		 TO SHADE-COL.
	     MOVE 19		 TO SHADE-WIDTH.
	     MOVE 18		 TO SHADE-LINES.
	     DISPLAY S02.
	   IF LS0-LEV < 2
	       DISPLAY ".(N/A)" AT 0821
			WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 2.
	   IF LS0-LEV < 3
	       DISPLAY "Enq. (Ord) (N/A)" AT 1111
			WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 2
	       DISPLAY ".(N/A)" AT 1221
			WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 2
	       DISPLAY ".N/A" AT 1323
			WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 2
	       DISPLAY "(N/A)" AT 1622
			WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 2
	       DISPLAY "(N/A)" AT 1722
			WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 2
	       DISPLAY ".N/A" AT 1823
			WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 2
	       DISPLAY " (N/A)" AT 1921
			WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 2.
	     DISPLAY MENU-INSTRUCT.
	     PERFORM SCREEN-SHADOW.

       BA02.
	     MOVE 5		 TO TOP-ROW.
	     MOVE 20		 TO BOTTOM-ROW.
	     MOVE 4		 TO SCREEN-LIN.
	     MOVE 9		 TO SCREEN-COL.
	     MOVE 17		 TO STRING-LENGTH.
	     PERFORM SAVE-ATTR.

       BA05.
	     CALL X"AF" USING GET-SINGLE-CHAR, KEY-STATUS.

       BA10.
	   IF ADIS-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN UP-KEY	 PERFORM MOVE-BLOCK-UP
		 WHEN DOWN-KEY	 PERFORM MOVE-BLOCK-DOWN
		 WHEN MOUSE-KEY  PERFORM POSITION-MOUSE
				 IF MOUSE-ENTER = "Y"
				     MOVE "N"	 TO MOUSE-ENTER
				     GO TO BA15
				 END-IF
				 IF MOUSE-Y = 24
				     IF MOUSE-X = 5
					 MOVE 5  TO KEY-CODE-1
					 GO TO BA10
				     ELSE
				     IF MOUSE-X = 10
					 MOVE 6  TO KEY-CODE-1
					 GO TO BA10
				     ELSE
				     IF MOUSE-X > 36 AND < 44
					 MOVE 0  TO KEY-CODE-1
					 GO TO BA10
				     ELSE
				     IF MOUSE-X > 54 AND < 60
					 MOVE 0  TO KEY-CODE-1
					 MOVE 1  TO KEY-TYPE
					 GO TO BA10
				     END-IF
				 END-IF
		 WHEN ENTER-KEY  GO TO BA15
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO BA05
	   ELSE
	   IF USER-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN ESC-KEY
		     MOVE "0"	 TO WS-OPTION
		     GO TO BA18
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO BA05
	   ELSE
	   IF DATA-8BIT
	       MOVE KEY-CODE-1X  TO WS-OPTION
	       CALL "CBL_TOUPPER" USING WS-OPTION
				  BY VALUE WS-LENGTH
				  RETURNING WS-STATUS
	       IF (WS-OPTION < 0 OR > 8) AND
		  (WS-OPTION < "A" OR > "G")
		   CALL X"E5"
		   GO TO BA05
	       END-IF
	       GO TO BA16
	   ELSE
	       CALL X"E5"
	       GO TO BA05.

       BA15.
	   IF SCREEN-LIN < 5
	       CALL X"E5"
	       GO TO BA05
	   ELSE
	   IF SCREEN-LIN = 5
	       MOVE "1"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 6
	       MOVE "2"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 7
	       MOVE "3"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 8
	       MOVE "4"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 9
	       MOVE "5"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 10
	       MOVE "6"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 11
	       MOVE "7"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 12
	       MOVE "8"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 13
	       MOVE "A"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 14
	       MOVE "B"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 15
	       MOVE "C"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 16
	       MOVE "D"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 17
	       MOVE "E"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 18
	       MOVE "F"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 19
	       MOVE "G"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 20
	       MOVE "0"		 TO WS-OPTION.
	   GO TO BA18.

       BA16.
	     PERFORM CLEAR-BLOCK.
	   IF WS-OPTION = "0"
	       MOVE 20		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "1"
	       MOVE 5		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "2"
	       MOVE 6		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "3"
	       MOVE 7		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "4"
	       MOVE 8		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "5"
	       MOVE 9		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "6"
	       MOVE 10		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "7"
	       MOVE 11		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "8"
	       MOVE 12		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "A"
	       MOVE 13		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "B"
	       MOVE 14		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "C"
	       MOVE 15		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "D"
	       MOVE 16		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "E"
	       MOVE 17		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "F"
	       MOVE 18		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "G"
	       MOVE 19		 TO SCREEN-LIN.
	     PERFORM SAVE-ATTR.
	     PERFORM MARK-BLOCK.

       BA18.
	   IF WS-OPTION = "0"
	       MOVE "N" 	 TO LS-OK
	       GO TO BA999.
	     PERFORM SAVE-SCREEN.
	     MOVE BLOCK-DETAIL	 TO BLOCK-DETAIL1.
	     MOVE SHADOW-DETAIL  TO SHADOW-DETAIL1.
	     MOVE CRT-DETAIL	 TO CRT-DETAIL1.
	   IF WS-OPTION = "1"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			    Maintenance 		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       PERFORM CA000
	   ELSE
	   IF WS-OPTION = "2"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			      Reports			       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       PERFORM DA000
	   ELSE
	   IF WS-OPTION = "3"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			  Export Options		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       PERFORM EA000
	   ELSE
	   IF WS-OPTION = "4"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			     Enquiries			       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       PERFORM FA000
	   ELSE
	   IF WS-OPTION = "5"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			   Login/Logout 		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       PERFORM GA000
	   ELSE
	   IF WS-OPTION = "6"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			Enquiries (Orders)		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       PERFORM CG000
	   ELSE
	   IF WS-OPTION = "7"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			  Sales Tracking		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       PERFORM CH000
	   ELSE
	   IF WS-OPTION = "8"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			 Purchase Tracking		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       PERFORM CL000
	   ELSE
	   IF WS-OPTION = "A"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			Adjustment Tracking		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       PERFORM CP000
	   ELSE
	   IF WS-OPTION = "B"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			   Price Labels 		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       PERFORM CK000
	   ELSE
	   IF WS-OPTION = "C"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			  Barcode Labels		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       PERFORM CM000
	   ELSE
	   IF WS-OPTION = "D"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			  Barcode System		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       PERFORM CN000
	   ELSE
	   IF WS-OPTION = "E"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			   Stock Options		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       PERFORM CO000
	   ELSE
	   IF WS-OPTION = "F"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			Promotions/Specials		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       PERFORM CQ000
	   ELSE
	   IF WS-OPTION = "G"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			     Utilities			       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       PERFORM CR000.
	     PERFORM RESTORE-SCREEN.
	     MOVE BLOCK-DETAIL1  TO BLOCK-DETAIL.
	     MOVE SHADOW-DETAIL1 TO SHADOW-DETAIL.
	     MOVE CRT-DETAIL1	 TO CRT-DETAIL.
	   IF LS-OK = "Y"
	       DISPLAY "Logged In" AT 0302
			WITH FOREGROUND-COLOR 6 HIGHLIGHT BLINK
	   ELSE
	       DISPLAY "╟╟╟╟╟╟╟╟╟" AT 0302
			WITH FOREGROUND-COLOR 3
			     BACKGROUND-COLOR 1.
	     DISPLAY " " AT 2569 WITH BACKGROUND-COLOR 3
				      FOREGROUND-COLOR 1.
	     GO TO BA05.

       BA999.
	     EXIT.
      /    *************************************************************
      *    **** 	S T O C K   M A I N T E N A N C E	    ****
      *    *************************************************************
       CA000	       SECTION 50.
       CA00.
	   IF LS-DSKDRV = "L"
	       MOVE "Not available on Local drive"
				 TO WS-ERR-STRING
003260	       PERFORM ERROR-MESSAGE
	       GO TO CA999.
	     MOVE 7		 TO SHADE-ROW.
	     MOVE 28		 TO SHADE-COL.
	     MOVE 23		 TO SHADE-WIDTH.
	     MOVE 11		 TO SHADE-LINES.
	     DISPLAY S03.
	   IF LS0-LEV < 3
	       DISPLAY "Production (N/A)   " AT 1030
			WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 3
	       DISPLAY "Enq. (Orders) (N/A)" AT 1330
			WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 3
	       DISPLAY "Chg Prc Names (N/A)" AT 1430
			WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 3.
	   IF LS0-LEV < 4
	       DISPLAY "W/House Maint (N/A)" AT 1530
			WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 3.
	     DISPLAY MENU-INSTRUCT.
	     PERFORM SCREEN-SHADOW.
	     MOVE 7		 TO TOP-ROW.
	     MOVE 16		 TO BOTTOM-ROW.
	     MOVE 6		 TO SCREEN-LIN.
	     MOVE 28		 TO SCREEN-COL.
	     MOVE 21		 TO STRING-LENGTH.
	     PERFORM SAVE-ATTR.

       CA05.
	     CALL X"AF" USING GET-SINGLE-CHAR, KEY-STATUS.

       CA10.
	   IF ADIS-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN UP-KEY	 PERFORM MOVE-BLOCK-UP
		 WHEN DOWN-KEY	 PERFORM MOVE-BLOCK-DOWN
		 WHEN MOUSE-KEY  PERFORM POSITION-MOUSE
				 IF MOUSE-ENTER = "Y"
				     MOVE "N"	 TO MOUSE-ENTER
				     GO TO CA15
				 END-IF
				 IF MOUSE-Y = 24
				     IF MOUSE-X = 5
					 MOVE 5  TO KEY-CODE-1
					 GO TO CA10
				     ELSE
				     IF MOUSE-X = 10
					 MOVE 6  TO KEY-CODE-1
					 GO TO CA10
				     ELSE
				     IF MOUSE-X > 36 AND < 44
					 MOVE 0  TO KEY-CODE-1
					 GO TO CA10
				     ELSE
				     IF MOUSE-X > 54 AND < 60
					 MOVE 0  TO KEY-CODE-1
					 MOVE 1  TO KEY-TYPE
					 GO TO CA10
				     END-IF
				 END-IF
		 WHEN ENTER-KEY  GO TO CA15
		 WHEN OTHER PERFORM CA995
	       END-EVALUATE
	       GO TO CA05
	   ELSE
	   IF USER-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN ESC-KEY
		     MOVE "0"	 TO WS-OPTION
		     GO TO CA18
		 WHEN OTHER PERFORM CA995
	       END-EVALUATE
	       GO TO CA05
	   ELSE
	   IF DATA-8BIT
	       MOVE KEY-CODE-1X  TO WS-OPTION
	       IF WS-OPTION < 0 OR > 8
		   PERFORM CA995
		   GO TO CA05
	       END-IF
	       GO TO CA16
	   ELSE
	       PERFORM CA995
	       GO TO CA05.

       CA15.
	   IF SCREEN-LIN < 7
	       PERFORM CA995
	       GO TO CA05.
	     EVALUATE SCREEN-LIN
	       WHEN 7
		   MOVE "1"	 TO WS-OPTION
	       WHEN 8
		   MOVE "2"	 TO WS-OPTION
	       WHEN 9
		   MOVE "3"	 TO WS-OPTION
	       WHEN 10
		   MOVE "4"	 TO WS-OPTION
	       WHEN 11
		   MOVE "5"	 TO WS-OPTION
	       WHEN 12
		   MOVE "6"	 TO WS-OPTION
	       WHEN 13
		   MOVE "7"	 TO WS-OPTION
	       WHEN 14
		   MOVE "8"	 TO WS-OPTION
	       WHEN 15
		   MOVE "0"	 TO WS-OPTION
	       WHEN OTHER
		   PERFORM CA995
		   GO TO CA05
	     END-EVALUATE.
	   GO TO CA18.

       CA16.
	     PERFORM CLEAR-BLOCK.
	   IF WS-OPTION = 0
	       MOVE 15		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 1
	       MOVE 7		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 2
	       MOVE 8		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 3
	       MOVE 9		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 4
	       MOVE 10		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 5
	       MOVE 11		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 6
	       MOVE 12		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 7
	       MOVE 13		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 8
	       MOVE 14		 TO SCREEN-LIN.
	     PERFORM SAVE-ATTR.
	     PERFORM MARK-BLOCK.

       CA18.
	   IF WS-OPTION = "0"
	       GO TO CA999.
	     PERFORM SAVE-SCREEN-2.
	     MOVE BLOCK-DETAIL	 TO BLOCK-DETAIL2.
	     MOVE SHADOW-DETAIL	 TO SHADOW-DETAIL2.
	     MOVE CRT-DETAIL	 TO CRT-DETAIL2.
	   IF WS-OPTION = "1"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			Record Maintenance		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       PERFORM CB000
	   ELSE
	   IF WS-OPTION = "2"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			Price/Quant Adjust		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       PERFORM CC000
	   ELSE
	   IF WS-OPTION = "3"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			Production Routines		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       PERFORM CD000
	   ELSE
	   IF WS-OPTION = "4"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			     Month-End			       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       PERFORM CE000
	   ELSE
	   IF WS-OPTION = "5"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			     Enquiries			       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       PERFORM CF000
	   ELSE
	   IF WS-OPTION = "6"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			Enquiries (Orders)		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       PERFORM CG000
	   ELSE
	   IF WS-OPTION = "7"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		      Description/Price Names		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       PERFORM CI000
	   ELSE
	   IF WS-OPTION = "8"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		       Warehouse Maintenance		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       PERFORM CJ000.
	     PERFORM RESTORE-SCREEN-2.
	     MOVE BLOCK-DETAIL2	 TO BLOCK-DETAIL.
	     MOVE SHADOW-DETAIL2 TO SHADOW-DETAIL.
	     MOVE CRT-DETAIL2	 TO CRT-DETAIL.
	     GO TO CA05.
      *    *************************************************************
      *    **  S O U N D   B U Z Z E R	 F O R	 U S E R   E R R O R  **
      *    *************************************************************
       CA995.
	     CALL X"E5" CALL X"E5" CALL X"E5".
	     CALL X"E5" CALL X"E5" CALL X"E5".
	     CALL X"E5" CALL X"E5" CALL X"E5".

       CA999.
	     EXIT.
      /    *************************************************************
      *    **** 	R E C O R D   M A I N T E N A N C E	    ****
      *    *************************************************************
       CB000	       SECTION 50.
       CB00.
	     MOVE 9		 TO SHADE-ROW.
	     MOVE 50		 TO SHADE-COL.
	     MOVE 23		 TO SHADE-WIDTH.
	     MOVE 10		 TO SHADE-LINES.
	     DISPLAY S04.
	   IF LS0-LEV < 4
	       DISPLAY "N/A" AT 1269
			WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 7.
	   IF LS0-LEV < 3
	       DISPLAY "N/A " AT 1467
			WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 7.
	     DISPLAY MENU-INSTRUCT.
	     PERFORM SCREEN-SHADOW.
	     MOVE 9		 TO TOP-ROW.
	     MOVE 16		 TO BOTTOM-ROW.
	     MOVE 8		 TO SCREEN-LIN.
	     MOVE 50		 TO SCREEN-COL.
	     MOVE 21		 TO STRING-LENGTH.
	     PERFORM SAVE-ATTR.

       CB05.
	     CALL X"AF" USING GET-SINGLE-CHAR, KEY-STATUS.

       CB10.
	   IF ADIS-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN UP-KEY	 PERFORM MOVE-BLOCK-UP
		 WHEN DOWN-KEY	 PERFORM MOVE-BLOCK-DOWN
		 WHEN MOUSE-KEY  PERFORM POSITION-MOUSE
				 IF MOUSE-ENTER = "Y"
				     MOVE "N"	 TO MOUSE-ENTER
				     GO TO CB15
				 END-IF
				 IF MOUSE-Y = 24
				     IF MOUSE-X = 5
					 MOVE 5  TO KEY-CODE-1
					 GO TO CB10
				     ELSE
				     IF MOUSE-X = 10
					 MOVE 6  TO KEY-CODE-1
					 GO TO CB10
				     ELSE
				     IF MOUSE-X > 36 AND < 44
					 MOVE 0  TO KEY-CODE-1
					 GO TO CB10
				     ELSE
				     IF MOUSE-X > 54 AND < 60
					 MOVE 0  TO KEY-CODE-1
					 MOVE 1  TO KEY-TYPE
					 GO TO CB10
				     END-IF
				 END-IF
		 WHEN ENTER-KEY  GO TO CB15
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO CB05
	   ELSE
	   IF USER-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN ESC-KEY
		     MOVE "0"	 TO WS-OPTION
		     GO TO CB18
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO CB05
	   ELSE
	   IF DATA-8BIT
	       MOVE KEY-CODE-1X  TO WS-OPTION
	       IF WS-OPTION < 0 OR > 7
		   CALL X"E5"
		   GO TO CB05
	       END-IF
	       GO TO CB16
	   ELSE
	       CALL X"E5"
	       GO TO CB05.

       CB15.
	   IF SCREEN-LIN < 9
	       CALL X"E5"
	       GO TO CB05
	   ELSE
	   IF SCREEN-LIN = 9
	       MOVE "1"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 10
	       MOVE "2"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 11
	       MOVE "3"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 12
	       MOVE "4"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 13
	       MOVE "5"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 14
	       MOVE "6"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 15
	       MOVE "7"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 16
	       MOVE "0"		 TO WS-OPTION.
	   GO TO CB18.

       CB16.
	     PERFORM CLEAR-BLOCK.
	   IF WS-OPTION = 0
	       MOVE 16		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 1
	       MOVE 9		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 2
	       MOVE 10		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 3
	       MOVE 11		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 4
	       MOVE 12		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 5
	       MOVE 13		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 6
	       MOVE 14		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 7
	       MOVE 15		 TO SCREEN-LIN.
	     PERFORM SAVE-ATTR.
	     PERFORM MARK-BLOCK.

       CB18.
	     CALL "CBL_TOUPPER" USING WS-OPTION
				BY VALUE WS-LENGTH
				RETURNING WS-STATUS.
	   IF WS-OPTION = "0"
	       GO TO CB999.
	   IF WS-OPTION < 1 OR > 7
	       CALL X"E5"
	       GO TO CB05.
	   IF WS-OPTION = "1"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			 Create New Record		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "STP\STP001" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "2"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		       Amend Existing Record		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "STP\STP002" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "3"
	       IF LS0-LEV < 4
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		   Not available in this version	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "MNU\NOPMENU" TO PRG-NAME
	       ELSE
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			 Change Item Code		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "STP\STP003" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "4"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			Delete Stock Record		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "STP\STP004" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "5"
	       IF LS0-LEV < 3
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		   Not available in this version	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "MNU\NOPMENU" TO PRG-NAME
	       ELSE
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			Flag Redundant Item		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "STP\STP005" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "6"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			Amend Supplier Code		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "STP\STP006" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "7"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			     Enquiries			       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "STP\STPENQ" TO PRG-NAME.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.
	     GO TO CB05.

       CB999.
	     EXIT.
      /    *************************************************************
      *    *  P R I C E   &   Q U A N T I T Y	A D J U S T M E N T S  *
      *    *************************************************************
       CC000	       SECTION 50.
       CC00.
	     MOVE 9		 TO SHADE-ROW.
	     MOVE 50		 TO SHADE-COL.
	     MOVE 23		 TO SHADE-WIDTH.
	     MOVE 11		 TO SHADE-LINES.
	     DISPLAY S05.
	   IF LS0-LEV < 3
	       DISPLAY "Quant per Dept. N/A " AT 1452
			WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 7
	       DISPLAY "N/A" AT 1568
			WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 7.
	     DISPLAY MENU-INSTRUCT.
	     PERFORM SCREEN-SHADOW.
	     MOVE 9		 TO TOP-ROW.
	     MOVE 17		 TO BOTTOM-ROW.
	     MOVE 8		 TO SCREEN-LIN.
	     MOVE 50		 TO SCREEN-COL.
	     MOVE 21		 TO STRING-LENGTH.
	     PERFORM SAVE-ATTR.

       CC05.
	     CALL X"AF" USING GET-SINGLE-CHAR, KEY-STATUS.

       CC10.
	   IF ADIS-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN UP-KEY	 PERFORM MOVE-BLOCK-UP
		 WHEN DOWN-KEY	 PERFORM MOVE-BLOCK-DOWN
		 WHEN MOUSE-KEY  PERFORM POSITION-MOUSE
				 IF MOUSE-ENTER = "Y"
				     MOVE "N"	 TO MOUSE-ENTER
				     GO TO CC15
				 END-IF
				 IF MOUSE-Y = 24
				     IF MOUSE-X = 5
					 MOVE 5  TO KEY-CODE-1
					 GO TO CC10
				     ELSE
				     IF MOUSE-X = 10
					 MOVE 6  TO KEY-CODE-1
					 GO TO CC10
				     ELSE
				     IF MOUSE-X > 36 AND < 44
					 MOVE 0  TO KEY-CODE-1
					 GO TO CC10
				     ELSE
				     IF MOUSE-X > 54 AND < 60
					 MOVE 0  TO KEY-CODE-1
					 MOVE 1  TO KEY-TYPE
					 GO TO CC10
				     END-IF
				 END-IF
		 WHEN ENTER-KEY  GO TO CC15
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO CC05
	   ELSE
	   IF USER-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN ESC-KEY
		     MOVE "0"	 TO WS-OPTION
		     GO TO CC18
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO CC05
	   ELSE
	   IF DATA-8BIT
	       MOVE KEY-CODE-1X  TO WS-OPTION
	       IF WS-OPTION < 0 OR > 8
		   CALL X"E5"
		   GO TO CC05
	       END-IF
	       GO TO CC16
	   ELSE
	       CALL X"E5"
	       GO TO CC05.

       CC15.
	     EVALUATE SCREEN-LIN
	       WHEN 9
		   MOVE "1"	 TO WS-OPTION
	       WHEN 10
		   MOVE "2"	 TO WS-OPTION
	       WHEN 11
		   MOVE "3"	 TO WS-OPTION
	       WHEN 12
		   MOVE "4"	 TO WS-OPTION
	       WHEN 13
		   MOVE "5"	 TO WS-OPTION
	       WHEN 14
		   MOVE "6"	 TO WS-OPTION
	       WHEN 15
		   MOVE "7"	 TO WS-OPTION
	       WHEN 16
		   MOVE "8"	 TO WS-OPTION
	       WHEN 17
		   MOVE "0"	 TO WS-OPTION
	       WHEN OTHER
		   CALL X"E5" CALL X"E5" CALL X"E5"
		   GO TO CC05
	     END-EVALUATE.
	   GO TO CC18.

       CC16.
	     PERFORM CLEAR-BLOCK.
	     EVALUATE WS-OPTION
	       WHEN "0"
		   MOVE 17	 TO SCREEN-LIN
	       WHEN "1"
		   MOVE 9	 TO SCREEN-LIN
	       WHEN "2"
		   MOVE 10	 TO SCREEN-LIN
	       WHEN "3"
		   MOVE 11	 TO SCREEN-LIN
	       WHEN "4"
		   MOVE 12	 TO SCREEN-LIN
	       WHEN "5"
		   MOVE 13	 TO SCREEN-LIN
	       WHEN "6"
		   MOVE 14	 TO SCREEN-LIN
	       WHEN "7"
		   MOVE 15	 TO SCREEN-LIN
	       WHEN "8"
		   MOVE 16	 TO SCREEN-LIN
	     END-EVALUATE.
	     PERFORM SAVE-ATTR.
	     PERFORM MARK-BLOCK.

       CC18.
	     CALL "CBL_TOUPPER" USING WS-OPTION
				BY VALUE WS-LENGTH
				RETURNING WS-STATUS.
	     EVALUATE WS-OPTION
	       WHEN "0"
		   GO TO CC999
	       WHEN "1"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			   Price Changes		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "STP\STP011" TO PRG-NAME
	       WHEN "2"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		    Price Changes (Department)		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "STP\STP012" TO PRG-NAME
	       WHEN "3"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		     Price Adjust (Department)		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "STP\STP013" TO PRG-NAME
	       WHEN "4"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			 Stock Quantities		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "STP\STP014" TO PRG-NAME
	       WHEN "5"
		   IF LS0-LEV < 3
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		   Not available in this version	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		       MOVE "MNU\NOPMENU"  TO PRG-NAME
		   ELSE
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		     Quantities per Department		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		       MOVE "STP\STP015"   TO PRG-NAME
		   END-IF
	       WHEN "6"
		   IF LS0-LEV < 3
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		   Not available in this version	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		       MOVE "MNU\NOPMENU"  TO PRG-NAME
		   ELSE
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		  Adjust Lead-Time/ReOrder levels	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		       MOVE "STP\STP016"   TO PRG-NAME
		   END-IF
	       WHEN "7"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			     Enquiries			       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "STP\STPENQ" TO PRG-NAME
	       WHEN "8"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			 Adjust Quantities		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "STP\STP018" TO PRG-NAME.
	       WHEN OTHER
		   CALL X"E5" CALL X"E5" CALL X"E5"
		   GO TO CC05
	     END-EVALUATE.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.
	     GO TO CC05.

       CC999.
	     EXIT.
      /    *************************************************************
      *    **** 	P R O D U C T I O N   O P T I O N S	    ****
      *    *************************************************************
       CD000	       SECTION 50.
       CD00.
	   IF LS0-LEV < 3
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		   Not available in this version	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "MNU\NOPMENU"
				 TO PRG-NAME
	       PERFORM AA100
	       DISPLAY MENU-INSTRUCT
	       GO TO CD999.
	     MOVE 9		 TO SHADE-ROW.
	     MOVE 50		 TO SHADE-COL.
	     MOVE 23		 TO SHADE-WIDTH.
	     MOVE 10		 TO SHADE-LINES.
	     DISPLAY S06.
	     DISPLAY MENU-INSTRUCT.
	     PERFORM SCREEN-SHADOW.
	     MOVE 9		 TO TOP-ROW.
	     MOVE 16		 TO BOTTOM-ROW.
	     MOVE 8		 TO SCREEN-LIN.
	     MOVE 50		 TO SCREEN-COL.
	     MOVE 21		 TO STRING-LENGTH.
	     PERFORM SAVE-ATTR.

       CD05.
	     CALL X"AF" USING GET-SINGLE-CHAR, KEY-STATUS.

       CD10.
	   IF ADIS-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN UP-KEY	 PERFORM MOVE-BLOCK-UP
		 WHEN DOWN-KEY	 PERFORM MOVE-BLOCK-DOWN
		 WHEN MOUSE-KEY  PERFORM POSITION-MOUSE
				 IF MOUSE-ENTER = "Y"
				     MOVE "N"	 TO MOUSE-ENTER
				     GO TO CD15
				 END-IF
				 IF MOUSE-Y = 24
				     IF MOUSE-X = 5
					 MOVE 5  TO KEY-CODE-1
					 GO TO CD10
				     ELSE
				     IF MOUSE-X = 10
					 MOVE 6  TO KEY-CODE-1
					 GO TO CD10
				     ELSE
				     IF MOUSE-X > 36 AND < 44
					 MOVE 0  TO KEY-CODE-1
					 GO TO CD10
				     ELSE
				     IF MOUSE-X > 54 AND < 60
					 MOVE 0  TO KEY-CODE-1
					 MOVE 1  TO KEY-TYPE
					 GO TO CD10
				     END-IF
				 END-IF
		 WHEN ENTER-KEY  GO TO CD15
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO CD05
	   ELSE
	   IF USER-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN ESC-KEY
		     MOVE "0"	 TO WS-OPTION
		     GO TO CD18
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO CD05
	   ELSE
	   IF DATA-8BIT
	       MOVE KEY-CODE-1X  TO WS-OPTION
	       IF WS-OPTION < 0 OR > 7
		   CALL X"E5"
		   GO TO CD05
	       END-IF
	       GO TO CD16
	   ELSE
	       CALL X"E5"
	       GO TO CD05.

       CD15.
	   IF SCREEN-LIN < 9
	       CALL X"E5"
	       GO TO CD05
	   ELSE
	   IF SCREEN-LIN = 9
	       MOVE "1"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 10
	       MOVE "2"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 11
	       MOVE "3"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 12
	       MOVE "4"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 13
	       MOVE "5"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 14
	       MOVE "6"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 15
	       MOVE "7"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 16
	       MOVE "0"		 TO WS-OPTION.
	   GO TO CD18.

       CD16.
	     PERFORM CLEAR-BLOCK.
	   IF WS-OPTION = 0
	       MOVE 16		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 1
	       MOVE 9		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 2
	       MOVE 10		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 3
	       MOVE 11		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 4
	       MOVE 12		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 5
	       MOVE 13		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 6
	       MOVE 14		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 7
	       MOVE 15		 TO SCREEN-LIN.
	     PERFORM SAVE-ATTR.
	     PERFORM MARK-BLOCK.

       CD18.
	     CALL "CBL_TOUPPER" USING WS-OPTION
				BY VALUE WS-LENGTH
				RETURNING WS-STATUS.
	   IF WS-OPTION = "0"
	       GO TO CD999.
	   IF WS-OPTION < 1 OR > 7
	       CALL X"E5"
	       GO TO CD05.
	   IF WS-OPTION = "1"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			Change to Produced		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "STP\STP021" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "2"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		 Use Recorded Details (Template)	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "STP\STP022" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "3"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		   Key the Details - all Items		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "STP\STP023" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "4"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		  Key in the Details - per Item		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "STP\STP024" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "5"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		     Update Production Prices		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "STP\STP025" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "6"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			     Enquiries			       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "STP\STPENQ" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "7"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		      Change to NOT Produced		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "STP\STP026" TO PRG-NAME.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.
	     GO TO CD05.

       CD999.
	     EXIT.
      /    *************************************************************
      *    **** 	       U T I L I T I E S		    ****
      *    *************************************************************
       CE000	       SECTION 50.
       CE00.
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			 Month-end Routine		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	     MOVE "STP\STP091"	 TO PRG-NAME.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.

       CE999.
	     EXIT.
      /    *************************************************************
      *    **** 		E N Q U I R I E S		    ****
      *    *************************************************************
       CF000	       SECTION 50.
       CF00.
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			     Enquiries			       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	     MOVE "STP\STPENQ"	 TO PRG-NAME.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.

       CF999.
	     EXIT.
      /    *************************************************************
      *    ****        E N Q U I R I E S   ( O R D E R S )	    ****
      *    *************************************************************
       CG000	       SECTION 50.
       CG00.
	   IF LS-DSKDRV = "L"
	       MOVE "Not available on Local drive"
				 TO WS-ERR-STRING
003260	       PERFORM ERROR-MESSAGE
	       GO TO CG999.
	   IF LS0-LEV < 3
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		   Not available in this version	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "MNU\NOPMENU"
				 TO PRG-NAME
	       PERFORM AA100
	       DISPLAY MENU-INSTRUCT
	       GO TO CG999.
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			Enquiries (Orders)		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	     MOVE "STP\STPORD"	 TO PRG-NAME.
	     PERFORM AA100.
	     CLOSE CREDIT.
	     OPEN I-O CREDIT.
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		 Merge and Print Purchase Orders	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	     MOVE "STP\ORDPRN"	 TO PRG-NAME.
	     PERFORM AA100.
	     CLOSE CREDIT.
	     OPEN INPUT CREDIT.
	     DISPLAY MENU-INSTRUCT.

       CG999.
	     EXIT.
      /    *************************************************************
      *    **** 	   S A L E S   T R A C K I N G		    ****
      *    *************************************************************
       CH000	       SECTION 50.
       CH00.
	   IF LS0-LEV < 3
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		   Not available in this version	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "MNU\NOPMENU" TO PRG-NAME
	    ELSE
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			  Sales Tracking		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "STP\STPSAL"  TO PRG-NAME.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.

       CH999.
	     EXIT.
      /    *************************************************************
      *    ****    D E S C R I P T I O N / P R I C E   N A M E S    ****
      *    *************************************************************
       CI000	       SECTION 50.
       CI00.
	   IF LS0-LEV < 3
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		   Not available in this version	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "MNU\NOPMENU"
				 TO PRG-NAME
	   ELSE
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		      Description/Price Names		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "STP\STP017" TO PRG-NAME.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.

       CI999.
	     EXIT.
      /    *************************************************************
      *    **** 	W A R E	H O U S E   O P T I O N S	    ****
      *    *************************************************************
       CJ000	       SECTION 50.
       CJ00.
	   IF LS0-LEV < 4
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		   Not available in this version	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "MNU\NOPMENU"
				 TO PRG-NAME
	       PERFORM AA100
	       DISPLAY MENU-INSTRUCT
	       GO TO CJ999.
	     MOVE 9		 TO SHADE-ROW.
	     MOVE 50		 TO SHADE-COL.
	     MOVE 23		 TO SHADE-WIDTH.
	     MOVE 10		 TO SHADE-LINES.
	     DISPLAY S10.
	     DISPLAY MENU-INSTRUCT.
	     PERFORM SCREEN-SHADOW.
	     MOVE 9		 TO TOP-ROW.
	     MOVE 16		 TO BOTTOM-ROW.
	     MOVE 8		 TO SCREEN-LIN.
	     MOVE 50		 TO SCREEN-COL.
	     MOVE 21		 TO STRING-LENGTH.
	     PERFORM SAVE-ATTR.

       CJ05.
	     CALL X"AF" USING GET-SINGLE-CHAR, KEY-STATUS.

       CJ10.
	   IF ADIS-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN UP-KEY	 PERFORM MOVE-BLOCK-UP
		 WHEN DOWN-KEY	 PERFORM MOVE-BLOCK-DOWN
		 WHEN MOUSE-KEY  PERFORM POSITION-MOUSE
				 IF MOUSE-ENTER = "Y"
				     MOVE "N"	 TO MOUSE-ENTER
				     GO TO CJ15
				 END-IF
				 IF MOUSE-Y = 24
				     IF MOUSE-X = 5
					 MOVE 5  TO KEY-CODE-1
					 GO TO CJ10
				     ELSE
				     IF MOUSE-X = 10
					 MOVE 6  TO KEY-CODE-1
					 GO TO CJ10
				     ELSE
				     IF MOUSE-X > 36 AND < 44
					 MOVE 0  TO KEY-CODE-1
					 GO TO CJ10
				     ELSE
				     IF MOUSE-X > 54 AND < 60
					 MOVE 0  TO KEY-CODE-1
					 MOVE 1  TO KEY-TYPE
					 GO TO CJ10
				     END-IF
				 END-IF
		 WHEN ENTER-KEY  GO TO CJ15
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO CJ05
	   ELSE
	   IF USER-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN ESC-KEY
		     MOVE "0"	 TO WS-OPTION
		     GO TO CJ18
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO CJ05
	   ELSE
	   IF DATA-8BIT
	       MOVE KEY-CODE-1X  TO WS-OPTION
	       IF WS-OPTION < 0 OR > 7
		   CALL X"E5"
		   GO TO CJ05
	       END-IF
	       GO TO CJ16
	   ELSE
	       CALL X"E5"
	       GO TO CJ05.

       CJ15.
	   IF SCREEN-LIN < 9
	       CALL X"E5"
	       GO TO CJ05
	   ELSE
	   IF SCREEN-LIN = 9
	       MOVE "1"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 10
	       MOVE "2"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 11
	       MOVE "3"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 12
	       MOVE "4"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 13
	       MOVE "5"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 14
	       MOVE "6"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 15
	       MOVE "7"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 16
	       MOVE "0"		 TO WS-OPTION.
	   GO TO CJ18.

       CJ16.
	     PERFORM CLEAR-BLOCK.
	   IF WS-OPTION = 0
	       MOVE 16		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 1
	       MOVE 9		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 2
	       MOVE 10		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 3
	       MOVE 11		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 4
	       MOVE 12		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 5
	       MOVE 13		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 6
	       MOVE 14		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 7
	       MOVE 15		 TO SCREEN-LIN.
	     PERFORM SAVE-ATTR.
	     PERFORM MARK-BLOCK.

       CJ18.
	     CALL "CBL_TOUPPER" USING WS-OPTION
				BY VALUE WS-LENGTH
				RETURNING WS-STATUS.
	   IF WS-OPTION = "0"
	       GO TO CJ999.
	   IF WS-OPTION < 1 OR > 7
	       CALL X"E5"
	       GO TO CJ05.
	   IF WS-OPTION = "1"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		  Add a new Location (Warehouse)	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "STP\STP061" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "2"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			 Amend a Location		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "STP\STP062" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "3"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			 Delete a Location		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "STP\STP063" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "4"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		    Stock Transfers (Warehouse)		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "STP\STP064" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "5"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		  Add Stock Records to Warehouse	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "STP\STP065" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "6"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		   Location Report (Warehouse)		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "STP\STP066" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "7"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			     Enquiries			       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "STP\STPENQ" TO PRG-NAME.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.
	     GO TO CJ05.

       CJ999.
	     EXIT.

      /    *************************************************************
      *    **** 	    P R I C E	L A B E L S		    ****
      *    *************************************************************
       CK000	       SECTION 50.
       CK00.
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			   Price Labels			       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	     MOVE "STP\STP049"	 TO PRG-NAME.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.

       CK999.
	     EXIT.
      /    *************************************************************
      *    **** 	 P U R C H A S E   T R A C K I N G	    ****
      *    *************************************************************
       CL000	       SECTION 50.
       CL00.
	   IF LS0-LEV < 3
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		   Not available in this version	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "MNU\NOPMENU" TO PRG-NAME
	   ELSE
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			 Purchase Tracking		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "STP\STPPUR"  TO PRG-NAME.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.

       CL999.
	     EXIT.
      /    *************************************************************
      *    **** 	    B A R C O D E   L A B E L S		    ****
      *    *************************************************************
       CM000	       SECTION 50.
       CM00.
	   IF LS0-LEV < 3
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		   Not available in this version	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "MNU\NOPMENU" TO PRG-NAME
	   ELSE
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			Barcode Labels			       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "STP\STPBAR"  TO PRG-NAME.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.

       CM999.
	     EXIT.
      /    *************************************************************
      *    **** 	    B A R C O D E   S T Y L E S 	    ****
      *    *************************************************************
       CN000	       SECTION 50.
       CN00.
	   IF LS-DSKDRV = "L"
	       MOVE "Not available on Local drive"
				 TO WS-ERR-STRING
003260	       PERFORM ERROR-MESSAGE
	       GO TO CN999.
	   IF LS0-LEV < 3
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		   Not available in this version	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "MNU\NOPMENU" TO PRG-NAME
	   ELSE
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			Barcode Styles			       Ё
      *    Ё   UPC-A,UPC-E,JAN13/EAN13,JAN8/EAN8,CODE39,ITF,CODABAR    Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "UTP\BCSTYLE" TO PRG-NAME.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.

       CN999.
	     EXIT.
      /    *************************************************************
      *    **** 	     S T O C K	 O P T I O N S		    ****
      *    *************************************************************
       CO000	       SECTION 50.
       CO00.
	   IF LS-DSKDRV = "L"
	       MOVE "Not available on Local drive"
				 TO WS-ERR-STRING
003260	       PERFORM ERROR-MESSAGE
	       GO TO CO999.
	   IF LS0-LEV < 3
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		   Not available in this version	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "MNU\NOPMENU" TO PRG-NAME
	   ELSE
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		   Set the various Stock Options	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "STP\STP080" TO PRG-NAME.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.

       CO999.
	     EXIT.
      /    *************************************************************
      *    ****        A D J U S T M E N T   T R A C K I N G	    ****
      *    *************************************************************
       CP000	       SECTION 50.
       CP00.
	   IF LS0-LEV < 3
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		   Not available in this version	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "MNU\NOPMENU" TO PRG-NAME
	    ELSE
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		       Adjustment Tracking		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "STP\STPADJ"  TO PRG-NAME.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.

       CP999.
	     EXIT.
      /    *************************************************************
      *    ****    P R O M O T I O N S	 A N D	 S P E C I A L S    ****
      *    *************************************************************
       CQ000	       SECTION 50.
       CQ00.
	   IF LS-DSKDRV = "L"
	       MOVE "Not available on Local drive"
				 TO WS-ERR-STRING
003260	       PERFORM ERROR-MESSAGE
	       GO TO CQ999.
	   IF LS0-LEV < 3
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		   Not available in this version	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "MNU\NOPMENU" TO PRG-NAME
	   ELSE
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			Promotions/Specials		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "STP\STP085" TO PRG-NAME.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.

       CQ999.
	     EXIT.
      /    *************************************************************
      *    **** 	       U T I L I T I E S		    ****
      *    *************************************************************
       CR000	       SECTION 50.
       CR00.
	   IF LS-DSKDRV = "L"
	       MOVE "Not available on Local drive"
				 TO WS-ERR-STRING
003260	       PERFORM ERROR-MESSAGE
	       GO TO CR999.
	     MOVE 7		 TO SHADE-ROW.
	     MOVE 28		 TO SHADE-COL.
	     MOVE 23		 TO SHADE-WIDTH.
	     MOVE 12		 TO SHADE-LINES.
	     DISPLAY S07.
	   IF LS0-LEV < 3
	       DISPLAY "N/A" AT 0947
			WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 7
	       DISPLAY "N/A" AT 1047
			WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 7
	       DISPLAY "Clr. Qnt -Dept N/A  " AT 1130
			WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 7
	       DISPLAY "Del. Itm Range N/A" AT 1230
			WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 7.
	     DISPLAY MENU-INSTRUCT.
	     PERFORM SCREEN-SHADOW.
	     MOVE 7		 TO TOP-ROW.
	     MOVE 16		 TO BOTTOM-ROW.
	     MOVE 6		 TO SCREEN-LIN.
	     MOVE 28		 TO SCREEN-COL.
	     MOVE 21		 TO STRING-LENGTH.
	     PERFORM SAVE-ATTR.

       CR05.
	     CALL X"AF" USING GET-SINGLE-CHAR, KEY-STATUS.

       CR10.
	   IF ADIS-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN UP-KEY	 PERFORM MOVE-BLOCK-UP
		 WHEN DOWN-KEY	 PERFORM MOVE-BLOCK-DOWN
		 WHEN MOUSE-KEY  PERFORM POSITION-MOUSE
				 IF MOUSE-ENTER = "Y"
				     MOVE "N"	 TO MOUSE-ENTER
				     GO TO CR15
				 END-IF
				 IF MOUSE-Y = 24
				     IF MOUSE-X = 5
					 MOVE 5  TO KEY-CODE-1
					 GO TO CR10
				     ELSE
				     IF MOUSE-X = 10
					 MOVE 6  TO KEY-CODE-1
					 GO TO CR10
				     ELSE
				     IF MOUSE-X > 36 AND < 44
					 MOVE 0  TO KEY-CODE-1
					 GO TO CR10
				     ELSE
				     IF MOUSE-X > 54 AND < 60
					 MOVE 0  TO KEY-CODE-1
					 MOVE 1  TO KEY-TYPE
					 GO TO CR10
				     END-IF
				 END-IF
		 WHEN ENTER-KEY  GO TO CR15
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO CR05
	   ELSE
	   IF USER-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN ESC-KEY
		     MOVE "0"	 TO WS-OPTION
		     GO TO CR18
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO CR05
	   ELSE
	   IF DATA-8BIT
	       MOVE KEY-CODE-1X  TO WS-OPTION
	       CALL "CBL_TOUPPER" USING WS-OPTION
				  BY VALUE WS-LENGTH
				  RETURNING WS-STATUS
	       IF (WS-OPTION < 0 OR > 8) AND
		  (WS-OPTION NOT = "A") AND
		  (WS-OPTION NOT = ">") AND
		  (WS-OPTION NOT = "<") AND
		  (WS-OPTION NOT = "/") AND
		  (WS-OPTION NOT = "!")
		   CALL X"E5"
		   GO TO CR05
	       END-IF
	       GO TO CR16
	   ELSE
	       CALL X"E5"
	       GO TO CR05.

       CR15.
	   IF SCREEN-LIN < 7
	       CALL X"E5"
	       GO TO CR05
	   ELSE
	   IF SCREEN-LIN = 7
	       MOVE "1"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 8
	       MOVE "2"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 9
	       MOVE "3"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 10
	       MOVE "4"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 11
	       MOVE "5"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 12
	       MOVE "6"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 13
	       MOVE "7"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 14
	       MOVE "8"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 15
	       MOVE "A"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 16
	       MOVE "0"		 TO WS-OPTION.
	   GO TO CR18.

       CR16.
	     PERFORM CLEAR-BLOCK.
	   IF WS-OPTION = 0
	       MOVE 16		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 1
	       MOVE 7		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 2
	       MOVE 8		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 3
	       MOVE 9		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 4
	       MOVE 10		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 5
	       MOVE 11		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 6
	       MOVE 12		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 7
	       MOVE 13		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = ">" OR "<" OR "/" OR "!"
	       MOVE 15		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 8
	       MOVE 14		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "A"
	       MOVE 15		 TO SCREEN-LIN.
	     PERFORM SAVE-ATTR.
	     PERFORM MARK-BLOCK.

       CR18.
	     EVALUATE WS-OPTION
	       WHEN "0"
		   GO TO CR999
	       WHEN "1"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		Create Alternate Description Index	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "Y"	 TO WS-REOPEN
		   CLOSE STKALT
			 STOCK
			 NETWORK
			 PARAM
		   MOVE "UTP\STAREB"	   TO PRG-NAME
	       WHEN "2"
		   IF LS0-LEV < 3
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		   Not available in this version	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		       MOVE "MNU\NOPMENU"  TO PRG-NAME
		   ELSE
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		       Clear Guarantee Period		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		       MOVE "STP\STP092"   TO PRG-NAME
		   END-IF
	       WHEN "3"
		   IF LS0-LEV < 3
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		   Not available in this version	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		       MOVE "MNU\NOPMENU"  TO PRG-NAME
		   ELSE
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			  Clear Quantities		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		       MOVE "STP\STP093"   TO PRG-NAME
		   END-IF
	       WHEN "4"
		   IF LS0-LEV < 3
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		   Not available in this version	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		       MOVE "MNU\NOPMENU"  TO PRG-NAME
		   ELSE
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		  Clear Quantities per Department	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		       MOVE "STP\STP094"   TO PRG-NAME
		   END-IF
	       WHEN "5"
		   IF LS0-LEV < 3
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		   Not available in this version	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		       MOVE "MNU\NOPMENU"  TO PRG-NAME
		   ELSE
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		       Delete an Item Range		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		       MOVE "STP\STP095"   TO PRG-NAME
		   END-IF
	       WHEN "6"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			 Price Label Code		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "STP\STP096" TO PRG-NAME
	       WHEN "7"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		       Re-Calculate Prices		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "STP\STP097" TO PRG-NAME
	       WHEN ">"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё	      Average cost Adjustment (Not on Menu)	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "STP\STP098" TO PRG-NAME
	       WHEN "<"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			   Patch Program		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "STP\STP099" TO PRG-NAME
	       WHEN "8"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			     Enquiries			       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "STP\STPENQ" TO PRG-NAME
	       WHEN "A"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		Varify and correct AVERAGE prices	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "STP\STPCSTAV" TO PRG-NAME
	       WHEN "/"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё	  Picking Slip Quantity recalculate (Not on Menu)      Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "STP\STPPIC" TO PRG-NAME
	       WHEN "!"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё   Create Alternate code for Mica Dbn North (Not on Menu)  Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "STP\STPALT" TO PRG-NAME
	     END-EVALUATE.
	     PERFORM AA100.
	   IF WS-REOPEN = "Y"
	       MOVE SPACE	 TO WS-REOPEN
	       OPEN I-O STKALT
			STOCK
			NETWORK
			PARAM.
	     DISPLAY MENU-INSTRUCT.
	     GO TO CR05.

       CR999.
	     EXIT.
      /    *************************************************************
      *    **** 	     S T O C K	 R E P O R T S		    ****
      *    *************************************************************
       DA000	       SECTION 51.
       DA00.
	     MOVE 6		 TO SHADE-ROW.
	     MOVE 28		 TO SHADE-COL.
	     MOVE 23		 TO SHADE-WIDTH.
	     MOVE 17		 TO SHADE-LINES.
	     DISPLAY S08.
	   IF LS0-LEV < 3
	       DISPLAY ". (N/A)" AT 1343
			WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 3
	       DISPLAY "(N/A)" AT 1741
			WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 3
	       DISPLAY "(N/A)" AT 1845
			WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 3
	       DISPLAY "(N/A)" AT 2045
			WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 3.
	   IF LS0-LEV < 2
	       DISPLAY " (N/A)" AT 1944
			WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 3.
	     DISPLAY MENU-INSTRUCT.
	     PERFORM SCREEN-SHADOW.
	     MOVE 6		 TO TOP-ROW.
	     MOVE 20		 TO BOTTOM-ROW.
	     MOVE 5		 TO SCREEN-LIN.
	     MOVE 28		 TO SCREEN-COL.
	     MOVE 21		 TO STRING-LENGTH.
	     PERFORM SAVE-ATTR.

       DA05.
	     CALL X"AF" USING GET-SINGLE-CHAR, KEY-STATUS.

       DA10.
	   IF ADIS-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN UP-KEY	 PERFORM MOVE-BLOCK-UP
		 WHEN DOWN-KEY	 PERFORM MOVE-BLOCK-DOWN
		 WHEN MOUSE-KEY  PERFORM POSITION-MOUSE
				 IF MOUSE-ENTER = "Y"
				     MOVE "N"	 TO MOUSE-ENTER
				     GO TO DA15
				 END-IF
				 IF MOUSE-Y = 24
				     IF MOUSE-X = 5
					 MOVE 5  TO KEY-CODE-1
					 GO TO DA10
				     ELSE
				     IF MOUSE-X = 10
					 MOVE 6  TO KEY-CODE-1
					 GO TO DA10
				     ELSE
				     IF MOUSE-X > 36 AND < 44
					 MOVE 0  TO KEY-CODE-1
					 GO TO DA10
				     ELSE
				     IF MOUSE-X > 54 AND < 60
					 MOVE 0  TO KEY-CODE-1
					 MOVE 1  TO KEY-TYPE
					 GO TO DA10
				     END-IF
				 END-IF
		 WHEN ENTER-KEY  GO TO DA15
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO DA05
	   ELSE
	   IF USER-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN ESC-KEY
		     MOVE "0"	 TO WS-OPTION
		     GO TO DA18
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO DA05
	   ELSE
	   IF DATA-8BIT
	       MOVE KEY-CODE-1X  TO WS-OPTION
	       CALL "CBL_TOUPPER" USING WS-OPTION
				  BY VALUE WS-LENGTH
				  RETURNING WS-STATUS
	       IF (WS-OPTION < 0 OR > 8) AND
		  (WS-OPTION < "A" OR > "F")
		   CALL X"E5"
		   GO TO DA05
	       END-IF
	       GO TO DA16
	   ELSE
	       CALL X"E5"
	       GO TO DA05.

       DA15.
	   IF SCREEN-LIN < 6
	       CALL X"E5"
	       GO TO DA05
	   ELSE
	   IF SCREEN-LIN = 6
	       MOVE "1"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 7
	       MOVE "2"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 8
	       MOVE "3"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 9
	       MOVE "4"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 10
	       MOVE "5"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 11
	       MOVE "6"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 12
	       MOVE "7"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 13
	       MOVE "8"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 14
	       MOVE "A"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 15
	       MOVE "B"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 16
	       MOVE "C"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 17
	       MOVE "D"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 18
	       MOVE "E"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 19
	       MOVE "F"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 20
	       MOVE "0"		 TO WS-OPTION.
	   GO TO DA18.

       DA16.
	     PERFORM CLEAR-BLOCK.
	   IF WS-OPTION = 0
	       MOVE 20		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 1
	       MOVE 6		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 2
	       MOVE 7		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 3
	       MOVE 8		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 4
	       MOVE 9		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 5
	       MOVE 10		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 6
	       MOVE 11		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 7
	       MOVE 12		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 8
	       MOVE 13		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "A"
	       MOVE 14		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "B"
	       MOVE 15		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "C"
	       MOVE 16		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "D"
	       MOVE 17		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "E"
	       MOVE 18		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "F"
	       MOVE 19		 TO SCREEN-LIN.
	     PERFORM SAVE-ATTR.
	     PERFORM MARK-BLOCK.

       DA18.
	   IF WS-OPTION = "0"
	       GO TO DA999.
	   IF WS-OPTION = "1"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			    Price Lists			       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "STP\STP041" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "2"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			Departmental Lists		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "STP\STP042" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "3"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		  Stock List - Item Code Sequence	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "STP\STP043" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "4"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			 Stock Take List		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "STP\STP044" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "5"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			 Movement Report		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "STP\STP045" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "6"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		    Low-Levels / Re-Order report	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "STP\STP046" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "7"
	       IF LS0-LEV < 3
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		   Not available in this version	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "MNU\NOPMENU" TO PRG-NAME
	       ELSE
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		       Bill of Quantities		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "STP\STP047"  TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "8"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		       Quantity/Price List		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "STP\STP048" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "A"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			  Price Labels			       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "STP\STP049" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "B"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		       Slow Moving Stock		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "STP\STP050" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "C"
	       IF LS0-LEV < 3
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		   Not available in this version	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "MNU\NOPMENU" TO PRG-NAME
	       ELSE
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			  Exceptions			       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "STP\STP051" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "D"
	       IF LS0-LEV < 3
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		   Not available in this version	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "MNU\NOPMENU" TO PRG-NAME
	       ELSE
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			  Redundant Stock		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "STP\STP052" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "E"
	       IF LS0-LEV < 2
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		   Not available in this version	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "MNU\NOPMENU" TO PRG-NAME
	       ELSE
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			Stock per Supplier		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "STP\STP053" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "F"
	       IF LS0-LEV < 3
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		   Not available in this version	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "MNU\NOPMENU" TO PRG-NAME
	       ELSE
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			 Price Catalogue		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "STP\STP054" TO PRG-NAME.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.
	     GO TO DA05.

       DA999.
	     EXIT.
      /    *************************************************************
      *    ****       S T O C K	  E X P O R T  /  I M P O R T	    ****
      *    *************************************************************
       EA000	       SECTION 52.
       EA00.
	   IF LS-DSKDRV = "L"
	       MOVE "Not available on Local drive"
				 TO WS-ERR-STRING
003260	       PERFORM ERROR-MESSAGE
	       GO TO EA999.
	   IF LS0-LEV < 2
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		   Not available in this version	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "MNU\NOPMENU"
				 TO PRG-NAME
	       PERFORM AA100
	       DISPLAY MENU-INSTRUCT
	       GO TO EA999.
	     MOVE 7		 TO SHADE-ROW.
	     MOVE 28		 TO SHADE-COL.
	     MOVE 23		 TO SHADE-WIDTH.
	     MOVE 9		 TO SHADE-LINES.
	     DISPLAY S09.
	   IF LS0-LEV < 3
	       DISPLAY "(N/A)" AT 0843
			WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 3
	       DISPLAY "(N/A)" AT 0944
			WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 3
	       DISPLAY "(In) (N/A)   " AT 1037
			WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 3
	       DISPLAY "(Out) (N/A)  " AT 1137
			WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 3
	       DISPLAY "(N/A)" AT 1345
			WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 3.
	     DISPLAY MENU-INSTRUCT.
	     PERFORM SCREEN-SHADOW.
	     MOVE 7		 TO TOP-ROW.
	     MOVE 13		 TO BOTTOM-ROW.
	     MOVE 6		 TO SCREEN-LIN.
	     MOVE 28		 TO SCREEN-COL.
	     MOVE 21		 TO STRING-LENGTH.
	     PERFORM SAVE-ATTR.

       EA05.
	     CALL X"AF" USING GET-SINGLE-CHAR, KEY-STATUS.

       EA10.
	   IF ADIS-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN UP-KEY	 PERFORM MOVE-BLOCK-UP
		 WHEN DOWN-KEY	 PERFORM MOVE-BLOCK-DOWN
		 WHEN MOUSE-KEY  PERFORM POSITION-MOUSE
				 IF MOUSE-ENTER = "Y"
				     MOVE "N"	 TO MOUSE-ENTER
				     GO TO EA15
				 END-IF
				 IF MOUSE-Y = 24
				     IF MOUSE-X = 5
					 MOVE 5  TO KEY-CODE-1
					 GO TO EA10
				     ELSE
				     IF MOUSE-X = 10
					 MOVE 6  TO KEY-CODE-1
					 GO TO EA10
				     ELSE
				     IF MOUSE-X > 36 AND < 44
					 MOVE 0  TO KEY-CODE-1
					 GO TO EA10
				     ELSE
				     IF MOUSE-X > 54 AND < 60
					 MOVE 0  TO KEY-CODE-1
					 MOVE 1  TO KEY-TYPE
					 GO TO EA10
				     END-IF
				 END-IF
		 WHEN ENTER-KEY  GO TO EA15
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO EA05
	   ELSE
	   IF USER-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN ESC-KEY
		     MOVE "0"	 TO WS-OPTION
		     GO TO EA18
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO EA05
	   ELSE
	   IF DATA-8BIT
	       MOVE KEY-CODE-1X  TO WS-OPTION
	       IF WS-OPTION < 0 OR > 6
		   CALL X"E5"
		   GO TO EA05
	       END-IF
	       GO TO EA16
	   ELSE
	       CALL X"E5"
	       GO TO EA05.

       EA15.
	   IF SCREEN-LIN < 7
	       CALL X"E5"
	       GO TO EA05
	   ELSE
	   IF SCREEN-LIN = 7
	       MOVE "1"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 8
	       MOVE "2"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 9
	       MOVE "3"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 10
	       MOVE "4"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 11
	       MOVE "5"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 12
	       MOVE "6"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 13
	       MOVE "0"		 TO WS-OPTION.
	   GO TO EA18.

       EA16.
	     PERFORM CLEAR-BLOCK.
	   IF WS-OPTION = 0
	       MOVE 13		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 1
	       MOVE 7		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 2
	       MOVE 8		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 3
	       MOVE 9		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 4
	       MOVE 10		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 5
	       MOVE 11		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = 6
	       MOVE 12		 TO SCREEN-LIN.
	     PERFORM SAVE-ATTR.
	     PERFORM MARK-BLOCK.

       EA18.
	   IF WS-OPTION = "0"
	       GO TO EA999.
	   IF WS-OPTION = "1"
	       IF LS0-LEV < 3
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		   Not available in this version	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "MNU\NOPMENU" TO PRG-NAME
	       ELSE
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		       Branch Transfers In		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "STP\STP031"  TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "2"
	       IF LS0-LEV < 3
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		   Not available in this version	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "MNU\NOPMENU" TO PRG-NAME
	       ELSE
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		       Branch Transfers Out		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "STP\STP032"  TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "3"
	       IF LS0-LEV < 3
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		   Not available in this version	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "MNU\NOPMENU" TO PRG-NAME
	       ELSE
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		     Prices - Branch (Import)		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "STP\STP033"  TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "4"
	       IF LS0-LEV < 3
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		   Not available in this version	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "MNU\NOPMENU" TO PRG-NAME
	       ELSE
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		      Prices - Branch (Export)
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "STP\STP034"  TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "5"
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			  Export Options		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	       MOVE "STP\STPEXP"      TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "6"
	       IF LS0-LEV < 3
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		   Not available in this version	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "MNU\NOPMENU" TO PRG-NAME
	       ELSE
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			  Import Options		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
		   MOVE "STP\STPIMP"  TO PRG-NAME.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.
	     GO TO EA05.

       EA999.
	     EXIT.
      /    *************************************************************
      *    **** 		E N Q U I R I E S		    ****
      *    *************************************************************
       FA000	       SECTION 53.
       FA00.
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё			     Enquiries			       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	     MOVE "STP\STPENQ"	 TO PRG-NAME.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.

       FA999.
	     EXIT.
      /    *************************************************************
      *    **** 	      L O G I N / L O G O U T		    ****
      *    *************************************************************
       GA000	       SECTION 54.
       GA00.
042350	   IF LS-OK = "Y"
	       GO TO GA30.
042940	     MOVE 3		 TO WS-NETKEY.
       GA05.
000030	     READ NETWORK.
000060     IF WS-STAT1 = "2" OR "3" OR "4"
000070         MOVE 2            TO WS-F-ERROR
000080         PERFORM READ-ERROR.
000090     IF RECORD-LOCKED
000110	       GO TO GA05.
042960	     MOVE STK-PASSWORD	 TO WS-PASSWORD.

042520 GA10.
             MOVE SPACES         TO WS-PASS.
	     MOVE 12		 TO SHADE-ROW.
	     MOVE 29		 TO SHADE-COL.
	     MOVE 25		 TO SHADE-WIDTH.
	     MOVE 2		 TO SHADE-LINES.
	     DISPLAY "зддддддддддддддддддддддддд" AT 1127
		      WITH FOREGROUND-COLOR 7 HIGHLIGHT
			   BACKGROUND-COLOR 7
		     "©" WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 7.
042540	     DISPLAY "Ё " AT 1227 WITH FOREGROUND-COLOR 7 HIGHLIGHT
				       BACKGROUND-COLOR 7
		     "Enter Password          "
		      WITH FOREGROUND-COLOR 7 HIGHLIGHT
			   BACKGROUND-COLOR 7
		     "Ё" WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 7.
	     DISPLAY "ю" AT 1327 WITH FOREGROUND-COLOR 7 HIGHLIGHT
				      BACKGROUND-COLOR 7
		     "ддддддддддддддддддддддддды"
		      WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 7.
	     PERFORM SCREEN-SHADOW.
042550	     ACCEPT WS-PASS AT 1244
		    WITH BACKGROUND-COLOR 5
			 FOREGROUND-COLOR 3 HIGHLIGHT AUTO NO-ECHO.
	     MOVE 8		 TO WS-LENGTH.
	     CALL "CBL_TOUPPER" USING WS-PASS
				BY VALUE WS-LENGTH
				RETURNING WS-STATUS.
	     MOVE 1		 TO WS-LENGTH.
	     PERFORM RESTORE-SCREEN.
042560     IF WS-PASS = "@#$" OR
042570        WS-PASS = WS-PASSWORD
042580         NEXT SENTENCE
042590     ELSE
042600	       MOVE "Inalid password"
				 TO WS-ERR-STRING
003260	       PERFORM ERROR-MESSAGE
042620	       GO TO GA999.
042630	     MOVE "Y"		 TO LS-OK.
	     MOVE 12		 TO SHADE-ROW.
	     MOVE 20		 TO SHADE-COL.
	     MOVE 44		 TO SHADE-WIDTH.
	     MOVE 2		 TO SHADE-LINES.
	     DISPLAY "здддддддддддддддддддддддддддддддддддддддддддд"
		      AT 1118 WITH FOREGROUND-COLOR 7 HIGHLIGHT
				   BACKGROUND-COLOR 7
		     "©" WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 7.
042540	     DISPLAY "Ё " AT 1218 WITH FOREGROUND-COLOR 7 HIGHLIGHT
				       BACKGROUND-COLOR 7
042640		     "Do you want to change the password (Y/N)   "
		      WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 7
		     "Ё" WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 7.
	     DISPLAY "ю" AT 1318 WITH FOREGROUND-COLOR 7 HIGHLIGHT
				      BACKGROUND-COLOR 7
		     "дддддддддддддддддддддддддддддддддддддддддддды"
		      WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 7.
	     PERFORM SCREEN-SHADOW.
042660	     MOVE "N"		 TO WS-OPTION.

042670 GA15.
042680	     ACCEPT WS-OPTION AT 1261
		    WITH FOREGROUND-COLOR 3 HIGHLIGHT
			 BACKGROUND-COLOR 5 UPDATE AUTO.
	     CALL "CBL_TOUPPER" USING WS-OPTION
				BY VALUE WS-LENGTH
				RETURNING WS-STATUS.
042740	   IF NOT (WS-OPTION = "Y" OR "N")
042750	       GO TO GA15.
	     PERFORM RESTORE-SCREEN.
042760     IF WS-OPTION = "N"
042770	       GO TO GA999.
	     MOVE 12		 TO SHADE-ROW.
	     MOVE 30		 TO SHADE-COL.
	     MOVE 23		 TO SHADE-WIDTH.
	     MOVE 2		 TO SHADE-LINES.
	     DISPLAY "зддддддддддддддддддддддд" AT 1128
		      WITH FOREGROUND-COLOR 7 HIGHLIGHT
			   BACKGROUND-COLOR 7
		     "©" WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 7.
042540	     DISPLAY "Ё " AT 1228 WITH FOREGROUND-COLOR 7 HIGHLIGHT
				       BACKGROUND-COLOR 7
		     "New Password          "
		      WITH FOREGROUND-COLOR 7 HIGHLIGHT
			   BACKGROUND-COLOR 7
		     "Ё" WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 7.
	     DISPLAY "ю" AT 1328 WITH FOREGROUND-COLOR 7 HIGHLIGHT
				      BACKGROUND-COLOR 7
		     "ддддддддддддддддддддддды"
		      WITH FOREGROUND-COLOR 0 BACKGROUND-COLOR 7.
	     PERFORM SCREEN-SHADOW.

042790 GA20.
042800	     ACCEPT WS-PASS AT 1243
		    WITH BACKGROUND-COLOR 5
			 FOREGROUND-COLOR 7 HIGHLIGHT AUTO.
	     MOVE 8		 TO WS-LENGTH.
	     CALL "CBL_TOUPPER" USING WS-PASS
				BY VALUE WS-LENGTH
				RETURNING WS-STATUS.
	     MOVE 1		 TO WS-LENGTH.
042810	     DISPLAY "C" AT 2312 WITH FOREGROUND-COLOR 14
                     "orrect or " WITH FOREGROUND-COLOR 7
                     "R" WITH FOREGROUND-COLOR 14
                     "ekey > <" WITH FOREGROUND-COLOR 7.
042820	     MOVE "C"		 TO WS-OPTION.

042830 GA25.
042840	     ACCEPT WS-OPTION AT 2330
                    WITH FOREGROUND-COLOR 15 UPDATE AUTO.
	     CALL "CBL_TOUPPER" USING WS-OPTION
				BY VALUE WS-LENGTH
				RETURNING WS-STATUS.
042900	   IF NOT (WS-OPTION = "C" OR "R")
042910	       GO TO GA25.
042920     IF WS-OPTION = "R"
042930	       GO TO GA25.
       GA28.
000170	     READ NETWORK WITH KEPT LOCK.
000200     IF WS-STAT1 = "2" OR "3" OR "4"
000210         MOVE 2            TO WS-F-ERROR
000220         PERFORM READ-ERROR.
000230     IF RECORD-LOCKED
000250	       GO TO GA28.
042960	     MOVE WS-PASS	 TO STK-PASSWORD.
000100	     REWRITE NET-RECORD.
000110     IF WS-STATUS NOT = "00"
000120         MOVE 2            TO WS-F-ERROR
000130         PERFORM WRITE-ERROR.
000140       UNLOCK NETWORK.
042980	     GO TO GA999.
042990 GA30.
043000	     MOVE "N"		 TO LS-OK.
043010 GA999.
043020       EXIT.
      /    *************************************************************
      *    ****		I N I T I A L I S E   P R O G R A M	    ****
      *    *************************************************************
038140 ZA000-INIT	       SECTION 90.
038150 ZA000-OPEN.
038160	     PERFORM ZA60.
	     MOVE LS-PARID	 TO WS-PARID.
	     MOVE LS-L-OR-N	 TO W02-L-OR-N.
	     MOVE WS-SYS-ID	 TO W02-SYSID.
	     MOVE LS-TODAY-DDMMYY
				 TO TODAY-DDMMYY.
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё D O   N O T   D I S P L A Y   E R R O R   M E S S A G E S Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
      *	     MOVE 44		 TO USER-NUMBER.
      *	     MOVE 1		 TO USER-SETTING.
      *	     CALL X"AF" USING SET-BIT-PAIRS, USER-KEY-CONTROL.
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё	   S e t   u p	 t h e	 F U N C T I O N   k e y s     Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	     MOVE 1		 TO USER-ACTION
				    USER-SETTING.
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		       ESC, F1 to F10 keys		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	     MOVE ZERO		 TO USER-NUMBER.
	     MOVE 11		 TO USER-KEYS.
	     CALL X"AF" USING SET-BIT-PAIRS, USER-KEY-CONTROL.
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		    PAGE-UP and PAGE-DOWN keys		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	     MOVE 53		 TO USER-NUMBER.
	     MOVE 2		 TO USER-KEYS.
	     CALL X"AF" USING SET-BIT-PAIRS, USER-KEY-CONTROL.
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё	    PRE-DISPLAY ACCEPT FIELDS BEFORE DATA-ENTRY        Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
      *      MOVE 76		 TO USER-NUMBER.
      *      MOVE 3		 TO USER-SETTING.
      *      MOVE 1		 TO USER-KEYS.
      *      CALL X"AF" USING SET-BIT-PAIRS, USER-KEY-CONTROL.
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё		   A C T I V A T E   M O U S E		       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	     MOVE 64		 TO MOUSE-FUNC.
	     MOVE 1		 TO MOUSE-PARAM.
	     CALL X"AF" USING MOUSE-FUNC
			      MOUSE-PARAM.
	   IF MOUSE-FUNC NOT = 255
	       MOVE "Y"		 TO MOUSE-ATTACHED
      *        MOVE 66		 TO MOUSE-FUNC
      *        MOVE 0		 TO MOUSE-PARAM
      *        CALL X"AF" USING MOUSE-FUNC
      *				MOUSE-PARAM
	   ELSE
	       GO TO ZA00A.
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё	       Set MOUSE key to act as FUNCTION key	       Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
	     MOVE 3		 TO USER-ACTION.
	     MOVE 27		 TO USER-NUMBER.
	     MOVE 2		 TO USER-KEYS.
	     CALL X"AF" USING SET-BIT-PAIRS, USER-KEY-CONTROL.
      *      CALL CBL_INIT_MOUSE USING MOUSE-HANDLE
      *				       MOUSE-BUTTONS
      *				 RETURNING MOUSE-STATUS.
      *    IF MOUSE-STATUS = ZERO
      *        MOVE "Y"		 TO MOUSE-ATTACHED.
      *    зддддддддддддддддддддддддддддддддддддддддддддддддддддддддддд©
      *    Ё	    Setup the file ID's including path names           Ё
      *    юддддддддддддддддддддддддддддддддддддддддддддддддддддддддддды
      *    *************************************************************
      *    **** 	  P A R A M E T E R   F I L E		    ****
      *    *************************************************************
       ZA00A.
	     MOVE "PARAM"	 TO AFID-KEY.

       ZA00-READ-APACFIDS.
000030	     READ APACFIDS WITH IGNORE LOCK
	       KEY IS AFID-KEY.
	   IF WS-STATUS = "00"
	       GO TO ZA00-READ-APACFIDS-EXIT.
006260	     STRING "Missing " DELIMITED SIZE
		     AFID-KEY DELIMITED BY " "
		     " file ID - Status " DELIMITED SIZE
		     WS-STATUS DELIMITED SIZE
		     INTO WS-ERR-MES.
	     PERFORM ERROR-LENGTH THRU ERROR-EXIT.
006370	     STOP RUN.

       ZA00-READ-APACFIDS-EXIT.
	     EXIT.

       ZA00A-CONTINUE.
	     MOVE AFID-PATH	 TO W02-PARAM.
      *    *************************************************************
      *    ****       S A L E S	  -   H I S T O R Y   F I L E	    ****
      *    *************************************************************
	     MOVE "CARDEX"	 TO AFID-KEY.
	     PERFORM ZA00-READ-APACFIDS THRU ZA00-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-CARDEX.
      *    *************************************************************
      *    *** C R E D I T O R	 A C C O U N T	 ( A / P )   F I L E ***
      *    *************************************************************
	     MOVE "CREDIT"	 TO AFID-KEY.
	     PERFORM ZA00-READ-APACFIDS THRU ZA00-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-CREDIT.
      *    *************************************************************
      *    **** 	  I N T E G R A T I O N	  F I L E	    ****
      *    *************************************************************
	     MOVE "LEDTRF"	 TO AFID-KEY.
	     PERFORM ZA00-READ-APACFIDS THRU ZA00-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-LEDTRF.
      *    *************************************************************
      *    **** 	    C O N T R O L   F I L E		    ****
      *    *************************************************************
	     MOVE "NETWORK"	 TO AFID-KEY.
	     PERFORM ZA00-READ-APACFIDS THRU ZA00-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-NETWORK.
      *    *************************************************************
      *    ****        P U R C H A S E	 O R D E R   F I L E	    ****
      *    *************************************************************
	     MOVE "PORDER"	 TO AFID-KEY.
	     PERFORM ZA00-READ-APACFIDS THRU ZA00-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-PORDER.
      *    *************************************************************
      *    ****    P U R C H A S E S   -   C A R D E X	 F I L E    ****
      *    *************************************************************
	     MOVE "PURDEX"	 TO AFID-KEY.
	     PERFORM ZA00-READ-APACFIDS THRU ZA00-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-PURDEX.
      *	   *************************************************************
      *    *** S T O C K   ( I V E N T O R Y )	 P A R T S   F I L E ***
      *    *************************************************************
	     MOVE "SPARTS"	 TO AFID-KEY.
	     PERFORM ZA00-READ-APACFIDS THRU ZA00-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-SPARTS.
      *    *************************************************************
      *    ****	S T O C K   A L T E R N A T E	I N D E X   F I L E ****
      *    *************************************************************
	     MOVE "STKALT"	 TO AFID-KEY.
	     PERFORM ZA00-READ-APACFIDS THRU ZA00-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-STKALT.
      *    *************************************************************
      *    ****  A D J U S T M E N T   -   H I S T O R Y   F I L E  ****
      *    *************************************************************
	     MOVE "STKDEX"	 TO AFID-KEY.
	     PERFORM ZA00-READ-APACFIDS THRU ZA00-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-STKDEX.
      *    *************************************************************
      *    ***	S T O C K   ( I V E N T O R Y )   M E M O   F I L E  ***
      *    *************************************************************
	     MOVE "STKMEM"	 TO AFID-KEY.
	     PERFORM ZA00-READ-APACFIDS THRU ZA00-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-STKMEM.
      *    *************************************************************
      *    ****      S T O C K	 ( I V E N T O R Y )   F I L E	    ****
      *    *************************************************************
	     MOVE "STOCKF"	 TO AFID-KEY.
	     PERFORM ZA00-READ-APACFIDS THRU ZA00-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-STOCKF.
      *    *************************************************************
      *    **** 	    W A R E H O U S E	F I L E		    ****
      *    *************************************************************
	     MOVE "WARHSE"	 TO AFID-KEY.
	     PERFORM ZA00-READ-APACFIDS THRU ZA00-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-WARHSE.
      *    *************************************************************
      *    W A R E H O U S E  -  S T O C K  ( I V E N T O R Y )  F I L E
      *    *************************************************************
	     MOVE "WSTOCK"	 TO AFID-KEY.
	     PERFORM ZA00-READ-APACFIDS THRU ZA00-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-WSTOCK.
053830	     OPEN I-O CARDEX.
	   IF WS-STATUS = "05"
	       CLOSE CARDEX
	       OPEN OUTPUT CARDEX
	       CLOSE CARDEX
	       OPEN I-O CARDEX.
053840	   IF RUNTIME-ERROR
053850         IF FLE-LOCKED
053860             GO TO ZA200
053870         ELSE
053880         IF FLE-LIMIT
053890		   GO TO ZA49
               ELSE
	       IF IDX-CORRUPT
		   MOVE 43	 TO WS-F-ERROR
		   GO TO ZA50.
053900     IF WS-STATUS NOT = "00"
053910	       MOVE 43		 TO WS-F-ERROR
	       IF WS-STATUS = "39"
038770		   GO TO ZA50
	       ELSE
	       IF NOT (WS-STATUS = "41")
044350		   PERFORM OPEN-ERROR.
042240	     OPEN INPUT CREDIT.
042250     IF RUNTIME-ERROR
               IF FLE-LOCKED
042130             GO TO ZA200
               ELSE
               IF FLE-LIMIT
                   GO TO ZA49
               ELSE
	       IF IDX-CORRUPT
                   MOVE 3        TO WS-F-ERROR
                   GO TO ZA50.
050190     IF WS-STATUS NOT = "00"
050200         MOVE 3            TO WS-F-ERROR
	       IF WS-STATUS = "39"
038770		   GO TO ZA50
	       ELSE
	       IF NOT (WS-STATUS = "41")
050210		   PERFORM OPEN-ERROR.
053830	     OPEN I-O PURDEX.
	   IF WS-STATUS = "05"
	       CLOSE PURDEX
	       OPEN OUTPUT PURDEX
	       CLOSE PURDEX
	       OPEN I-O PURDEX.
053840	   IF RUNTIME-ERROR
053850         IF FLE-LOCKED
053860             GO TO ZA200
053870         ELSE
053880         IF FLE-LIMIT
053890		   GO TO ZA49
               ELSE
	       IF IDX-CORRUPT OR
		 (WS-STATUS = "39")
		   MOVE 56	 TO WS-F-ERROR
		   GO TO ZA50.
053900     IF WS-STATUS NOT = "00"
053910	       MOVE 56		 TO WS-F-ERROR
	       IF NOT (WS-STATUS = "41")
044350		   PERFORM OPEN-ERROR.
	     OPEN I-O STKALT.
	   IF WS-STATUS = "05"
	       CLOSE STKALT
	       OPEN OUTPUT STKALT
	       CLOSE STKALT
	       OPEN I-O STKALT.
053840	   IF RUNTIME-ERROR
053850         IF FLE-LOCKED
053860             GO TO ZA200
053870         ELSE
053880         IF FLE-LIMIT
053890		   GO TO ZA49
               ELSE
	       IF IDX-CORRUPT
		   MOVE 49	 TO WS-F-ERROR
		   GO TO ZA50.
053900     IF WS-STATUS NOT = "00"
053910	       MOVE 49		 TO WS-F-ERROR
	       IF WS-STATUS = "39"
038770		   GO TO ZA50
	       ELSE
	       IF NOT (WS-STATUS = "41")
044350		   PERFORM OPEN-ERROR.
053830	     OPEN I-O STKDEX.
	   IF WS-STATUS = "05"
	       CLOSE STKDEX
	       OPEN OUTPUT STKDEX
	       CLOSE STKDEX
	       OPEN I-O STKDEX.
053840	   IF RUNTIME-ERROR
053850         IF FLE-LOCKED
053860             GO TO ZA200
053870         ELSE
053880         IF FLE-LIMIT
053890		   GO TO ZA49
               ELSE
	       IF IDX-CORRUPT
		   MOVE 46	 TO WS-F-ERROR
		   GO TO ZA50.
053900     IF WS-STATUS NOT = "00"
053910	       MOVE 46		 TO WS-F-ERROR
	       IF WS-STATUS = "39"
038770		   GO TO ZA50
	       ELSE
	       IF NOT (WS-STATUS = "41")
044350		   PERFORM OPEN-ERROR.
044300	     OPEN I-O STKMEM.
           IF WS-STATUS = "05"
               CLOSE STKMEM
               OPEN OUTPUT STKMEM
               CLOSE STKMEM
               OPEN I-O STKMEM.
044310     IF RUNTIME-ERROR
               IF FLE-LOCKED
040420             GO TO ZA200
               ELSE
               IF FLE-LIMIT
                   GO TO ZA49
               ELSE
	       IF IDX-CORRUPT
                   MOVE 25       TO WS-F-ERROR
                   GO TO ZA50.
044330     IF WS-STATUS NOT = "00"
044340         MOVE 25           TO WS-F-ERROR
	       IF WS-STATUS = "39"
038770		   GO TO ZA50
	       ELSE
	       IF NOT (WS-STATUS = "41")
050210		   PERFORM OPEN-ERROR.
044300	     OPEN I-O STOCK.
044310     IF RUNTIME-ERROR
               IF FLE-LOCKED
040420             GO TO ZA200
               ELSE
               IF FLE-LIMIT
                   GO TO ZA49
               ELSE
	       IF IDX-CORRUPT
                   MOVE 22       TO WS-F-ERROR
                   GO TO ZA50.
044330     IF WS-STATUS NOT = "00"
044340         MOVE 22           TO WS-F-ERROR
	       IF WS-STATUS = "39"
038770		   GO TO ZA50
	       ELSE
	       IF NOT (WS-STATUS = "41")
050210		   PERFORM OPEN-ERROR.
044480	     OPEN I-O SPARTS.
044490     IF RUNTIME-ERROR
               IF FLE-LOCKED
040420             GO TO ZA200
               ELSE
               IF FLE-LIMIT
                   GO TO ZA49
               ELSE
	       IF IDX-CORRUPT
                   MOVE 21       TO WS-F-ERROR
                   GO TO ZA50.
044510     IF WS-STATUS NOT = "00"
044520         MOVE 21           TO WS-F-ERROR
	       IF WS-STATUS = "39"
038770		   GO TO ZA50
	       ELSE
	       IF NOT (WS-STATUS = "41")
050210		   PERFORM OPEN-ERROR.
042170	     OPEN I-O PORDER.
042180     IF RUNTIME-ERROR
               IF FLE-LOCKED
042130             GO TO ZA200
               ELSE
               IF FLE-LIMIT
                   GO TO ZA49
               ELSE
	       IF IDX-CORRUPT
                   MOVE 16       TO WS-F-ERROR
                   GO TO ZA50.
050190     IF WS-STATUS NOT = "00"
050200         MOVE 16           TO WS-F-ERROR
	       IF WS-STATUS = "39"
038770		   GO TO ZA50
	       ELSE
	       IF NOT (WS-STATUS = "41")
050210		   PERFORM OPEN-ERROR.
044300	     OPEN I-O LEDTRF.
           IF WS-STATUS = "05"
               CLOSE LEDTRF
               OPEN OUTPUT LEDTRF
               CLOSE LEDTRF
               OPEN I-O LEDTRF.
044310     IF RUNTIME-ERROR
               IF FLE-LOCKED
040420             GO TO ZA200
               ELSE
               IF FLE-LIMIT
                   GO TO ZA49
               ELSE
	       IF IDX-CORRUPT
                   MOVE 40       TO WS-F-ERROR
                   GO TO ZA50.
044330     IF WS-STATUS NOT = "00"
044340         MOVE 40           TO WS-F-ERROR
	       IF WS-STATUS = "39"
038770		   GO TO ZA50
	       ELSE
	       IF NOT (WS-STATUS = "41")
050210		   PERFORM OPEN-ERROR.
044300	     OPEN I-O WARHSE.
           IF WS-STATUS = "05"
	       CLOSE WARHSE
	       OPEN OUTPUT WARHSE
	       CLOSE WARHSE
	       OPEN I-O WARHSE.
044310     IF RUNTIME-ERROR
               IF FLE-LOCKED
040420             GO TO ZA200
               ELSE
               IF FLE-LIMIT
                   GO TO ZA49
               ELSE
	       IF IDX-CORRUPT
		   MOVE 51	 TO WS-F-ERROR
                   GO TO ZA50.
044330     IF WS-STATUS NOT = "00"
044340	       MOVE 51		 TO WS-F-ERROR
	       IF WS-STATUS = "39"
038770		   GO TO ZA50
	       ELSE
	       IF NOT (WS-STATUS = "41")
050210		   PERFORM OPEN-ERROR.
044300	     OPEN I-O WSTOCK.
           IF WS-STATUS = "05"
	       CLOSE WSTOCK
	       OPEN OUTPUT WSTOCK
	       CLOSE WSTOCK
	       OPEN I-O WSTOCK.
044310     IF RUNTIME-ERROR
               IF FLE-LOCKED
040420             GO TO ZA200
               ELSE
               IF FLE-LIMIT
                   GO TO ZA49
               ELSE
	       IF IDX-CORRUPT
		   MOVE 52	 TO WS-F-ERROR
                   GO TO ZA50.
044330     IF WS-STATUS NOT = "00"
044340	       MOVE 52		 TO WS-F-ERROR
	       IF WS-STATUS = "39"
038770		   GO TO ZA50
	       ELSE
	       IF NOT (WS-STATUS = "41")
050210		   PERFORM OPEN-ERROR.
	   IF LS-DEM = 5
	       MOVE "STP\STP093" TO PRG-NAME
	       PERFORM AA100.
039770	     GO TO ZA999.
      *    *************************************************************
      *    ****   F I L E   L I M I T	E X C E E D E D
      * 	  (Config.sys Dos/Win/Windows 95/98/NT/2000)
      * 	  (Config.nt Windows XP/2000)
      * 	  (System.ini Windows.me)
      *    *************************************************************
039780 ZA49.
039790       DISPLAY "Too many files OPEN" AT 0812
039800                WITH FOREGROUND-COLOR 14.
039810	     DISPLAY "Check the FILES option in CONFIG.SYS (Dos,Windows
      -		     "3/95/98/NT/2000)" AT 0908.
	     DISPLAY "CONFIG.NT  (Windows XP/2000)" AT 1034.
	     DISPLAY "SYSTEM.INI (Windows ME)" AT 1134.
039820	     DISPLAY "Press any key to continue" AT 1308.
	     CALL X"AF" USING GET-SINGLE-CHAR, KEY-STATUS.
039840	     GO TO ZA205.
039850 ZA50.
041650	   IF WS-F-ERROR = 3
041660         MOVE "CREDITOR"   TO WS-FILE
041840	   ELSE
041850     IF WS-F-ERROR = 16
041860         MOVE "PURCHASE ORDER"
				 TO WS-FILE
041840	   ELSE
041850     IF WS-F-ERROR = 21
041860         MOVE "PRODUCTION" TO WS-FILE
           ELSE
           IF WS-F-ERROR = 22
               MOVE "STOCK file" TO WS-FILE
           ELSE
           IF WS-F-ERROR = 25
	       MOVE "STOCK MEMO" TO WS-FILE
	   ELSE
041850     IF WS-F-ERROR = 40
041860         MOVE "INTEGRATION"
				 TO WS-FILE
	   ELSE
041850	   IF WS-F-ERROR = 43
041860	       MOVE "CARDEX (SALES)"
				 TO WS-FILE
	   ELSE
041850	   IF WS-F-ERROR = 46
041860	       MOVE "CARDEX (ADJUST)"
				 TO WS-FILE
	   ELSE
041850	   IF WS-F-ERROR = 49
041860	       MOVE "STOCK DESC INDX"
				 TO WS-FILE
	   ELSE
041850	   IF WS-F-ERROR = 51
041860	       MOVE "WAREHOUSE file"
				 TO WS-FILE
           ELSE
041850	   IF WS-F-ERROR = 52
041860	       MOVE "STOCK LOCATION"
				 TO WS-FILE
	   ELSE
041850	   IF WS-F-ERROR = 56
041860	       MOVE "CARDEX (PURCH)"
				 TO WS-FILE.
039980	     DISPLAY "Rebuild " AT 0812
039990                WS-FILE WITH FOREGROUND-COLOR 14.
040000       DISPLAY "Press any key to continue" AT 1012.
	     CALL X"AF" USING GET-SINGLE-CHAR, KEY-STATUS.
040020 ZA51.
040030       EXIT PROGRAM.
      *    *************************************************************
      *    ****  S E T U P   T H E   S C R E E N   G R A P H I C S  ****
      *    *************************************************************
040090 ZA60.
040650	     MOVE LS-COMPANY	 TO WS-TOP-COMP.
	   IF LS-USER = LS-SYS-ID
	       MOVE "Supervisorд"  TO WS-WRKHD
	   ELSE
	       MOVE "Workstation"  TO WS-WRKHD
	       MOVE LS-USER	   TO WS-WRKST.
040660 ZA200.
040670       DISPLAY "Files locked - Try later" AT 2312
040680                WITH FOREGROUND-COLOR 14
040690               " " WS-STATUS WITH FOREGROUND-COLOR 15.
040700       DISPLAY "Press any key" AT 2512 
040710		      WITH BACKGROUND-COLOR 3 FOREGROUND-COLOR 14.
	     CALL X"AF" USING GET-SINGLE-CHAR, KEY-STATUS.
040730 ZA205.
040740       EXIT PROGRAM.
040750 ZA999.
040760       EXIT.

040780 I-O-ERRORS      SECTION  91.
040790 OPEN-ERROR.
040800       DISPLAY CLR-SCREEN.
040810       DISPLAY "Open error" AT 0812 WITH FOREGROUND-COLOR 14.
040820       PERFORM DISPLAY-FILE-NAME.
040830
040840 READ-ERROR.
040850       DISPLAY CLR-SCREEN.
040860       DISPLAY "Read error" AT 0812 WITH FOREGROUND-COLOR 14.
040870       PERFORM DISPLAY-FILE-NAME.
040880
040890 WRITE-ERROR.
040900       DISPLAY CLR-SCREEN.
040910       DISPLAY "Write error" AT 0812 WITH FOREGROUND-COLOR 14.
040920       PERFORM DISPLAY-FILE-NAME.
040930

040950 DISPLAY-FILE-NAME.
040960	   IF WS-F-ERROR = 2
040970         MOVE W02-NETWORK TO WS-FILE
040980         MOVE WS-NETKEY TO WS-KEY
041110	   ELSE
041650	   IF WS-F-ERROR = 3
041660         MOVE W02-CREDIT   TO WS-FILE
041670         MOVE ZERO         TO WS-KEY
               MOVE P-NUMBER     TO WS-KEYX
041840	   ELSE
041850     IF WS-F-ERROR = 16
041860         MOVE W02-PORDER   TO WS-FILE
041870         MOVE ZERO         TO WS-KEY
	       MOVE ORD-KEY	 TO WS-KEYX
041800	   ELSE
041850	   IF WS-F-ERROR = 21
041860         MOVE W02-SPARTS   TO WS-FILE
041870         MOVE ZERO         TO WS-KEY
               MOVE PRT-ITEM     TO WS-KEYX
041840     ELSE
041850     IF WS-F-ERROR = 22
041860         MOVE W02-STOCKF   TO WS-FILE
041870         MOVE ZERO         TO WS-KEY
               MOVE STK-CODE     TO WS-KEYX
041840     ELSE
041850     IF WS-F-ERROR = 25
041860         MOVE W02-STKMEM   TO WS-FILE
041870         MOVE ZERO         TO WS-KEY
	       MOVE SME-KEY	 TO WS-KEYX
041840	   ELSE
041850     IF WS-F-ERROR = 40
041860         MOVE W02-LEDTRF   TO WS-FILE
041870         MOVE ZERO         TO WS-KEY
	       MOVE XFR-KEY	 TO WS-KEYX
041840	   ELSE
041850	   IF WS-F-ERROR = 43
041860	       MOVE W02-CARDEX	 TO WS-FILE
041870         MOVE ZERO         TO WS-KEY
	       MOVE CRD-KEY	 TO WS-KEYX
041840	   ELSE
041850	   IF WS-F-ERROR = 46
041860	       MOVE W02-STKDEX	 TO WS-FILE
041870         MOVE ZERO         TO WS-KEY
	       MOVE STX-KEY	 TO WS-KEYX
041840	   ELSE
041850	   IF WS-F-ERROR = 49
041860	       MOVE W02-STKALT	 TO WS-FILE
041870         MOVE ZERO         TO WS-KEY
	       MOVE STKA-KEY	 TO WS-KEYX
041840	   ELSE
041850	   IF WS-F-ERROR = 51
041860	       MOVE W02-WARHSE	 TO WS-FILE
041870         MOVE ZERO         TO WS-KEY
	       MOVE WAR-CODE	 TO WS-KEYX
041840	   ELSE
041850	   IF WS-F-ERROR = 52
041860	       MOVE W02-WSTOCK	 TO WS-FILE
041870         MOVE ZERO         TO WS-KEY
	       MOVE WST-KEY	 TO WS-KEYX
041840	   ELSE
041850	   IF WS-F-ERROR = 56
041860	       MOVE W02-PURDEX	 TO WS-FILE
041870         MOVE ZERO         TO WS-KEY
	       MOVE PRD-KEY	 TO WS-KEYX.
041350	   IF WS-STATUS = "10"
041360         MOVE "End of FILE" TO WS-STAT-MESSAGE
041370     ELSE
041380     IF WS-STATUS = "22"
041390         MOVE "Duplicate record number" TO WS-STAT-MESSAGE
041400     ELSE
041410     IF WS-STATUS = "23"
041420         MOVE "Invalid record number" TO WS-STAT-MESSAGE
041430     ELSE
041440     IF WS-STATUS = "24"
041450         MOVE "DISK full" TO WS-STAT-MESSAGE
041460     ELSE
041470     IF WS-STATUS = "30"
041480         MOVE "DISK error" TO WS-STAT-MESSAGE
041490     ELSE
041500     IF WS-STATUS = "94"
041510         MOVE "FILE locked" TO WS-STAT-MESSAGE.
041520       DISPLAY "File - " AT 1012 WS-FILE WITH FOREGROUND-COLOR 11.
041530       DISPLAY "Status " AT 1212 
041540                WS-STATUS WITH FOREGROUND-COLOR 11
041550               ": " WS-STAT-MESSAGE WITH FOREGROUND-COLOR 14.
041560     IF WS-STATUS NOT = "94" 
041570         DISPLAY "Key    " AT 1412 
041580                  WS-KEY WITH FOREGROUND-COLOR 11
                        " " WS-KEYX WITH FOREGROUND-COLOR 11
041590         DISPLAY "Reverse backup or contact program Support"
041600                  AT 1612.
041610         DISPLAY "Please make a note of these details" AT 1812.
041620       STOP RUN.
