      $set LINKCOUNT"512"
      ******************************************************************
      *                                                                *
      *  **    **  ********  **	       **     **  ********  **	   **  *
      *  **    **     **     **        ***   ***  **	    ***	   **  *
      *  **    **     **     **        ** * * **  **	    ** *   **  *
      *  **    **     **     **        **  *  **  *****	    **	*  **  *
      *  **    **     **     **        **     **  **	    **	 * **  *
      *  **    **     **     **        **     **  **	    **	  ***  *
      *   ******      **     ********  **     **  *******   **	   **  *
      *                                                                *
      *     ENGLISH                                                    *
      *                                                                *
      *     U T I L I T I E S	M E N U   P R O G R A M 	       *
      *                                                                *
      *     VERSION 8.15.00 - November 2010			       *
      * 							       *
      ******************************************************************
      *    ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ¿
      *    ³		    VERSIONS OF THE APAC SYSTEM		       ³
      *    ÆÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍµ
      *    ³ While developing this system the requirements and budgets ³
      *    ³ (originally this was a propriety package) for various     ³
      *    ³ businesses necessitated that at least 4 separate systems  ³
      *    ³ be produced. As the maintenance and amendments to the 4   ³
      *    ³ different systems would require man hours that would not  ³
      *    ³ enable me to do much development, it was decided to use   ³
      *    ³ one system with the various requirements controlled by    ³
      *    ³ the various menu programs using a version indicator. This ³
      *    ³ indicator is located in the second record of the SYSTEM   ³
      *    ³ file SEC-LEV, which is in the SEC-MODULES. This indicator ³
      *    ³ together with all the other indicators in SEC-MODULES, is ³
      *    ³ moved to WS0-MODULES in BUP000 or BUP001 and then passed  ³
      *    ³ via the LINKAGE SECTION from program to program in  the   ³
      *    ³ LS0-MODULES group. The other indicators in this group are ³
      *    ³ used to show which modules of the system are installed.   ³
      *    ÆÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍµ
      *    ³	SYSTEM FILE    ³      CHAIN.WS	   ³	 CHAIN.LS      ³
      *    ÃÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÅÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÅÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ´
      *	   ³  03  SEC-MODULES. ³  03  WS0-MODULES. ³  03  LS0-MODULES. ³
      *    ³	  05  SEC-DTP  ³      05  WS0-DTP  ³	  05  LS0-DTP  ³
      *    ³	  05  SEC-STP  ³      05  WS0-STP  ³	  05  LS0-STP  ³
      *    ³	  05  SEC-HPD  ³      05  WS0-HPD  ³	  05  LS0-HPD  ³
      *    ³	  05  SEC-CRP  ³      05  WS0-CRP  ³	  05  LS0-CRP  ³
      *    ³	  05  SEC-GLP  ³      05  WS0-GLP  ³	  05  LS0-GLP  ³
      *    ³	  05  SEC-POS  ³      05  WS0-POS  ³	  05  LS0-POS  ³
      *    ³	  05  SEC-JCP  ³      05  WS0-JCP  ³	  05  LS0-JCP  ³
      *    ³	  05  SEC-VHP  ³      05  WS0-VHP  ³	  05  LS0-VHP  ³
      *    ³	  05  SEC-WAG  ³      05  WS0-WAG  ³	  05  LS0-WAG  ³
      *    ³	  05  SEC-SAL  ³      05  WS0-SAL  ³	  05  LS0-SAL  ³
      *    ³	  05  SEC-LEV  ³      05  WS0-LEV  ³	  05  LS0-LEV  ³
      *    ³	  05  SEC-WHS  ³      05  WS0-WHS  ³	  05  LS0-WHS  ³
      *    ³	  05  SEC-RTE  ³      05  WS0-RTE  ³	  05  LS0-RTE  ³
      *	   ³	  05  FILLER   ³		   ³		       ³
      *    ÀÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÁÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÁÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÙ
      *
000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID.     UTILMENU.
000030 AUTHOR.         J W LEMMON (APAC).
000040 DATE-WRITTEN.   OCTOBER 1982.

		   COPYRIGHT NOTICE: COPYRIGHT (C) 1982 - 2011
				     by James William Lemmon.
				       (Id No. 4412165050082).

		   All rights reserved.

		   e-mail jwlemmon@gmail.com.

000050 SECURITY.
		   This program is free software; you can redistribute
		   it and/or modify it under the terms of the GNU General
		   Public License as published by the Free Software
		   Foundation; either version 2 of the License, or (at
		   your option) any later version.

		   This program is distributed in the hope that it will
		   be useful, but WITHOUT ANY WARRANTY; without even the
		   implied warranty of MERCHANTABILITY or FITNESS FOR A
		   PARTICULAR PURPOSE.	See the GNU General Public License
		   for more details.

		   You should have received a copy of the GNU General
		   Public License along with this program; if not, write
		   to the Free Software Foundation, Inc., 59 Temple Place
		   - Suite 330, Boston, MA 02111-1307, USA.

000050 ENVIRONMENT DIVISION.
000060 CONFIGURATION SECTION.
000070 SPECIAL-NAMES.  
000080                 CURSOR IS CSTART
000090		       CONSOLE IS CRT
		       CRT STATUS IS KEY-STATUS.
000100 INPUT-OUTPUT SECTION.
000110 FILE-CONTROL.

       COPY APACFIDS.SL.

       COPY TXTRAN.SL.

      /
000330 DATA DIVISION.
000340 FILE SECTION.

       COPY APACFIDS.FDE.

       COPY TXTRAN.FDE.

      /
000560 WORKING-STORAGE SECTION.
       77  WS-CHECK	   PIC	X(18)	 VALUE
			   "aeWlimemnomLalismJ".
000610 77  WS-S1	   PIC	9(04)	 COMP-5.
000620 77  WS-S2           PIC  9(04)    COMP-5.
000630 77  WS-S3           PIC  9(04)    COMP-5.
000640 77  WS-S4           PIC  9(04)    COMP-5.
       77  WS-TEMP-LIN	   PIC	9(02)	 COMP-5.
       77  WS-OPTION	   PIC	X(01).
       77  PRG-NAME	   PIC	X(12) VALUE SPACES.
000250 77  WS-PASSWORD	   PIC	X(08) VALUE SPACES.
       77  TODAY-DDMMYY	   PIC	9(08) COMP-5.

001350 01  WS-CRT-LINES.
001380	   03  WS-TOP-LNE2.
001390	       05  WS-TCR   PIC  X(80) VALUE "ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ
      -        "ÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ¿".
001400	   03  WS-TP-LINE2 REDEFINES WS-TOP-LNE2.
001410         05  FILLER      PIC  X(01).
001420         05  WS-TOP-COMP PIC  X(40).
001430	       05  FILLER      PIC  X(23).
	       05  WS-WRKHD    PIC  X(11).
001430	       05  FILLER      PIC  X(01).
	       05  WS-WRKST    PIC  X(03).
001430	       05  FILLER      PIC  X(01).
001460	   03  WS-MID-LNE2.
	       05  FILLER      PIC  X(01) VALUE "³".
	       05  WS-BLNK78   PIC  X(78) VALUE ALL "°".
	       05  FILLER      PIC  X(01) VALUE "³".

001840 COPY WS.WS.

000290 01  WS-PARID.
000020	   03  WS-SYS-ID       PIC  X(03).

002040 01  W02-FID.

       COPY APACFIDS.ID.

       COPY PARAM.ID.

       COPY TXTRAN.ID.

       01  BLOCK-DETAIL1.
	   03  ORIGINAL-VID1.
	       05  ORIGINAL-CHAR1 PIC  X(01) OCCURS 80.
	   03  REVERSE-VID1.
	       05  REVERSE-CHAR1  PIC  X(01) OCCURS 80.

       01  SHADOW-DETAIL1.
	   03  SHAD1-ROW       PIC  9(02) COMP-X.
	   03  SHAD1-COL       PIC  9(02) COMP-X.
	   03  SHAD1-LINES     PIC  9(02) COMP-X.
	   03  SHAD1-WIDTH     PIC  9(02) COMP-X.
	   03  SHAD1-CHAR      PIC  X(01).

       01  CRT-DETAIL1.
	   03  TOP-ROW1       PIC  9(02) COMP-X.
	   03  BOTTOM-ROW1     PIC  9(02) COMP-X.
	   03  STRING-LENGTH1  PIC  9(04) COMP-X.
	   03  SCREEN-POSITION1.
	       05  SCREEN-LIN1 PIC  9(02) COMP-X.
	       05  SCREEN-COL1 PIC  9(02) COMP-X.

       01  BLOCK-DETAIL2.
	   03  ORIGINAL-VID2.
	       05  ORIGINAL-CHAR2 PIC  X(01) OCCURS 80.
	   03  REVERSE-VID2.
	       05  REVERSE-CHAR2  PIC  X(01) OCCURS 80.

       01  SHADOW-DETAIL2.
	   03  SHAD2-ROW       PIC  9(02) COMP-X.
	   03  SHAD2-COL       PIC  9(02) COMP-X.
	   03  SHAD2-LINES     PIC  9(02) COMP-X.
	   03  SHAD2-WIDTH     PIC  9(02) COMP-X.
	   03  SHAD2-CHAR      PIC  X(01).

       01  CRT-DETAIL2.
	   03  TOP-ROW2       PIC  9(02) COMP-X.
	   03  BOTTOM-ROW2     PIC  9(02) COMP-X.
	   03  STRING-LENGTH2  PIC  9(04) COMP-X.
	   03  SCREEN-POSITION2.
	       05  SCREEN-LIN2 PIC  9(02) COMP-X.
	       05  SCREEN-COL2 PIC  9(02) COMP-X.

       COPY W40.WS.

       COPY FUNCTION.WS.

004540 COPY W50.WS.

       LINKAGE SECTION.

       COPY CHAIN.LS.

      /
000750 SCREEN SECTION.

       COPY BLANK.CRT.

       01  MENU-INSTRUCT.
	   03  LINE 25 COLUMN  2 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 1
				 VALUE "Use ".
	   03	       COLUMN  6 HIGHLIGHT
				 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 6
				 VALUE "".
	   03	       COLUMN  7 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 1
				 VALUE " or ".
	   03	       COLUMN 11 HIGHLIGHT
				 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 6
				 VALUE "".
	   03	       COLUMN 12 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 1
				 VALUE " to point to an item, and ".
	   03	       COLUMN 38 HIGHLIGHT
				 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 6
				 VALUE "<Enter>".
	   03	       COLUMN 45 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 1
				 VALUE " to Select ".
	   03	       COLUMN 56 HIGHLIGHT
				 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 6
				 VALUE "<Esc>".
	   03	       COLUMN 61 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 1
				 VALUE " to Exit".

       01  S01.
001450	   03  LINE  2 COLUMN 30 BACKGROUND-COLOR 1
				 FOREGROUND-COLOR 7 HIGHLIGHT
001460				 VALUE "UTILITIES CONTROL MENU".

       01  S02.
	   03  LINE  4 COLUMN  7 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 2 HIGHLIGHT
				 VALUE "ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ".
	   03	       COLUMN 28 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 0
				 VALUE "¿".
	   03  LINE  5 COLUMN  7 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 2 HIGHLIGHT
				 VALUE "³  ".
	   03	       COLUMN 10 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "UTILITY CONTROL".
	   03	       COLUMN 25 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 0
				 VALUE "   ³".
	   03  LINE  6 COLUMN  7 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 2 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN  9 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "1".
	   03	       COLUMN 10 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 0
				 VALUE " Parameters       ³".
001470	   03  LINE  7 COLUMN  7 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 2 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN  9 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "2".
	   03	       COLUMN 10 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 0
				 VALUE " Rebuild Files    ³".
001470	   03  LINE  8 COLUMN  7 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 2 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN  9 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "3".
	   03	       COLUMN 10 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 0
				 VALUE " Delivery Routes  ³".
001470	   03  LINE  9 COLUMN  7 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 2 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN  9 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "4".
	   03	       COLUMN 10 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 0
				 VALUE " Clear USER Log   ³".
001570	   03  LINE 10 COLUMN  7 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 2 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN  9 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "5".
	   03	       COLUMN 10 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 0
				 VALUE " Clear Values     ³".
001570	   03  LINE 11 COLUMN  7 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 2 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN  9 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "6".
	   03	       COLUMN 10 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 0
				 VALUE " Purge Cardex File³".
001570	   03  LINE 12 COLUMN  7 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 2 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN  9 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "0".
	   03	       COLUMN 10 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 0
				 VALUE " Exit	          ³".
	   03  LINE 13 COLUMN  7 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 2 HIGHLIGHT
				 VALUE "À".
	   03	       COLUMN  8 BACKGROUND-COLOR 2
				 FOREGROUND-COLOR 0
				 VALUE "ÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÙ".

       01  S03.
	   03  LINE  6 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ".
	   03	       COLUMN 45 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE "¿".
	   03  LINE  7 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "³  ".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "REBUILD FILES".
	   03	       COLUMN 42 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE "   ³".
	   03  LINE  8 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "1".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Creditors      ³".
001470	   03  LINE  9 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "2".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Debtors        ³".
001570	   03  LINE 10 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "3".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " General Ledger ³".
001500	   03  LINE 11 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "4".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Job Costing    ³".
001500	   03  LINE 12 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "5".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Stock          ³".
	   03  LINE 13 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "6".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Sundry         ³".
	   03  LINE 14 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "0".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Exit	        ³".
	   03  LINE 15 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "À".
	   03	       COLUMN 27 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE "ÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÙ".

       01  S04.
	   03  LINE  8 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ".
	   03	       COLUMN 63 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "¿".
	   03  LINE  9 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³  ".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "CREDITOR FILES".
	   03	       COLUMN 61 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "  ³".
	   03  LINE 10 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "1".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Account File   ³".
	   03  LINE 11 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "2".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Purchase Orders³".
	   03  LINE 12 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "3".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " PD Cheques     ³".
	   03  LINE 13 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "4".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Transactions   ³".
	   03  LINE 14 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "5".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Memo/Remarks   ³".
	   03  LINE 15 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "6".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Cardex (Purch) ³".
	   03  LINE 16 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "0".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Exit           ³".
	   03  LINE 17 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "À".
	   03	       COLUMN 45 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "ÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÙ".

       01  S05.
	   03  LINE  8 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ".
	   03	       COLUMN 63 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "¿".
	   03  LINE  9 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³   ".
	   03	       COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "DEBTOR FILES".
	   03	       COLUMN 60 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "   ³".
	   03  LINE 10 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "1".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Account File   ³".
	   03  LINE 11 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "2".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Invoice File   ³".
	   03  LINE 12 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "3".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Memo/Remarks   ³".
	   03  LINE 13 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "4".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Sales Orders   ³".
	   03  LINE 14 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "5".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Transactions   ³".
	   03  LINE 15 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "6".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Rec.Transact's ³".
	   03  LINE 16 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "7".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " ALT NAME Index ³".
	   03  LINE 17 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "0".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Exit           ³".
	   03  LINE 18 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "À".
	   03	       COLUMN 45 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "ÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÙ".

       01  S06.
	   03  LINE  8 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ".
	   03	       COLUMN 63 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "¿".
	   03  LINE  9 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³  ".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "GENERAL LEDGER".
	   03	       COLUMN 61 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "  ³".
	   03  LINE 10 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "1".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Account File   ³".
	   03  LINE 11 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "2".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Batch File     ³".
	   03  LINE 12 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "3".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Integration    ³".
	   03  LINE 13 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "4".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Transactions   ³".
	   03  LINE 14 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "5".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Cheque Batch   ³".
	   03  LINE 15 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "0".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Exit           ³".
	   03  LINE 16 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "À".
	   03	       COLUMN 45 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "ÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÙ".

       01  S07.
	   03  LINE  8 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ".
	   03	       COLUMN 63 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "¿".
	   03  LINE  9 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³   ".
	   03	       COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "JOB COSTING".
	   03	       COLUMN 59 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "    ³".
	   03  LINE 10 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "1".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Job File       ³".
	   03  LINE 11 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "2".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Job Types      ³".
	   03  LINE 12 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "3".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Requisitions   ³".
	   03  LINE 13 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "4".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Rev. Warranty  ³".
	   03  LINE 14 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "0".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Exit           ³".
	   03  LINE 15 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "À".
	   03	       COLUMN 45 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "ÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÙ".

       01  S08.
	   03  LINE  8 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ".
	   03	       COLUMN 63 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "¿".
	   03  LINE  9 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³   ".
	   03	       COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "STOCK FILES".
	   03	       COLUMN 59 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "    ³".
	   03  LINE 10 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "1".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Memo/Remarks   ³".
	   03  LINE 11 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "2".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Production     ³".
	   03  LINE 12 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "3".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Stock File     ³".
	   03  LINE 13 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "4".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Cardex File    ³".
	   03  LINE 14 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "5".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Warehouse File ³".
	   03  LINE 15 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "6".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " W/H Stock File ³".
	   03  LINE 16 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "0".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Exit           ³".
	   03  LINE 17 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "À".
	   03	       COLUMN 45 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "ÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÙ".

       01  S09.
	   03  LINE  8 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ".
	   03	       COLUMN 63 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "¿".
	   03  LINE  9 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³  ".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "SUNDRY FILES".
	   03	       COLUMN 59 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "    ³".
	   03  LINE 10 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "1".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Cheques        ³".
	   03  LINE 11 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "2".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Guarantees     ³".
	   03  LINE 12 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "3".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Tax (VAT)      ³".
	   03  LINE 13 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "4".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Cash Slips     ³".
	   03  LINE 14 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "5".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Department     ³".
	   03  LINE 15 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 46 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "0".
	   03	       COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Exit           ³".
	   03  LINE 16 COLUMN 44 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "À".
	   03	       COLUMN 45 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "ÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÙ".

002330 01  S11.
	   02  S11A.
	   03  LINE 23 COLUMN 12 FOREGROUND-COLOR 6 HIGHLIGHT
				 VALUE "Password:".
	   02  S11B.
002340	   03  LINE 23 COLUMN 22 PIC  X(08)
002350                           USING WS-PASSWORD SECURE AUTO.

       01  S12.
	   03  LINE  6 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ".
	   03	       COLUMN 49 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE "¿".
	   03  LINE  7 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "³      ".
	   03	       COLUMN 33 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "PARAMETERS".
	   03	       COLUMN 43 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE "      ³".
	   03  LINE  8 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "1".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Company/Staff Data ³".
001470	   03  LINE  9 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "2".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Transaction Codes  ³".
001570	   03  LINE 10 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "3".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Printer Details    ³".
001500	   03  LINE 11 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "4".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Tax/Int/Disc Rates ³".
001500	   03  LINE 12 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "5".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Account Numbers    ³".
	   03  LINE 13 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "6".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Sundry Parameters  ³".
	   03  LINE 14 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "7".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Cheque Printing    ³".
	   03  LINE 15 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "8".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Inhouse Bar Codes  ³".
	   03  LINE 16 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "A".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Bar Code Labels    ³".
	   03  LINE 17 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "B".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Stock Conv. Factor ³".
	   03  LINE 18 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 28 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "0".
	   03	       COLUMN 29 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE " Exit	            ³".
	   03  LINE 19 COLUMN 26 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 3 HIGHLIGHT
				 VALUE "À".
	   03	       COLUMN 27 BACKGROUND-COLOR 3
				 FOREGROUND-COLOR 0
				 VALUE "ÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÙ".

       01  S13.
	   03  LINE  8 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ".
	   03	       COLUMN 69 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "¿".
	   03  LINE  9 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "COMPANY/STAFF DATA".
	   03	       COLUMN 67 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "  ³".
	   03  LINE 10 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "1".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Company Details   ³".
	   03  LINE 11 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "2".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Debtor Categories ³".
	   03  LINE 12 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "3".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Sales Ledgers     ³".
	   03  LINE 13 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "4".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Sales Staff Data  ³".
	   03  LINE 14 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "5".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Technicians Data  ³".
	   03  LINE 15 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "6".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Branch Details    ³".
	   03  LINE 16 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "7".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Bank Details      ³".
	   03  LINE 17 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "0".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Exit              ³".
	   03  LINE 18 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "À".
	   03	       COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "ÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÙ".

       01  S14.
	   03  LINE  8 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ".
	   03	       COLUMN 67 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "¿".
	   03  LINE  9 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "TRANSACTION CODES".
	   03	       COLUMN 66 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " ³".
	   03  LINE 10 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "1".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Creditor Codes  ³".
	   03  LINE 11 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "2".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Debtor Codes    ³".
	   03  LINE 12 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "0".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Exit            ³".
	   03  LINE 13 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "À".
	   03	       COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "ÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÙ".

       01  S15.
	   03  LINE  8 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ".
	   03	       COLUMN 74 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "¿".
	   03  LINE  9 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³   ".
	   03	       COLUMN 51 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "PRINTERS/STATIONERY".
	   03	       COLUMN 70 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "    ³".
	   03  LINE 10 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "1".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Printer Specifications ³".
	   03  LINE 11 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "2".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Supervisor Printers    ³".
	   03  LINE 12 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "3".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Work Station Printers  ³".
	   03  LINE 13 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "4".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Cash Slip Headings     ³".
	   03  LINE 14 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "5".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Cash Slip/Drawer Cont. ³".
	   03  LINE 15 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "6".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Statement/Inv. Formats ³".
	   03  LINE 16 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "7".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Statement/Inv. Heading ³".
	   03  LINE 17 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "8".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Consol. Statements     ³".
	   03  LINE 18 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "A".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Stm Det. Lines USB/WIN ³".
	   03  LINE 19 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "0".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Exit                   ³".
	   03  LINE 20 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "À".
	   03	       COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "ÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÙ".

       01  S16.
	   03  LINE  8 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ".
	   03	       COLUMN 69 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "¿".
	   03  LINE  9 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "TAX/INT/DISC RATES".
	   03	       COLUMN 67 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "  ³".
	   03  LINE 10 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "1".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Value Added Tax   ³".
	   03  LINE 11 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "2".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Ad-Valorem Tax    ³".
	   03  LINE 12 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "3".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Arrear Interest   ³".
	   03  LINE 13 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "4".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Settlement Discnt.³".
	   03  LINE 14 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "0".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Exit              ³".
	   03  LINE 15 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "À".
	   03	       COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "ÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÙ".

       01  S17.
	   03  LINE  8 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ".
	   03	       COLUMN 67 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "¿".
	   03  LINE  9 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³  ".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "ACCOUNT NUMBERS".
	   03	       COLUMN 65 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "  ³".
	   03  LINE 10 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "1".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Cash Sales      ³".
	   03  LINE 11 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "2".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " General Ledger  ³".
	   03  LINE 12 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "0".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Exit            ³".
	   03  LINE 13 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "À".
	   03	       COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "ÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÙ".

       01  S18.
	   03  LINE  8 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ".
	   03	       COLUMN 69 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "¿".
	   03  LINE  9 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³  ".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "SUNDRY PARAMETERS".
	   03	       COLUMN 67 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "  ³".
	   03  LINE 10 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "1".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Starting Numbers  ³".
	   03  LINE 11 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "2".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Price Rounding    ³".
	   03  LINE 12 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "3".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " System Passwords  ³".
	   03  LINE 13 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "4".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Minimum Margin    ³".
	   03  LINE 14 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "5".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Cost Codes        ³".
	   03  LINE 15 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "6".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Debtor Title Codes³".
	   03  LINE 16 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "7".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Special Routines  ³".
	   03  LINE 17 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "8".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Cash Voucher Code ³".
	   03  LINE 18 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "A".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Batch/Realtime POS³".
	   03  LINE 19 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "B".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Cash Slip Rounding³".
	   03  LINE 20 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "C".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Article 11/1g(VAT)³".
	   03  LINE 21 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "D".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Stock Conv.Factor ³".
	   03  LINE 22 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "³ ".
	   03	       COLUMN 49 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7
				 HIGHLIGHT
				 VALUE "0".
	   03	       COLUMN 50 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE " Exit              ³".
	   03  LINE 23 COLUMN 47 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 7 HIGHLIGHT
				 VALUE "À".
	   03	       COLUMN 48 BACKGROUND-COLOR 7
				 FOREGROUND-COLOR 0
				 VALUE "ÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÙ".

       COPY ERROR.CRT.

      /
001230 PROCEDURE DIVISION
		 USING LS-PARID LS-USER-ID LS0-PROGRAMS LS0-SECURITY.
       AA000	       SECTION.
       AA00.
003240	   IF LS0-PALEV < 1 AND LS0-SALEV < 4
	       MOVE "Not Authorised"
				 TO WS-ERR-STRING
003260	       PERFORM ERROR-MESSAGE
	       GO TO AA99.
	     PERFORM ZA000-INIT.
	     DISPLAY CLR-L1-2.
	     DISPLAY S01.
	     PERFORM BA000.
	   IF MOUSE-ATTACHED = "Y"
	       MOVE 66		 TO MOUSE-FUNC
	       MOVE 0		 TO MOUSE-PARAM
	       CALL X"AF" USING MOUSE-FUNC
				MOUSE-PARAM.
013140 AA99.
013150       EXIT PROGRAM.

       AA100	       SECTION.
       AA101.
	   IF MOUSE-ATTACHED = "Y"
	       MOVE 66		 TO MOUSE-FUNC
	       MOVE 0		 TO MOUSE-PARAM
	       CALL X"AF" USING MOUSE-FUNC
				MOUSE-PARAM.
	     PERFORM SAVE-SCREEN-3.
	     CALL PRG-NAME
		  USING LS-PARID LS-USER-ID LS0-PROGRAMS LS0-SECURITY
		  ON EXCEPTION
		      GO TO AA110
	     END-CALL.
	     CANCEL PRG-NAME.
       AA105.
	     PERFORM RESTORE-SCREEN-3.
	   IF MOUSE-ATTACHED = "Y"
	       MOVE 66		 TO MOUSE-FUNC
	       MOVE 1		 TO MOUSE-PARAM
	       CALL X"AF" USING MOUSE-FUNC
				MOUSE-PARAM.
	     GO TO AA199.
       AA110.
	     MOVE SPACE 	 TO WS-ERR-MES.
	     STRING "Program- " DELIMITED SIZE
		     PRG-NAME DELIMITED " "
		     " not on disk, press ANY key"
		     DELIMITED SIZE
		     INTO WS-ERR-MES.
	     MOVE W43-SCREEN	 TO W43-SCREEN2.
	     MOVE W42-ATTRIB	 TO W42-ATTRIB2.
	     PERFORM ERROR-LENGTH THRU ERROR-EXIT.
	     MOVE W43-SCREEN2	 TO W43-SCREEN.
	     MOVE W42-ATTRIB2	 TO W42-ATTRIB.
	     GO TO AA105.

       AA199.
	     EXIT.

      /    *************************************************************
      *    ****    ROUTINES TO HANDLE VARIOUS FUNCTIONS FOR THE
      * 	   S C R E E N ,   K E Y B O A R D   &	 M O U S E
      *    *************************************************************
      *    ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ¿
      *    ³	   SAVE-SCREEN /-2/-3  and  RESTORE-SCREEN /-2/-3      ³
      *    ÆÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍµ
      *    ³			  SCREEN-SHADOW 		       ³
      *    ÃÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ´
      *    ³ To routine is used to display a shadow down the right and ³
      *    ³ along the bottom of a pop-up box. The parameters that are ³
      *    ³ required:						       ³
      *	   ³	       SHADE-ROW   - Top line of the box + 1.	       ³
      *	   ³	       SHADE-COL   - Left line of box + 2.	       ³
      *	   ³	       SHADE-WIDTH - Width of the box - 2.	       ³
      *	   ³	       SHADE-LINES - Hight of box - 1.		       ³
      *    ÆÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍµ
      *    ³			  ERROR-MESSAGE 		       ³
      *    ÃÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ´
      *    ³ To display an error message with " - Press ANY key" at    ³
      *    ³ the end; use PERFORM ERROR-MESSAGE.		       ³
      *    ³							       ³
      *    ³ To display just the error message; use PERFORM	       ³
      *    ³ ERROR-LENGTH THRU ERROR-EXIT.			       ³
      *    ³							       ³
      *    ³ To display the error message higher or lower (default is  ³
      *    ³ line 13) firstly use PERFORM ERROR-SETUP THRU ERROR-POS   ³
      *    ³ or PERFORM ERROR-LENGTH THRU ERROR-POS. Move the line     ³
      *    ³ number to be used to SLIN and then PERFORM ERROR-DISPLAY  ³
      *    ³ THRU ERROR-EXIT.					       ³
      *    ÀÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÙ
       COPY FUNCTION.SCR.

       COPY ERROR.SCR.

011433 COPY CLEAR.CRT.

       BA000	       SECTION.
       BA00.
	     MOVE 5		 TO SHADE-ROW.
	     MOVE 9		 TO SHADE-COL.
	     MOVE 20		 TO SHADE-WIDTH.
	     MOVE 9		 TO SHADE-LINES.
	     DISPLAY S02.
	   IF (LS0-LEV < 4) OR (LS0-RTE = 0)
	       DISPLAY " Del. Routes (N/A)³" AT 0810
			WITH BACKGROUND-COLOR 2 FOREGROUND-COLOR 0.
	   IF (LS0-LEV < 3)
	       DISPLAY " Purge Cardex(N/A)³" AT 1110
			WITH BACKGROUND-COLOR 2 FOREGROUND-COLOR 0.
	     DISPLAY MENU-INSTRUCT.
	     PERFORM SCREEN-SHADOW.
       BA02.
	     MOVE 5		 TO TOP-ROW.
	     MOVE 11		 TO BOTTOM-ROW.
	     MOVE 4		 TO SCREEN-LIN.
	     MOVE 9		 TO SCREEN-COL.
	     MOVE 18		 TO STRING-LENGTH.
	     PERFORM SAVE-ATTR.
	   IF LS-OK = "Z"
	       MOVE SPACE	 TO LS-OK
	       MOVE 1		 TO WS-OPTION
	       GO TO BA16.

       BA05.
	     CALL X"AF" USING GET-SINGLE-CHAR, KEY-STATUS.

       BA10.
	   IF ADIS-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN UP-KEY	 PERFORM MOVE-BLOCK-UP
		 WHEN DOWN-KEY	 PERFORM MOVE-BLOCK-DOWN
		 WHEN MOUSE-KEY  PERFORM POSITION-MOUSE
				 IF MOUSE-ENTER = "Y"
				     MOVE "N"	 TO MOUSE-ENTER
				     GO TO BA15
				 END-IF
				 IF MOUSE-Y = 24
				     IF MOUSE-X = 5
					 MOVE 5  TO KEY-CODE-1
					 GO TO BA10
				     ELSE
				     IF MOUSE-X = 10
					 MOVE 6  TO KEY-CODE-1
					 GO TO BA10
				     ELSE
				     IF MOUSE-X > 36 AND < 44
					 MOVE 0  TO KEY-CODE-1
					 GO TO BA10
				     ELSE
				     IF MOUSE-X > 54 AND < 60
					 MOVE 0  TO KEY-CODE-1
					 MOVE 1  TO KEY-TYPE
					 GO TO BA10
				     END-IF
				 END-IF
		 WHEN ENTER-KEY  GO TO BA15
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO BA05
	   ELSE
	   IF USER-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN ESC-KEY
		     MOVE "0"	 TO WS-OPTION
		     GO TO BA18
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO BA05
	   ELSE
	   IF DATA-8BIT
	       MOVE KEY-CODE-1X  TO WS-OPTION
	       CALL "CBL_TOUPPER" USING WS-OPTION
				  BY VALUE WS-LENGTH
				  RETURNING WS-STATUS
	       IF (WS-OPTION < 0 OR > 6) AND
		  (WS-OPTION NOT = "S")
		   CALL X"E5"
		   GO TO BA05
	       END-IF
	       GO TO BA16
	   ELSE
	       CALL X"E5"
	       GO TO BA05.

       BA15.
	   IF SCREEN-LIN < 5
	       CALL X"E5"
	       GO TO BA05
	   ELSE
	   IF SCREEN-LIN = 5
	       MOVE "1"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 6
	       MOVE "2"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 7
	       MOVE "3"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 8
	       MOVE "4"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 9
	       MOVE "5"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 10
	       MOVE "6"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 11
	       MOVE "0"		 TO WS-OPTION.
	   GO TO BA18.

       BA16.
	     PERFORM CLEAR-BLOCK.
	   IF WS-OPTION = "0" OR "S"
	       MOVE 11		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "1"
	       MOVE 5		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "2"
	       MOVE 6		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "3"
	       MOVE 7		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "4"
	       MOVE 8		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "5"
	       MOVE 9		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "6"
	       MOVE 10		 TO SCREEN-LIN.
	     PERFORM SAVE-ATTR.
	     PERFORM MARK-BLOCK.

       BA18.
	   IF WS-OPTION = "0"
	       GO TO BA999.
	     PERFORM SAVE-SCREEN.
	     MOVE BLOCK-DETAIL	 TO BLOCK-DETAIL1.
	     MOVE SHADOW-DETAIL  TO SHADOW-DETAIL1.
	     MOVE CRT-DETAIL	 TO CRT-DETAIL1.
	   IF WS-OPTION = "1"
	       PERFORM GA000
	   ELSE
	   IF WS-OPTION = "2"
	       PERFORM CA000
	   ELSE
	   IF WS-OPTION = "3"
	       PERFORM DA000
	   ELSE
	   IF WS-OPTION = "4"
	       PERFORM EA000
	   ELSE
	   IF WS-OPTION = "5"
	       PERFORM FA000
	   ELSE
	   IF WS-OPTION = "6"
	       PERFORM IA000
	   ELSE
	   IF WS-OPTION = "S"
	       PERFORM HA000.
	     PERFORM RESTORE-SCREEN.
	     MOVE BLOCK-DETAIL1  TO BLOCK-DETAIL.
	     MOVE SHADOW-DETAIL1 TO SHADOW-DETAIL.
	     MOVE CRT-DETAIL1	 TO CRT-DETAIL.
	     GO TO BA05.
       BA999.
	     EXIT.

      /
      *    ****    R E B U I L D   F I L E S
      *
       CA000	       SECTION 50.
       CA00.
	     MOVE SPACES	 TO WS-PASSWORD.
	     DISPLAY S11A.
	     ACCEPT S11B.
006080	     MOVE 8 TO WS-LENGTH.
	     CALL "CBL_TOUPPER" USING WS-PASSWORD
				BY VALUE WS-LENGTH
				RETURNING WS-STATUS.
006140	     MOVE 1 TO WS-LENGTH.
	     DISPLAY WS-BLNK78 AT 2302
		     WITH BACKGROUND-COLOR 1 FOREGROUND-COLOR 3.
006150	   IF WS-PASSWORD NOT = "APACFILE"
	       GO TO CA999.
	     MOVE 7		 TO SHADE-ROW.
	     MOVE 28		 TO SHADE-COL.
	     MOVE 18		 TO SHADE-WIDTH.
	     MOVE 9		 TO SHADE-LINES.
	     DISPLAY S03.
	   IF LS0-LEV < 1
	       DISPLAY ".N/A" AT 1041
			WITH BACKGROUND-COLOR 3 FOREGROUND-COLOR 0.
	   IF (LS0-LEV < 4) AND (LS0-JCP = 0)
	       DISPLAY "N/A" AT 1142
			WITH BACKGROUND-COLOR 3 FOREGROUND-COLOR 0.
	     DISPLAY MENU-INSTRUCT.
	     PERFORM SCREEN-SHADOW.
	     MOVE 7		 TO TOP-ROW.
	     MOVE 13		 TO BOTTOM-ROW.
	     MOVE 6		 TO SCREEN-LIN.
	     MOVE 28		 TO SCREEN-COL.
	     MOVE 16		 TO STRING-LENGTH.
	     PERFORM SAVE-ATTR.

       CA05.
	     CALL X"AF" USING GET-SINGLE-CHAR, KEY-STATUS.

       CA10.
	   IF ADIS-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN UP-KEY	 PERFORM MOVE-BLOCK-UP
		 WHEN DOWN-KEY	 PERFORM MOVE-BLOCK-DOWN
		 WHEN MOUSE-KEY  PERFORM POSITION-MOUSE
				 IF MOUSE-ENTER = "Y"
				     MOVE "N"	 TO MOUSE-ENTER
				     GO TO CA15
				 END-IF
				 IF MOUSE-Y = 24
				     IF MOUSE-X = 5
					 MOVE 5  TO KEY-CODE-1
					 GO TO CA10
				     ELSE
				     IF MOUSE-X = 10
					 MOVE 6  TO KEY-CODE-1
					 GO TO CA10
				     ELSE
				     IF MOUSE-X > 36 AND < 44
					 MOVE 0  TO KEY-CODE-1
					 GO TO CA10
				     ELSE
				     IF MOUSE-X > 54 AND < 60
					 MOVE 0  TO KEY-CODE-1
					 MOVE 1  TO KEY-TYPE
					 GO TO CA10
				     END-IF
				 END-IF
		 WHEN ENTER-KEY  GO TO CA15
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO CA05
	   ELSE
	   IF USER-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN ESC-KEY
		     MOVE "0"	 TO WS-OPTION
		     GO TO CA18
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO CA05
	   ELSE
	   IF DATA-8BIT
	       MOVE KEY-CODE-1X  TO WS-OPTION
	       IF WS-OPTION < 0 OR > 6
		   CALL X"E5"
		   GO TO CA05
	       END-IF
	       GO TO CA16
	   ELSE
	       CALL X"E5"
	       GO TO CA05.

       CA15.
	   IF SCREEN-LIN < 7
	       CALL X"E5"
	       GO TO CA05
	   ELSE
	   IF SCREEN-LIN = 7
	       MOVE "1"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 8
	       MOVE "2"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 9
	       MOVE "3"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 10
	       MOVE "4"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 11
	       MOVE "5"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 12
	       MOVE "6"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 13
	       MOVE "0"		 TO WS-OPTION.
	   GO TO CA18.

       CA16.
	     PERFORM CLEAR-BLOCK.
	   IF WS-OPTION = "0"
	       MOVE 13		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "1"
	       MOVE 7		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "2"
	       MOVE 8		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "3"
	       MOVE 9		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "4"
	       MOVE 10		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "5"
	       MOVE 11		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "6"
	       MOVE 12		 TO SCREEN-LIN.
	     PERFORM SAVE-ATTR.
	     PERFORM MARK-BLOCK.

       CA18.
	   IF WS-OPTION = "0"
	       GO TO CA999.
	     PERFORM SAVE-SCREEN-2.
	     MOVE BLOCK-DETAIL	 TO BLOCK-DETAIL2.
	     MOVE SHADOW-DETAIL	 TO SHADOW-DETAIL2.
	     MOVE CRT-DETAIL	 TO CRT-DETAIL2.
	   IF WS-OPTION = "1"
	       PERFORM CB000
	   ELSE
	   IF WS-OPTION = "2"
	       PERFORM CC000
	   ELSE
	   IF WS-OPTION = "3"
	       PERFORM CD000
	   ELSE
	   IF WS-OPTION = "4"
	       PERFORM CE000
	   ELSE
	   IF WS-OPTION = "5"
	       PERFORM CF000
	   ELSE
	       PERFORM CG000.
	     PERFORM RESTORE-SCREEN-2.
	     MOVE BLOCK-DETAIL2  TO BLOCK-DETAIL.
	     MOVE SHADOW-DETAIL2 TO SHADOW-DETAIL.
	     MOVE CRT-DETAIL2	 TO CRT-DETAIL.
	     GO TO CA05.

       CA20.
	     DISPLAY CLEAR-L25.
003250	     DISPLAY "Not Authorised - Press any key" AT 2512
003260		      WITH BACKGROUND-COLOR 3
			   FOREGROUND-COLOR 6 HIGHLIGHT.
	     CALL X"AF" USING GET-SINGLE-CHAR, KEY-STATUS.


       CA999.
	     EXIT.
      *
      *    ****    R E B U I L D   C R E D I T O R   F I L E S
      *
       CB000	       SECTION 50.
       CB0.
003240	   IF LS0-CRED = "N" OR LS0-CRLEV < 9
	       PERFORM CA20
	       GO TO CB999.

       CB00.
	     MOVE 9		 TO SHADE-ROW.
	     MOVE 46		 TO SHADE-COL.
	     MOVE 18		 TO SHADE-WIDTH.
	     MOVE 9		 TO SHADE-LINES.
	     DISPLAY S04.
	     DISPLAY MENU-INSTRUCT.
	     PERFORM SCREEN-SHADOW.
	     MOVE 9		 TO TOP-ROW.
	     MOVE 15		 TO BOTTOM-ROW.
	     MOVE 8		 TO SCREEN-LIN.
	     MOVE 46		 TO SCREEN-COL.
	     MOVE 16		 TO STRING-LENGTH.
	     PERFORM SAVE-ATTR.

       CB05.
	     CALL X"AF" USING GET-SINGLE-CHAR, KEY-STATUS.

       CB10.
	   IF ADIS-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN UP-KEY	 PERFORM MOVE-BLOCK-UP
		 WHEN DOWN-KEY	 PERFORM MOVE-BLOCK-DOWN
		 WHEN MOUSE-KEY  PERFORM POSITION-MOUSE
				 IF MOUSE-ENTER = "Y"
				     MOVE "N"	 TO MOUSE-ENTER
				     GO TO CB15
				 END-IF
				 IF MOUSE-Y = 24
				     IF MOUSE-X = 5
					 MOVE 5  TO KEY-CODE-1
					 GO TO CB10
				     ELSE
				     IF MOUSE-X = 10
					 MOVE 6  TO KEY-CODE-1
					 GO TO CB10
				     ELSE
				     IF MOUSE-X > 36 AND < 44
					 MOVE 0  TO KEY-CODE-1
					 GO TO CB10
				     ELSE
				     IF MOUSE-X > 54 AND < 60
					 MOVE 0  TO KEY-CODE-1
					 MOVE 1  TO KEY-TYPE
					 GO TO CB10
				     END-IF
				 END-IF
		 WHEN ENTER-KEY  GO TO CB15
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO CB05
	   ELSE
	   IF USER-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN ESC-KEY
		     MOVE "0"	 TO WS-OPTION
		     GO TO CB18
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO CB05
	   ELSE
	   IF DATA-8BIT
	       MOVE KEY-CODE-1X  TO WS-OPTION
	       IF WS-OPTION < 0 OR > 6
		   CALL X"E5"
		   GO TO CB05
	       END-IF
	       GO TO CB16
	   ELSE
	       CALL X"E5"
	       GO TO CB05.

       CB15.
	   IF SCREEN-LIN < 9
	       CALL X"E5"
	       GO TO CB05
	   ELSE
	   IF SCREEN-LIN = 9
	       MOVE "1"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 10
	       MOVE "2"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 11
	       MOVE "3"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 12
	       MOVE "4"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 13
	       MOVE "5"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 14
	       MOVE "6"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 15
	       MOVE "0"		 TO WS-OPTION.
	   GO TO CB18.

       CB16.
	     PERFORM CLEAR-BLOCK.
	   IF WS-OPTION = "0"
	       MOVE 15		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "1"
	       MOVE 9		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "2"
	       MOVE 10		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "3"
	       MOVE 11		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "4"
	       MOVE 12		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "5"
	       MOVE 13		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "6"
	       MOVE 14		 TO SCREEN-LIN.
	     PERFORM SAVE-ATTR.
	     PERFORM MARK-BLOCK.

       CB18.
	     CALL "CBL_TOUPPER" USING WS-OPTION
				BY VALUE WS-LENGTH
				RETURNING WS-STATUS.
	   IF WS-OPTION = "0"
	       GO TO CB999.
	   IF WS-OPTION < 1 OR > 6
	       CALL X"E5"
	       GO TO CB05.
	   IF WS-OPTION = "1"
	       MOVE "UTP\CRDREB" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "2"
	       MOVE "UTP\PURREB" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "3"
	       MOVE "UTP\PDCREB" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "4"
	       MOVE "UTP\CRTREB" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "5"
	       MOVE "UTP\CRMREB" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "6"
	       MOVE "UTP\PRDREB" TO PRG-NAME.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.
	     GO TO CB05.

       CB999.
	     EXIT.
      *
      *    ****    R E B U I L D   D E B T O R	 F I L E S
      *
       CC000	       SECTION 50.
       CC0.
003240	   IF LS0-DEBT = "N" OR LS0-DBLEV < 9
	       PERFORM CA20
	       GO TO CC999.

       CC00.
	     MOVE 9		 TO SHADE-ROW.
	     MOVE 46		 TO SHADE-COL.
	     MOVE 18		 TO SHADE-WIDTH.
	     MOVE 10		 TO SHADE-LINES.
	     DISPLAY S05.
	     DISPLAY MENU-INSTRUCT.
	     PERFORM SCREEN-SHADOW.
	     MOVE 9		 TO TOP-ROW.
	     MOVE 16		 TO BOTTOM-ROW.
	     MOVE 8		 TO SCREEN-LIN.
	     MOVE 46		 TO SCREEN-COL.
	     MOVE 16		 TO STRING-LENGTH.
	     PERFORM SAVE-ATTR.

       CC05.
	     CALL X"AF" USING GET-SINGLE-CHAR, KEY-STATUS.

       CC10.
	   IF ADIS-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN UP-KEY	 PERFORM MOVE-BLOCK-UP
		 WHEN DOWN-KEY	 PERFORM MOVE-BLOCK-DOWN
		 WHEN MOUSE-KEY  PERFORM POSITION-MOUSE
				 IF MOUSE-ENTER = "Y"
				     MOVE "N"	 TO MOUSE-ENTER
				     GO TO CC15
				 END-IF
				 IF MOUSE-Y = 24
				     IF MOUSE-X = 5
					 MOVE 5  TO KEY-CODE-1
					 GO TO CC10
				     ELSE
				     IF MOUSE-X = 10
					 MOVE 6  TO KEY-CODE-1
					 GO TO CC10
				     ELSE
				     IF MOUSE-X > 36 AND < 44
					 MOVE 0  TO KEY-CODE-1
					 GO TO CC10
				     ELSE
				     IF MOUSE-X > 54 AND < 60
					 MOVE 0  TO KEY-CODE-1
					 MOVE 1  TO KEY-TYPE
					 GO TO CC10
				     END-IF
				 END-IF
		 WHEN ENTER-KEY  GO TO CC15
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO CC05
	   ELSE
	   IF USER-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN ESC-KEY
		     MOVE "0"	 TO WS-OPTION
		     GO TO CC18
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO CC05
	   ELSE
	   IF DATA-8BIT
	       MOVE KEY-CODE-1X  TO WS-OPTION
	       IF WS-OPTION < 0 OR > 7
		   CALL X"E5"
		   GO TO CC05
	       END-IF
	       GO TO CC16
	   ELSE
	       CALL X"E5"
	       GO TO CC05.

       CC15.
	   IF SCREEN-LIN < 9
	       CALL X"E5"
	       GO TO CC05
	   ELSE
	   IF SCREEN-LIN = 9
	       MOVE "1"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 10
	       MOVE "2"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 11
	       MOVE "3"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 12
	       MOVE "4"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 13
	       MOVE "5"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 14
	       MOVE "6"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 15
	       MOVE "7"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 16
	       MOVE "0"		 TO WS-OPTION.
	   GO TO CC18.

       CC16.
	     PERFORM CLEAR-BLOCK.
	   IF WS-OPTION = "0"
	       MOVE 16		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "1"
	       MOVE 9		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "2"
	       MOVE 10		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "3"
	       MOVE 11		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "4"
	       MOVE 12		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "5"
	       MOVE 13		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "6"
	       MOVE 14		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "7"
	       MOVE 15		 TO SCREEN-LIN.
	     PERFORM SAVE-ATTR.
	     PERFORM MARK-BLOCK.

       CC18.
	     CALL "CBL_TOUPPER" USING WS-OPTION
				BY VALUE WS-LENGTH
				RETURNING WS-STATUS.
	   IF WS-OPTION = "0"
	       GO TO CC999.
	   IF WS-OPTION < 1 OR > 7
	       CALL X"E5"
	       GO TO CC05.
	   IF WS-OPTION = "1"
	       MOVE "UTP\DEBREB" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "2"
	       MOVE "UTP\INVREB" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "3"
	       MOVE "UTP\DBMREB" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "4"
	       MOVE "UTP\SALREB" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "5"
	       MOVE "UTP\DBTREB" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "6"
	       MOVE "UTP\DBFREB" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "7"
	       MOVE "UTP\DALREB" TO PRG-NAME.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.
	     GO TO CC05.

       CC999.
	     EXIT.
      *
      *    ****    R E B U I L D   G / L E D G E R   F I L E S
      *
       CD000	       SECTION 50.
       CD0.
	   IF LS0-LEV < 1
	       MOVE "MNU\NOPMENU"
				 TO PRG-NAME
	       PERFORM AA100
	       DISPLAY MENU-INSTRUCT
	       GO TO CD999.
003240	   IF LS0-GL = "N" OR LS0-GLLEV < 9
	       PERFORM CA20
	       GO TO CD999.

       CD00.
	     MOVE 9		 TO SHADE-ROW.
	     MOVE 46		 TO SHADE-COL.
	     MOVE 18		 TO SHADE-WIDTH.
	     MOVE 8		 TO SHADE-LINES.
	     DISPLAY S06.
	     DISPLAY MENU-INSTRUCT.
	     PERFORM SCREEN-SHADOW.
	     MOVE 9		 TO TOP-ROW.
	     MOVE 14		 TO BOTTOM-ROW.
	     MOVE 8		 TO SCREEN-LIN.
	     MOVE 46		 TO SCREEN-COL.
	     MOVE 16		 TO STRING-LENGTH.
	     PERFORM SAVE-ATTR.

       CD05.
	     CALL X"AF" USING GET-SINGLE-CHAR, KEY-STATUS.

       CD10.
	   IF ADIS-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN UP-KEY	 PERFORM MOVE-BLOCK-UP
		 WHEN DOWN-KEY	 PERFORM MOVE-BLOCK-DOWN
		 WHEN MOUSE-KEY  PERFORM POSITION-MOUSE
				 IF MOUSE-ENTER = "Y"
				     MOVE "N"	 TO MOUSE-ENTER
				     GO TO CD15
				 END-IF
				 IF MOUSE-Y = 24
				     IF MOUSE-X = 5
					 MOVE 5  TO KEY-CODE-1
					 GO TO CD10
				     ELSE
				     IF MOUSE-X = 10
					 MOVE 6  TO KEY-CODE-1
					 GO TO CD10
				     ELSE
				     IF MOUSE-X > 36 AND < 44
					 MOVE 0  TO KEY-CODE-1
					 GO TO CD10
				     ELSE
				     IF MOUSE-X > 54 AND < 60
					 MOVE 0  TO KEY-CODE-1
					 MOVE 1  TO KEY-TYPE
					 GO TO CD10
				     END-IF
				 END-IF
		 WHEN ENTER-KEY  GO TO CD15
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO CD05
	   ELSE
	   IF USER-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN ESC-KEY
		     MOVE "0"	 TO WS-OPTION
		     GO TO CD18
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO CD05
	   ELSE
	   IF DATA-8BIT
	       MOVE KEY-CODE-1X  TO WS-OPTION
	       IF WS-OPTION < 0 OR > 5
		   CALL X"E5"
		   GO TO CD05
	       END-IF
	       GO TO CD16
	   ELSE
	       CALL X"E5"
	       GO TO CD05.

       CD15.
	   IF SCREEN-LIN < 9
	       CALL X"E5"
	       GO TO CD05
	   ELSE
	   IF SCREEN-LIN = 9
	       MOVE "1"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 10
	       MOVE "2"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 11
	       MOVE "3"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 12
	       MOVE "4"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 13
	       MOVE "5"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 14
	       MOVE "0"		 TO WS-OPTION.
	   GO TO CD18.

       CD16.
	     PERFORM CLEAR-BLOCK.
	   IF WS-OPTION = "0"
	       MOVE 14		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "1"
	       MOVE 9		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "2"
	       MOVE 10		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "3"
	       MOVE 11		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "4"
	       MOVE 12		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "5"
	       MOVE 13		 TO SCREEN-LIN.
	     PERFORM SAVE-ATTR.
	     PERFORM MARK-BLOCK.

       CD18.
	     CALL "CBL_TOUPPER" USING WS-OPTION
				BY VALUE WS-LENGTH
				RETURNING WS-STATUS.
	   IF WS-OPTION = "0"
	       GO TO CD999.
	   IF WS-OPTION < 1 OR > 5
	       CALL X"E5"
	       GO TO CD05.
	   IF WS-OPTION = "1"
	       MOVE "UTP\GACREB" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "2"
	       MOVE "UTP\GBHREB" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "3"
	       MOVE "UTP\LEDREB" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "4"
	       MOVE "UTP\GTRREB" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "5"
	       MOVE "UTP\CHBREB" TO PRG-NAME.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.
	     GO TO CD05.

       CD999.
	     EXIT.
      *
      *    ****    R E B U I L D   J O B - C O S T   F I L E S
      *
       CE000	       SECTION 50.
       CE0.
	   IF (LS0-LEV < 4) AND (LS0-JCP = 0)
	       MOVE "MNU\NOPMENU"
				 TO PRG-NAME
	       PERFORM AA100
	       DISPLAY MENU-INSTRUCT
	       GO TO CE999.
003240	   IF LS0-JOBS = "N" OR LS0-JBLEV < 9
	       PERFORM CA20
	       GO TO CE999.

       CE00.
	     MOVE 9		 TO SHADE-ROW.
	     MOVE 46		 TO SHADE-COL.
	     MOVE 18		 TO SHADE-WIDTH.
	     MOVE 7		 TO SHADE-LINES.
	     DISPLAY S07.
	     DISPLAY MENU-INSTRUCT.
	     PERFORM SCREEN-SHADOW.
	     MOVE 9		 TO TOP-ROW.
	     MOVE 13		 TO BOTTOM-ROW.
	     MOVE 8		 TO SCREEN-LIN.
	     MOVE 46		 TO SCREEN-COL.
	     MOVE 16		 TO STRING-LENGTH.
	     PERFORM SAVE-ATTR.

       CE05.
	     CALL X"AF" USING GET-SINGLE-CHAR, KEY-STATUS.

       CE10.
	   IF ADIS-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN UP-KEY	 PERFORM MOVE-BLOCK-UP
		 WHEN DOWN-KEY	 PERFORM MOVE-BLOCK-DOWN
		 WHEN MOUSE-KEY  PERFORM POSITION-MOUSE
				 IF MOUSE-ENTER = "Y"
				     MOVE "N"	 TO MOUSE-ENTER
				     GO TO CE15
				 END-IF
				 IF MOUSE-Y = 24
				     IF MOUSE-X = 5
					 MOVE 5  TO KEY-CODE-1
					 GO TO CE10
				     ELSE
				     IF MOUSE-X = 10
					 MOVE 6  TO KEY-CODE-1
					 GO TO CE10
				     ELSE
				     IF MOUSE-X > 36 AND < 44
					 MOVE 0  TO KEY-CODE-1
					 GO TO CE10
				     ELSE
				     IF MOUSE-X > 54 AND < 60
					 MOVE 0  TO KEY-CODE-1
					 MOVE 1  TO KEY-TYPE
					 GO TO CE10
				     END-IF
				 END-IF
		 WHEN ENTER-KEY  GO TO CE15
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO CE05
	   ELSE
	   IF USER-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN ESC-KEY
		     MOVE "0"	 TO WS-OPTION
		     GO TO CE18
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO CE05
	   ELSE
	   IF DATA-8BIT
	       MOVE KEY-CODE-1X  TO WS-OPTION
	       IF WS-OPTION < 0 OR > 4
		   CALL X"E5"
		   GO TO CE05
	       END-IF
	       GO TO CE16
	   ELSE
	       CALL X"E5"
	       GO TO CE05.

       CE15.
	   IF SCREEN-LIN < 9
	       CALL X"E5"
	       GO TO CE05
	   ELSE
	   IF SCREEN-LIN = 9
	       MOVE "1"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 10
	       MOVE "2"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 11
	       MOVE "3"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 12
	       MOVE "4"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 13
	       MOVE "0"		 TO WS-OPTION.
	   GO TO CE18.

       CE16.
	     PERFORM CLEAR-BLOCK.
	   IF WS-OPTION = "0"
	       MOVE 13		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "1"
	       MOVE 9		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "2"
	       MOVE 10		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "3"
	       MOVE 11		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "4"
	       MOVE 12		 TO SCREEN-LIN.
	     PERFORM SAVE-ATTR.
	     PERFORM MARK-BLOCK.

       CE18.
	     CALL "CBL_TOUPPER" USING WS-OPTION
				BY VALUE WS-LENGTH
				RETURNING WS-STATUS.
	   IF WS-OPTION = "0"
	       GO TO CE999.
	   IF WS-OPTION < 1 OR > 4
	       CALL X"E5"
	       GO TO CE05.
	   IF WS-OPTION = "1"
	       MOVE "UTP\JOBREB" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "2"
	       MOVE "UTP\JTPREB" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "3"
	       MOVE "UTP\JRQREB" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "4"
	       MOVE "UTP\JWAREB" TO PRG-NAME.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.
	     GO TO CE05.

       CE999.
	     EXIT.
      *
      *    ****    R E B U I L D   S T O C K   F I L E S
      *
       CF000	       SECTION 50.
       CF0.
003240	   IF LS0-STOCK = "N" OR LS0-STLEV < 9
	       PERFORM CA20
	       GO TO CF999.

       CF00.
	     MOVE 9		 TO SHADE-ROW.
	     MOVE 46		 TO SHADE-COL.
	     MOVE 18		 TO SHADE-WIDTH.
	     MOVE 9		 TO SHADE-LINES.
	     DISPLAY S08.
	     DISPLAY MENU-INSTRUCT.
	     PERFORM SCREEN-SHADOW.
	     MOVE 9		 TO TOP-ROW.
	     MOVE 15		 TO BOTTOM-ROW.
	     MOVE 8		 TO SCREEN-LIN.
	     MOVE 46		 TO SCREEN-COL.
	     MOVE 16		 TO STRING-LENGTH.
	     PERFORM SAVE-ATTR.

       CF05.
	     CALL X"AF" USING GET-SINGLE-CHAR, KEY-STATUS.

       CF10.
	   IF ADIS-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN UP-KEY	 PERFORM MOVE-BLOCK-UP
		 WHEN DOWN-KEY	 PERFORM MOVE-BLOCK-DOWN
		 WHEN MOUSE-KEY  PERFORM POSITION-MOUSE
				 IF MOUSE-ENTER = "Y"
				     MOVE "N"	 TO MOUSE-ENTER
				     GO TO CF15
				 END-IF
				 IF MOUSE-Y = 24
				     IF MOUSE-X = 5
					 MOVE 5  TO KEY-CODE-1
					 GO TO CF10
				     ELSE
				     IF MOUSE-X = 10
					 MOVE 6  TO KEY-CODE-1
					 GO TO CF10
				     ELSE
				     IF MOUSE-X > 36 AND < 44
					 MOVE 0  TO KEY-CODE-1
					 GO TO CF10
				     ELSE
				     IF MOUSE-X > 54 AND < 60
					 MOVE 0  TO KEY-CODE-1
					 MOVE 1  TO KEY-TYPE
					 GO TO CF10
				     END-IF
				 END-IF
		 WHEN ENTER-KEY  GO TO CF15
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO CF05
	   ELSE
	   IF USER-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN ESC-KEY
		     MOVE "0"	 TO WS-OPTION
		     GO TO CF18
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO CF05
	   ELSE
	   IF DATA-8BIT
	       MOVE KEY-CODE-1X  TO WS-OPTION
	       IF WS-OPTION < 0 OR > 6
		   CALL X"E5"
		   GO TO CF05
	       END-IF
	       GO TO CF16
	   ELSE
	       CALL X"E5"
	       GO TO CF05.

       CF15.
	   IF SCREEN-LIN < 9
	       CALL X"E5"
	       GO TO CF05
	   ELSE
	   IF SCREEN-LIN = 9
	       MOVE "1"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 10
	       MOVE "2"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 11
	       MOVE "3"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 12
	       MOVE "4"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 13
	       MOVE "5"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 14
	       MOVE "6"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 15
	       MOVE "0"		 TO WS-OPTION.
	   GO TO CF18.

       CF16.
	     PERFORM CLEAR-BLOCK.
	   IF WS-OPTION = "0"
	       MOVE 15		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "1"
	       MOVE 9		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "2"
	       MOVE 10		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "3"
	       MOVE 11		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "4"
	       MOVE 12		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "5"
	       MOVE 13		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "6"
	       MOVE 14		 TO SCREEN-LIN.
	     PERFORM SAVE-ATTR.
	     PERFORM MARK-BLOCK.

       CF18.
	     CALL "CBL_TOUPPER" USING WS-OPTION
				BY VALUE WS-LENGTH
				RETURNING WS-STATUS.
	   IF WS-OPTION = "0"
	       GO TO CF999.
	   IF WS-OPTION < 1 OR > 6
	       CALL X"E5"
	       GO TO CF05.
	   IF WS-OPTION = "1"
	       MOVE "UTP\STMREB" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "2"
	       MOVE "UTP\PROREB" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "3"
	       MOVE "UTP\STKREB" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "4"
	       MOVE "UTP\CARREB" TO PRG-NAME
	       PERFORM AA100
	       MOVE "UTP\PRDREB" TO PRG-NAME
	       PERFORM AA100
	       MOVE "UTP\SRDREB" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "5"
	       MOVE "UTP\WARREB" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "6"
	       MOVE "UTP\WSTREB" TO PRG-NAME.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.
	     GO TO CF05.

       CF999.
	     EXIT.
      *
      *    ****    R E B U I L D   S U N D R Y	 F I L E S
      *
       CG000	       SECTION 50.
       CG0.
003240	   IF LS0-CRLEV < 9 AND
	      LS0-DBLEV < 9 AND
	      LS0-GLLEV < 9 AND
	      LS0-STLEV < 9 AND
	      LS0-JBLEV < 9 AND
	      LS0-PALEV < 9 AND
	      LS0-SALEV < 9
	       PERFORM CA20
	       GO TO CG999.

       CG00.
	     MOVE 9		 TO SHADE-ROW.
	     MOVE 46		 TO SHADE-COL.
	     MOVE 18		 TO SHADE-WIDTH.
	     MOVE 8		 TO SHADE-LINES.
	     DISPLAY S09.
	     DISPLAY MENU-INSTRUCT.
	     PERFORM SCREEN-SHADOW.
	     MOVE 9		 TO TOP-ROW.
	     MOVE 14		 TO BOTTOM-ROW.
	     MOVE 8		 TO SCREEN-LIN.
	     MOVE 46		 TO SCREEN-COL.
	     MOVE 16		 TO STRING-LENGTH.
	     PERFORM SAVE-ATTR.

       CG05.
	     CALL X"AF" USING GET-SINGLE-CHAR, KEY-STATUS.

       CG10.
	   IF ADIS-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN UP-KEY	 PERFORM MOVE-BLOCK-UP
		 WHEN DOWN-KEY	 PERFORM MOVE-BLOCK-DOWN
		 WHEN MOUSE-KEY  PERFORM POSITION-MOUSE
				 IF MOUSE-ENTER = "Y"
				     MOVE "N"	 TO MOUSE-ENTER
				     GO TO CG15
				 END-IF
				 IF MOUSE-Y = 24
				     IF MOUSE-X = 5
					 MOVE 5  TO KEY-CODE-1
					 GO TO CG10
				     ELSE
				     IF MOUSE-X = 10
					 MOVE 6  TO KEY-CODE-1
					 GO TO CG10
				     ELSE
				     IF MOUSE-X > 36 AND < 44
					 MOVE 0  TO KEY-CODE-1
					 GO TO CG10
				     ELSE
				     IF MOUSE-X > 54 AND < 60
					 MOVE 0  TO KEY-CODE-1
					 MOVE 1  TO KEY-TYPE
					 GO TO CG10
				     END-IF
				 END-IF
		 WHEN ENTER-KEY  GO TO CG15
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO CG05
	   ELSE
	   IF USER-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN ESC-KEY
		     MOVE "0"	 TO WS-OPTION
		     GO TO CG18
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO CG05
	   ELSE
	   IF DATA-8BIT
	       MOVE KEY-CODE-1X  TO WS-OPTION
	       IF WS-OPTION < 0 OR > 5
		   CALL X"E5"
		   GO TO CG05
	       END-IF
	       GO TO CG16
	   ELSE
	       CALL X"E5"
	       GO TO CG05.

       CG15.
	   IF SCREEN-LIN < 9
	       CALL X"E5"
	       GO TO CG05
	   ELSE
	   IF SCREEN-LIN = 9
	       MOVE "1"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 10
	       MOVE "2"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 11
	       MOVE "3"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 12
	       MOVE "4"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 13
	       MOVE "5"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 14
	       MOVE "0"		 TO WS-OPTION.
	   GO TO CG18.

       CG16.
	     PERFORM CLEAR-BLOCK.
	   IF WS-OPTION = "0"
	       MOVE 14		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "1"
	       MOVE 9		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "2"
	       MOVE 10		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "3"
	       MOVE 11		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "4"
	       MOVE 12		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "5"
	       MOVE 13		 TO SCREEN-LIN.
	     PERFORM SAVE-ATTR.
	     PERFORM MARK-BLOCK.

       CG18.
	     CALL "CBL_TOUPPER" USING WS-OPTION
				BY VALUE WS-LENGTH
				RETURNING WS-STATUS.
	   IF WS-OPTION = "0"
	       GO TO CG999.
	   IF WS-OPTION < 1 OR > 5
	       CALL X"E5"
	       GO TO CG05.
	   IF WS-OPTION = "1"
	       MOVE "UTP\CHQREB" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "2"
	       MOVE "UTP\GARREB" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "3"
	       MOVE "UTP\TAXREB" TO PRG-NAME
	       CLOSE TXTRAN
	   ELSE
	   IF WS-OPTION = "4"
	       MOVE "UTP\SLPREB" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "5"
	       MOVE "UTP\DPTREB" TO PRG-NAME.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.
	   IF PRG-NAME = "UTP\TAXREB"
013040	       OPEN I-O TXTRAN.
	     GO TO CG05.

       CG999.
	     EXIT.
      /
      *    ****    D E L I V E R Y   R O U T E S
      *
       DA000	       SECTION 51.
       DA00.
	   IF LS-DSKDRV = "L"
	       MOVE "Not available on Local drive"
				 TO WS-ERR-STRING
003260	       PERFORM ERROR-MESSAGE
	       GO TO DA999.
	   IF (LS0-LEV < 4) OR (LS0-RTE = 0)
	       MOVE "MNU\NOPMENU"
				 TO PRG-NAME
	   ELSE
	       MOVE "SLP\DLP006" TO PRG-NAME.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.
       DA999.
	     EXIT.
      /
      *    ****    C L E A R   U S E R	 L O G
      *
       EA000	       SECTION 52.
       EA00.
	     MOVE "LOG001"	 TO PRG-NAME.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.

       EA999.
	     EXIT.
      /
      *    ****    C L E A R   V A L U E S
      *
       FA000	       SECTION 53.
       FA00.
	   IF LS-DSKDRV = "L"
	       MOVE "Not available on Local drive"
				 TO WS-ERR-STRING
003260	       PERFORM ERROR-MESSAGE
	       GO TO FA999.
	     MOVE SPACES	 TO WS-PASSWORD.
	     DISPLAY S11A.
	     ACCEPT S11B.
006080	     MOVE 8 TO WS-LENGTH.
	     CALL "CBL_TOUPPER" USING WS-PASSWORD
				BY VALUE WS-LENGTH
				RETURNING WS-STATUS.
006140	     MOVE 1 TO WS-LENGTH.
	     DISPLAY WS-BLNK78 AT 2302.
006150	   IF WS-PASSWORD NOT = "APACZERO"
	       GO TO FA999.

       FA999.
	     EXIT.
      /
      *    ****    P A R A M E T E R S
      *
       GA000	       SECTION 54.
       GA00.
	   IF LS-DSKDRV = "L"
	       MOVE "Not available on Local drive"
				 TO WS-ERR-STRING
003260	       PERFORM ERROR-MESSAGE
	       GO TO GA999.
003240	   IF LS0-PARM = "N"
	       GO TO GA20.

       GA02.
	     MOVE 7		 TO SHADE-ROW.
	     MOVE 28		 TO SHADE-COL.
	     MOVE 22		 TO SHADE-WIDTH.
	     MOVE 13		 TO SHADE-LINES.
	     DISPLAY S12.
	   IF LS0-LEV < 3
	       DISPLAY "N/A" AT 1446
			WITH BACKGROUND-COLOR 3 FOREGROUND-COLOR 0
	       DISPLAY "/Codes N/A" AT 1539
			WITH BACKGROUND-COLOR 3 FOREGROUND-COLOR 0
	       DISPLAY "N/A" AT 1546
			WITH BACKGROUND-COLOR 3 FOREGROUND-COLOR 0
	       DISPLAY "N/A" AT 1746
			WITH BACKGROUND-COLOR 3 FOREGROUND-COLOR 0.
	     DISPLAY MENU-INSTRUCT.
	     PERFORM SCREEN-SHADOW.
	     MOVE 7		 TO TOP-ROW.
	     MOVE 17		 TO BOTTOM-ROW.
	     MOVE 6		 TO SCREEN-LIN.
	     MOVE 28		 TO SCREEN-COL.
	     MOVE 20		 TO STRING-LENGTH.
	     PERFORM SAVE-ATTR.

       GA05.
	     CALL X"AF" USING GET-SINGLE-CHAR, KEY-STATUS.

       GA10.
	   IF ADIS-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN UP-KEY	 PERFORM MOVE-BLOCK-UP
		 WHEN DOWN-KEY	 PERFORM MOVE-BLOCK-DOWN
		 WHEN MOUSE-KEY  PERFORM POSITION-MOUSE
				 IF MOUSE-ENTER = "Y"
				     MOVE "N"	 TO MOUSE-ENTER
				     GO TO GA15
				 END-IF
				 IF MOUSE-Y = 24
				     IF MOUSE-X = 5
					 MOVE 5  TO KEY-CODE-1
					 GO TO GA10
				     ELSE
				     IF MOUSE-X = 10
					 MOVE 6  TO KEY-CODE-1
					 GO TO GA10
				     ELSE
				     IF MOUSE-X > 36 AND < 44
					 MOVE 0  TO KEY-CODE-1
					 GO TO GA10
				     ELSE
				     IF MOUSE-X > 54 AND < 60
					 MOVE 0  TO KEY-CODE-1
					 MOVE 1  TO KEY-TYPE
					 GO TO GA10
				     END-IF
				 END-IF
		 WHEN ENTER-KEY  GO TO GA15
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO GA05
	   ELSE
	   IF USER-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN ESC-KEY
		     MOVE "0"	 TO WS-OPTION
		     GO TO GA18
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO GA05
	   ELSE
	   IF DATA-8BIT
	       MOVE KEY-CODE-1X  TO WS-OPTION
	       IF (WS-OPTION < 0 OR > 8) AND
		  (WS-OPTION < "A" OR > "B")
		   CALL X"E5"
		   GO TO GA05
	       END-IF
	       GO TO GA16
	   ELSE
	       CALL X"E5"
	       GO TO GA05.

       GA15.
	   IF SCREEN-LIN < 7
	       CALL X"E5"
	       GO TO GA05
	   ELSE
	   IF SCREEN-LIN = 7
	       MOVE "1"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 8
	       MOVE "2"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 9
	       MOVE "3"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 10
	       MOVE "4"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 11
	       MOVE "5"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 12
	       MOVE "6"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 13
	       MOVE "7"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 14
	       MOVE "8"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 15
	       MOVE "A"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 16
	       MOVE "B"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 17
	       MOVE "0"		 TO WS-OPTION.
	   GO TO GA18.

       GA16.
	     PERFORM CLEAR-BLOCK.
	   IF WS-OPTION = "0"
	       MOVE 17		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "1"
	       MOVE 7		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "2"
	       MOVE 8		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "3"
	       MOVE 9		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "4"
	       MOVE 10		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "5"
	       MOVE 11		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "6"
	       MOVE 12		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "7"
	       MOVE 13		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "8"
	       MOVE 14		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "A"
	       MOVE 15		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "B"
	       MOVE 16		 TO SCREEN-LIN.
	     PERFORM SAVE-ATTR.
	     PERFORM MARK-BLOCK.

       GA18.
	   IF WS-OPTION = "0"
	       GO TO GA999.
	     PERFORM SAVE-SCREEN-2.
	     MOVE BLOCK-DETAIL	 TO BLOCK-DETAIL2.
	     MOVE SHADOW-DETAIL	 TO SHADOW-DETAIL2.
	     MOVE CRT-DETAIL	 TO CRT-DETAIL2.
	   IF WS-OPTION = "1"
	       PERFORM GB000
	   ELSE
	   IF WS-OPTION = "2"
	       PERFORM GC000
	   ELSE
	   IF WS-OPTION = "3"
	       PERFORM GD000
	   ELSE
	   IF WS-OPTION = "4"
	       PERFORM GE000
	   ELSE
	   IF WS-OPTION = "5"
	       PERFORM GF000
	   ELSE
	   IF WS-OPTION = "6"
	       PERFORM GG000
	   ELSE
	   IF WS-OPTION = "7"
	       PERFORM GH000
	   ELSE
	   IF WS-OPTION = "8"
	       PERFORM GI000
	   ELSE
	   IF WS-OPTION = "A"
	       PERFORM GK000
	   ELSE
	       PERFORM GJ000.
	     PERFORM RESTORE-SCREEN-2.
	     MOVE BLOCK-DETAIL2  TO BLOCK-DETAIL
	     MOVE SHADOW-DETAIL2 TO SHADOW-DETAIL
	     MOVE CRT-DETAIL2	 TO CRT-DETAIL
	     GO TO GA05.

       GA20.
	     DISPLAY CLEAR-L25.
003250	     DISPLAY "Not Authorised - Press any key" AT 2512
003260		      WITH BACKGROUND-COLOR 3
			   FOREGROUND-COLOR 6 HIGHLIGHT.
	     CALL X"AF" USING GET-SINGLE-CHAR, KEY-STATUS.

       GA999.
	     EXIT.

       GB000	       SECTION 54.
       GB00.
	     MOVE 9		 TO SHADE-ROW.
	     MOVE 49		 TO SHADE-COL.
	     MOVE 21		 TO SHADE-WIDTH.
	     MOVE 10		 TO SHADE-LINES.
	     DISPLAY S13.
	     DISPLAY MENU-INSTRUCT.
	     PERFORM SCREEN-SHADOW.
	     MOVE 9		 TO TOP-ROW.
	     MOVE 16		 TO BOTTOM-ROW.
	     MOVE 8		 TO SCREEN-LIN.
	     MOVE 49		 TO SCREEN-COL.
	     MOVE 19		 TO STRING-LENGTH.
	     PERFORM SAVE-ATTR.

       GB05.
	     CALL X"AF" USING GET-SINGLE-CHAR, KEY-STATUS.

       GB10.
	   IF ADIS-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN UP-KEY	 PERFORM MOVE-BLOCK-UP
		 WHEN DOWN-KEY	 PERFORM MOVE-BLOCK-DOWN
		 WHEN MOUSE-KEY  PERFORM POSITION-MOUSE
				 IF MOUSE-ENTER = "Y"
				     MOVE "N"	 TO MOUSE-ENTER
				     GO TO GB15
				 END-IF
				 IF MOUSE-Y = 24
				     IF MOUSE-X = 5
					 MOVE 5  TO KEY-CODE-1
					 GO TO GB10
				     ELSE
				     IF MOUSE-X = 10
					 MOVE 6  TO KEY-CODE-1
					 GO TO GB10
				     ELSE
				     IF MOUSE-X > 36 AND < 44
					 MOVE 0  TO KEY-CODE-1
					 GO TO GB10
				     ELSE
				     IF MOUSE-X > 54 AND < 60
					 MOVE 0  TO KEY-CODE-1
					 MOVE 1  TO KEY-TYPE
					 GO TO GB10
				     END-IF
				 END-IF
		 WHEN ENTER-KEY  GO TO GB15
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO GB05
	   ELSE
	   IF USER-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN ESC-KEY
		     MOVE "0"	 TO WS-OPTION
		     GO TO GB18
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO GB05
	   ELSE
	   IF DATA-8BIT
	       MOVE KEY-CODE-1X  TO WS-OPTION
	       IF WS-OPTION < 0 OR > 7
		   CALL X"E5"
		   GO TO GB05
	       END-IF
	       GO TO GB16
	   ELSE
	       CALL X"E5"
	       GO TO GB05.

       GB15.
	   IF SCREEN-LIN < 9
	       CALL X"E5"
	       GO TO GB05
	   ELSE
	   IF SCREEN-LIN = 9
	       MOVE "1"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 10
	       MOVE "2"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 11
	       MOVE "3"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 12
	       MOVE "4"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 13
	       MOVE "5"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 14
	       MOVE "6"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 15
	       MOVE "7"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 16
	       MOVE "0"		 TO WS-OPTION.
	   GO TO GB18.

       GB16.
	     PERFORM CLEAR-BLOCK.
	   IF WS-OPTION = "0"
	       MOVE 16		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "1"
	       MOVE 9		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "2"
	       MOVE 10		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "3"
	       MOVE 11		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "4"
	       MOVE 12		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "5"
	       MOVE 13		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "6"
	       MOVE 14		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "7"
	       MOVE 15		 TO SCREEN-LIN.
	     PERFORM SAVE-ATTR.
	     PERFORM MARK-BLOCK.

       GB18.
	     CALL "CBL_TOUPPER" USING WS-OPTION
				BY VALUE WS-LENGTH
				RETURNING WS-STATUS.
	   IF WS-OPTION = "0"
	       GO TO GB999.
	   IF WS-OPTION < 1 OR > 7
	       CALL X"E5"
	       GO TO GB05.
	   IF WS-OPTION = "1"
	       MOVE "UTP\PRP001" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "2"
	       MOVE "UTP\PRP002" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "3"
	       MOVE "UTP\PRP003" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "4"
	       MOVE "UTP\PRP004" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "5"
	       MOVE "UTP\PRP005" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "6"
	       MOVE "UTP\PRP006" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "7"
	       MOVE "UTP\PRP007" TO PRG-NAME.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.
	     GO TO GB05.

       GB999.
	     EXIT.

       GC000	       SECTION 54.
       GC00.
	     MOVE 9		 TO SHADE-ROW.
	     MOVE 49		 TO SHADE-COL.
	     MOVE 19		 TO SHADE-WIDTH.
	     MOVE 5		 TO SHADE-LINES.
	     DISPLAY S14.
	     DISPLAY MENU-INSTRUCT.
	     PERFORM SCREEN-SHADOW.
	     MOVE 9		 TO TOP-ROW.
	     MOVE 11		 TO BOTTOM-ROW.
	     MOVE 8		 TO SCREEN-LIN.
	     MOVE 49		 TO SCREEN-COL.
	     MOVE 17		 TO STRING-LENGTH.
	     PERFORM SAVE-ATTR.

       GC05.
	     CALL X"AF" USING GET-SINGLE-CHAR, KEY-STATUS.

       GC10.
	   IF ADIS-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN UP-KEY	 PERFORM MOVE-BLOCK-UP
		 WHEN DOWN-KEY	 PERFORM MOVE-BLOCK-DOWN
		 WHEN MOUSE-KEY  PERFORM POSITION-MOUSE
				 IF MOUSE-ENTER = "Y"
				     MOVE "N"	 TO MOUSE-ENTER
				     GO TO GC15
				 END-IF
				 IF MOUSE-Y = 24
				     IF MOUSE-X = 5
					 MOVE 5  TO KEY-CODE-1
					 GO TO GC10
				     ELSE
				     IF MOUSE-X = 10
					 MOVE 6  TO KEY-CODE-1
					 GO TO GC10
				     ELSE
				     IF MOUSE-X > 36 AND < 44
					 MOVE 0  TO KEY-CODE-1
					 GO TO GC10
				     ELSE
				     IF MOUSE-X > 54 AND < 60
					 MOVE 0  TO KEY-CODE-1
					 MOVE 1  TO KEY-TYPE
					 GO TO GC10
				     END-IF
				 END-IF
		 WHEN ENTER-KEY  GO TO GC15
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO GC05
	   ELSE
	   IF USER-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN ESC-KEY
		     MOVE "0"	 TO WS-OPTION
		     GO TO GC18
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO GC05
	   ELSE
	   IF DATA-8BIT
	       MOVE KEY-CODE-1X  TO WS-OPTION
	       IF WS-OPTION < 0 OR > 2
		   CALL X"E5"
		   GO TO GC05
	       END-IF
	       GO TO GC16
	   ELSE
	       CALL X"E5"
	       GO TO GC05.

       GC15.
	   IF SCREEN-LIN < 9
	       CALL X"E5"
	       GO TO GC05
	   ELSE
	   IF SCREEN-LIN = 9
	       MOVE "1"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 10
	       MOVE "2"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 11
	       MOVE "0"		 TO WS-OPTION.
	   GO TO GC18.

       GC16.
	     PERFORM CLEAR-BLOCK.
	   IF WS-OPTION = "0"
	       MOVE 11		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "1"
	       MOVE 9		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "2"
	       MOVE 10		 TO SCREEN-LIN.
	     PERFORM SAVE-ATTR.
	     PERFORM MARK-BLOCK.

       GC18.
	     CALL "CBL_TOUPPER" USING WS-OPTION
				BY VALUE WS-LENGTH
				RETURNING WS-STATUS.
	   IF WS-OPTION = "0"
	       GO TO GC999.
	   IF WS-OPTION < 1 OR > 2
	       CALL X"E5"
	       GO TO GC05.
	   IF WS-OPTION = "1"
	       MOVE "UTP\PRP010" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "2"
	       MOVE "UTP\PRP011" TO PRG-NAME.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.
	     GO TO GC05.

       GC999.
	     EXIT.

       GD000	       SECTION 54.
       GD00.
	     MOVE 9		 TO SHADE-ROW.
	     MOVE 49		 TO SHADE-COL.
	     MOVE 26		 TO SHADE-WIDTH.
	     MOVE 12		 TO SHADE-LINES.
	     DISPLAY S15.
	     DISPLAY MENU-INSTRUCT.
	     PERFORM SCREEN-SHADOW.
	     MOVE 9		 TO TOP-ROW.
	     MOVE 18		 TO BOTTOM-ROW.
	     MOVE 8		 TO SCREEN-LIN.
	     MOVE 49		 TO SCREEN-COL.
	     MOVE 24		 TO STRING-LENGTH.
	     PERFORM SAVE-ATTR.

       GD05.
	     CALL X"AF" USING GET-SINGLE-CHAR, KEY-STATUS.

       GD10.
	   IF ADIS-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN UP-KEY	 PERFORM MOVE-BLOCK-UP
		 WHEN DOWN-KEY	 PERFORM MOVE-BLOCK-DOWN
		 WHEN MOUSE-KEY  PERFORM POSITION-MOUSE
				 IF MOUSE-ENTER = "Y"
				     MOVE "N"	 TO MOUSE-ENTER
				     GO TO GD15
				 END-IF
				 IF MOUSE-Y = 24
				     IF MOUSE-X = 5
					 MOVE 5  TO KEY-CODE-1
					 GO TO GD10
				     ELSE
				     IF MOUSE-X = 10
					 MOVE 6  TO KEY-CODE-1
					 GO TO GD10
				     ELSE
				     IF MOUSE-X > 36 AND < 44
					 MOVE 0  TO KEY-CODE-1
					 GO TO GD10
				     ELSE
				     IF MOUSE-X > 54 AND < 60
					 MOVE 0  TO KEY-CODE-1
					 MOVE 1  TO KEY-TYPE
					 GO TO GD10
				     END-IF
				 END-IF
		 WHEN ENTER-KEY  GO TO GD15
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO GD05
	   ELSE
	   IF USER-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN ESC-KEY
		     MOVE "0"	 TO WS-OPTION
		     GO TO GD18
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO GD05
	   ELSE
	   IF DATA-8BIT
	       MOVE KEY-CODE-1X  TO WS-OPTION
	       IF (WS-OPTION < 0 OR > 8) AND
		  NOT(WS-OPTION = "A")
		   CALL X"E5"
		   GO TO GD05
	       END-IF
	       GO TO GD16
	   ELSE
	       CALL X"E5"
	       GO TO GD05.

       GD15.
	   IF SCREEN-LIN < 9
	       CALL X"E5"
	       GO TO GD05
	   ELSE
	   IF SCREEN-LIN = 9
	       MOVE "1"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 10
	       MOVE "2"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 11
	       MOVE "3"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 12
	       MOVE "4"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 13
	       MOVE "5"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 14
	       MOVE "6"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 15
	       MOVE "7"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 16
	       MOVE "8"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 17
	       MOVE "A"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 18
	       MOVE "0"		 TO WS-OPTION.
	   GO TO GD18.

       GD16.
	     PERFORM CLEAR-BLOCK.
	   IF WS-OPTION = "0"
	       MOVE 18		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "1"
	       MOVE 9		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "2"
	       MOVE 10		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "3"
	       MOVE 11		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "4"
	       MOVE 12		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "5"
	       MOVE 13		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "6"
	       MOVE 14		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "7"
	       MOVE 15		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "8"
	       MOVE 16		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "A"
	       MOVE 17		 TO SCREEN-LIN.
	     PERFORM SAVE-ATTR.
	     PERFORM MARK-BLOCK.

       GD18.
	     CALL "CBL_TOUPPER" USING WS-OPTION
				BY VALUE WS-LENGTH
				RETURNING WS-STATUS.
	   IF WS-OPTION = "0"
	       GO TO GD999.
	   IF (WS-OPTION < 1 OR > 8) AND
	      (WS-OPTION NOT = "A")
	       CALL X"E5"
	       GO TO GD05.
	   IF WS-OPTION = "1"
	       MOVE "UTP\PRP020" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "2"
	       MOVE "UTP\PRP021" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "3"
	       MOVE "UTP\PRP022" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "4"
	       MOVE "UTP\PRP023" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "5"
	       MOVE "UTP\PRP024" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "6"
	       MOVE "UTP\PRP025" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "7"
	       MOVE "UTP\PRP026" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "8"
	       MOVE "UTP\PRP027" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "A"
	       MOVE "UTP\PRP028" TO PRG-NAME.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.
	     GO TO GD05.

       GD999.
	     EXIT.

       GE000	       SECTION 54.
       GE00.
	     MOVE 9		 TO SHADE-ROW.
	     MOVE 49		 TO SHADE-COL.
	     MOVE 21		 TO SHADE-WIDTH.
	     MOVE 7		 TO SHADE-LINES.
	     DISPLAY S16.
	     DISPLAY MENU-INSTRUCT.
	     PERFORM SCREEN-SHADOW.
	     MOVE 9		 TO TOP-ROW.
	     MOVE 13		 TO BOTTOM-ROW.
	     MOVE 8		 TO SCREEN-LIN.
	     MOVE 49		 TO SCREEN-COL.
	     MOVE 19		 TO STRING-LENGTH.
	     PERFORM SAVE-ATTR.

       GE05.
	     CALL X"AF" USING GET-SINGLE-CHAR, KEY-STATUS.

       GE10.
	   IF ADIS-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN UP-KEY	 PERFORM MOVE-BLOCK-UP
		 WHEN DOWN-KEY	 PERFORM MOVE-BLOCK-DOWN
		 WHEN MOUSE-KEY  PERFORM POSITION-MOUSE
				 IF MOUSE-ENTER = "Y"
				     MOVE "N"	 TO MOUSE-ENTER
				     GO TO GE15
				 END-IF
				 IF MOUSE-Y = 24
				     IF MOUSE-X = 5
					 MOVE 5  TO KEY-CODE-1
					 GO TO GE10
				     ELSE
				     IF MOUSE-X = 10
					 MOVE 6  TO KEY-CODE-1
					 GO TO GE10
				     ELSE
				     IF MOUSE-X > 36 AND < 44
					 MOVE 0  TO KEY-CODE-1
					 GO TO GE10
				     ELSE
				     IF MOUSE-X > 54 AND < 60
					 MOVE 0  TO KEY-CODE-1
					 MOVE 1  TO KEY-TYPE
					 GO TO GE10
				     END-IF
				 END-IF
		 WHEN ENTER-KEY  GO TO GE15
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO GE05
	   ELSE
	   IF USER-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN ESC-KEY
		     MOVE "0"	 TO WS-OPTION
		     GO TO GE18
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO GE05
	   ELSE
	   IF DATA-8BIT
	       MOVE KEY-CODE-1X  TO WS-OPTION
	       IF WS-OPTION < 0 OR > 4
		   CALL X"E5"
		   GO TO GE05
	       END-IF
	       GO TO GE16
	   ELSE
	       CALL X"E5"
	       GO TO GE05.

       GE15.
	   IF SCREEN-LIN < 9
	       CALL X"E5"
	       GO TO GE05
	   ELSE
	   IF SCREEN-LIN = 9
	       MOVE "1"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 10
	       MOVE "2"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 11
	       MOVE "3"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 12
	       MOVE "4"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 13
	       MOVE "0"		 TO WS-OPTION.
	   GO TO GE18.

       GE16.
	     PERFORM CLEAR-BLOCK.
	   IF WS-OPTION = "0"
	       MOVE 13		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "1"
	       MOVE 9		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "2"
	       MOVE 10		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "3"
	       MOVE 11		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "4"
	       MOVE 12		 TO SCREEN-LIN.
	     PERFORM SAVE-ATTR.
	     PERFORM MARK-BLOCK.

       GE18.
	     CALL "CBL_TOUPPER" USING WS-OPTION
				BY VALUE WS-LENGTH
				RETURNING WS-STATUS.
	   IF WS-OPTION = "0"
	       GO TO GE999.
	   IF WS-OPTION < 1 OR > 4
	       CALL X"E5"
	       GO TO GE05.
	   IF WS-OPTION = "1"
	       MOVE "UTP\PRP030" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "2"
	       MOVE "UTP\PRP031" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "3"
	       MOVE "UTP\PRP032" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "4"
	       MOVE "UTP\PRP033" TO PRG-NAME.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.
	     GO TO GE05.

       GE999.
	     EXIT.

       GF000	       SECTION 54.
       GF00.
	     MOVE 9		 TO SHADE-ROW.
	     MOVE 49		 TO SHADE-COL.
	     MOVE 19		 TO SHADE-WIDTH.
	     MOVE 5		 TO SHADE-LINES.
	     DISPLAY S17.
	     DISPLAY MENU-INSTRUCT.
	     PERFORM SCREEN-SHADOW.
	     MOVE 9		 TO TOP-ROW.
	     MOVE 11		 TO BOTTOM-ROW.
	     MOVE 8		 TO SCREEN-LIN.
	     MOVE 49		 TO SCREEN-COL.
	     MOVE 17		 TO STRING-LENGTH.
	     PERFORM SAVE-ATTR.

       GF05.
	     CALL X"AF" USING GET-SINGLE-CHAR, KEY-STATUS.

       GF10.
	   IF ADIS-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN UP-KEY	 PERFORM MOVE-BLOCK-UP
		 WHEN DOWN-KEY	 PERFORM MOVE-BLOCK-DOWN
		 WHEN MOUSE-KEY  PERFORM POSITION-MOUSE
				 IF MOUSE-ENTER = "Y"
				     MOVE "N"	 TO MOUSE-ENTER
				     GO TO GF15
				 END-IF
				 IF MOUSE-Y = 24
				     IF MOUSE-X = 5
					 MOVE 5  TO KEY-CODE-1
					 GO TO GF10
				     ELSE
				     IF MOUSE-X = 10
					 MOVE 6  TO KEY-CODE-1
					 GO TO GF10
				     ELSE
				     IF MOUSE-X > 36 AND < 44
					 MOVE 0  TO KEY-CODE-1
					 GO TO GF10
				     ELSE
				     IF MOUSE-X > 54 AND < 60
					 MOVE 0  TO KEY-CODE-1
					 MOVE 1  TO KEY-TYPE
					 GO TO GF10
				     END-IF
				 END-IF
		 WHEN ENTER-KEY  GO TO GF15
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO GF05
	   ELSE
	   IF USER-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN ESC-KEY
		     MOVE "0"	 TO WS-OPTION
		     GO TO GF18
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO GF05
	   ELSE
	   IF DATA-8BIT
	       MOVE KEY-CODE-1X  TO WS-OPTION
	       IF WS-OPTION < 0 OR > 2
		   CALL X"E5"
		   GO TO GF05
	       END-IF
	       GO TO GF16
	   ELSE
	       CALL X"E5"
	       GO TO GF05.

       GF15.
	   IF SCREEN-LIN < 9
	       CALL X"E5"
	       GO TO GF05
	   ELSE
	   IF SCREEN-LIN = 9
	       MOVE "1"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 10
	       MOVE "2"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 11
	       MOVE "0"		 TO WS-OPTION.
	   GO TO GF18.

       GF16.
	     PERFORM CLEAR-BLOCK.
	   IF WS-OPTION = "0"
	       MOVE 11		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "1"
	       MOVE 9		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "2"
	       MOVE 10		 TO SCREEN-LIN.
	     PERFORM SAVE-ATTR.
	     PERFORM MARK-BLOCK.

       GF18.
	     CALL "CBL_TOUPPER" USING WS-OPTION
				BY VALUE WS-LENGTH
				RETURNING WS-STATUS.
	   IF WS-OPTION = "0"
	       GO TO GF999.
	   IF WS-OPTION < 1 OR > 2
	       CALL X"E5"
	       GO TO GF05.
	   IF WS-OPTION = "1"
	       MOVE "UTP\PRP040" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "2"
	       MOVE "UTP\PRP041" TO PRG-NAME.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.
	     GO TO GF05.

       GF999.
	     EXIT.

       GG000	       SECTION 54.
       GG00.
	     MOVE 9		 TO SHADE-ROW.
	     MOVE 49		 TO SHADE-COL.
	     MOVE 21		 TO SHADE-WIDTH.
	     MOVE 15		 TO SHADE-LINES.
	     DISPLAY S18.
	   IF LS0-LEV < 3
	       DISPLAY "N/A" AT 1966
			WITH BACKGROUND-COLOR 7 FOREGROUND-COLOR 0
	       DISPLAY "N/A" AT	2065
			WITH BACKGROUND-COLOR 7 FOREGROUND-COLOR 0
	       DISPLAY "N/A" AT	2166
			WITH BACKGROUND-COLOR 7 FOREGROUND-COLOR 0.
	     DISPLAY MENU-INSTRUCT.
	     PERFORM SCREEN-SHADOW.
	     MOVE 9		 TO TOP-ROW.
	     MOVE 20		 TO BOTTOM-ROW.
	     MOVE 8		 TO SCREEN-LIN.
	     MOVE 49		 TO SCREEN-COL.
	     MOVE 19		 TO STRING-LENGTH.
	     PERFORM SAVE-ATTR.

       GG05.
	     CALL X"AF" USING GET-SINGLE-CHAR, KEY-STATUS.

       GG10.
	   IF ADIS-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN UP-KEY	 PERFORM MOVE-BLOCK-UP
		 WHEN DOWN-KEY	 PERFORM MOVE-BLOCK-DOWN
		 WHEN MOUSE-KEY  PERFORM POSITION-MOUSE
				 IF MOUSE-ENTER = "Y"
				     MOVE "N"	 TO MOUSE-ENTER
				     GO TO GG15
				 END-IF
				 IF MOUSE-Y = 24
				     IF MOUSE-X = 5
					 MOVE 5  TO KEY-CODE-1
					 GO TO GG10
				     ELSE
				     IF MOUSE-X = 10
					 MOVE 6  TO KEY-CODE-1
					 GO TO GG10
				     ELSE
				     IF MOUSE-X > 36 AND < 44
					 MOVE 0  TO KEY-CODE-1
					 GO TO GG10
				     ELSE
				     IF MOUSE-X > 54 AND < 60
					 MOVE 0  TO KEY-CODE-1
					 MOVE 1  TO KEY-TYPE
					 GO TO GG10
				     END-IF
				 END-IF
		 WHEN ENTER-KEY  GO TO GG15
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO GG05
	   ELSE
	   IF USER-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN ESC-KEY
		     MOVE "0"	 TO WS-OPTION
		     GO TO GG18
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO GG05
	   ELSE
	   IF DATA-8BIT
	       MOVE KEY-CODE-1X  TO WS-OPTION
	       CALL "CBL_TOUPPER" USING WS-OPTION
				  BY VALUE WS-LENGTH
				  RETURNING WS-STATUS
	       IF (WS-OPTION < 0 OR > 8) AND
		  (WS-OPTION < "A" OR > "D")
		   CALL X"E5"
		   GO TO GG05
	       END-IF
	       GO TO GG16
	   ELSE
	       CALL X"E5"
	       GO TO GG05.

       GG15.
	   IF SCREEN-LIN < 9
	       CALL X"E5"
	       GO TO GG05
	   ELSE
	   IF SCREEN-LIN = 9
	       MOVE "1"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 10
	       MOVE "2"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 11
	       MOVE "3"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 12
	       MOVE "4"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 13
	       MOVE "5"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 14
	       MOVE "6"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 15
	       MOVE "7"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 16
	       MOVE "8"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 17
	       MOVE "A"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 18
	       MOVE "B"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 19
	       MOVE "C"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 20
	       MOVE "D"		 TO WS-OPTION
	   ELSE
	   IF SCREEN-LIN = 21
	       MOVE "0"		 TO WS-OPTION.
	   GO TO GG18.

       GG16.
	     PERFORM CLEAR-BLOCK.
	   IF WS-OPTION = "0"
	       MOVE 21		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "1"
	       MOVE 9		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "2"
	       MOVE 10		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "3"
	       MOVE 11		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "4"
	       MOVE 12		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "5"
	       MOVE 13		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "6"
	       MOVE 14		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "7"
	       MOVE 15		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "8"
	       MOVE 16		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "A"
	       MOVE 17		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "B"
	       MOVE 18		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "C"
	       MOVE 19		 TO SCREEN-LIN
	   ELSE
	   IF WS-OPTION = "D"
	       MOVE 20		 TO SCREEN-LIN.
	     PERFORM SAVE-ATTR.
	     PERFORM MARK-BLOCK.

       GG18.
	     CALL "CBL_TOUPPER" USING WS-OPTION
				BY VALUE WS-LENGTH
				RETURNING WS-STATUS.
	   IF WS-OPTION = "0"
	       GO TO GG999.
	   IF (WS-OPTION < 1 OR > 8) AND
	      (WS-OPTION < "A" OR > "D")
	       CALL X"E5"
	       GO TO GG05.
	   IF WS-OPTION = "1"
	       MOVE "UTP\PRP050" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "2"
	       MOVE "UTP\PRP051" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "3"
	       MOVE "UTP\PRP052" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "4"
	       MOVE "UTP\PRP053" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "5"
	       MOVE "UTP\PRP054" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "6"
	       MOVE "UTP\PRP055" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "7"
	       MOVE "UTP\PRP056" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "8"
	       MOVE "UTP\PRP057" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "A"
	       MOVE "UTP\PRP058" TO PRG-NAME
	   ELSE
	   IF WS-OPTION = "B"
	       IF LS0-LEV < 3
		   MOVE "MNU\NOPMENU"
				 TO PRG-NAME
	       ELSE
		   MOVE "UTP\PRP061"
				 TO PRG-NAME
	       END-IF
	   ELSE
	   IF WS-OPTION = "C"
	       IF LS0-LEV < 3
		   MOVE "MNU\NOPMENU"
				 TO PRG-NAME
	       ELSE
		   MOVE "UTP\PRP062"
				 TO PRG-NAME
	       END-IF
	   ELSE
	   IF WS-OPTION = "D"
	       IF LS0-LEV < 3
		   MOVE "MNU\NOPMENU"
				 TO PRG-NAME
	       ELSE
		   MOVE "UTP\PRP063"
				 TO PRG-NAME
	       END-IF.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.
	     GO TO GG05.

       GG999.
	     EXIT.

       GH000	       SECTION 54.
       GH00.
	   IF LS0-LEV < 3
	       MOVE "MNU\NOPMENU"
				 TO PRG-NAME
	   ELSE
	       MOVE "UTP\PRP059" TO PRG-NAME.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.
       GH999.
	     EXIT.

       GI000	       SECTION 54.
       GI00.
	   IF LS0-LEV < 3
	       MOVE "MNU\NOPMENU"
				 TO PRG-NAME
	   ELSE
	       MOVE "UTP\PRP060" TO PRG-NAME.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.
       GI999.
	     EXIT.

       GJ000	       SECTION 54.
       GJ00.
	   IF LS0-LEV < 3
	       MOVE "MNU\NOPMENU"
				 TO PRG-NAME
	   ELSE
	       MOVE "UTP\PRP063" TO PRG-NAME.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.
       GJ999.
	     EXIT.

       GK000	       SECTION 54.
       GK00.
	   IF LS0-LEV < 3
	       MOVE "MNU\NOPMENU"
				 TO PRG-NAME
	   ELSE
	       MOVE "UTP\PRP064" TO PRG-NAME.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.
       GK999.
	     EXIT.

       HA000	       SECTION 54.
       HA00.
	   IF LS-DSKDRV = "L"
	       MOVE "Not available on Local drive"
				 TO WS-ERR-STRING
003260	       PERFORM ERROR-MESSAGE
	       GO TO HA999.
	     MOVE "UTP\AMDSTAT"	 TO PRG-NAME.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.
       HA999.
	     EXIT.
      /
      *    ****    D E L I V E R Y   R O U T E S
      *
       IA000	       SECTION 55.
       IA00.
	   IF LS-DSKDRV = "L"
	       MOVE "Not available on Local drive"
				 TO WS-ERR-STRING
003260	       PERFORM ERROR-MESSAGE
	       GO TO IA999.
	   IF (LS0-LEV < 3)
	       MOVE "MNU\NOPMENU"
				 TO PRG-NAME
	   ELSE
	       MOVE "UTP\CRDPRG" TO PRG-NAME.
	     PERFORM AA100.
	     DISPLAY MENU-INSTRUCT.
       IA999.
	     EXIT.
      /
038140 ZA000-INIT              SECTION 90.
038150 ZA000-OPEN.
038160	     PERFORM ZA60.
	     MOVE LS-PARID	 TO WS-PARID.
	     MOVE LS-L-OR-N	 TO W02-L-OR-N.
	     MOVE WS-SYS-ID	 TO W02-SYSID.
	     MOVE LS-TODAY-DDMMYY
				 TO TODAY-DDMMYY.
      *    ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ¿
      *    ³	   S e t   u p	 t h e	 F U N C T I O N   k e y s     ³
      *    ÀÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÙ
	     MOVE 1		 TO USER-ACTION
				    USER-SETTING.
      *    ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ¿
      *    ³		       ESC, F1 to F10 keys		       ³
      *    ÀÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÙ
	     MOVE ZERO		 TO USER-NUMBER.
	     MOVE 11		 TO USER-KEYS.
	     CALL X"AF" USING SET-BIT-PAIRS, USER-KEY-CONTROL.
      *    ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ¿
      *    ³		    PAGE-UP and PAGE-DOWN keys		       ³
      *    ÀÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÙ
	     MOVE 53		 TO USER-NUMBER.
	     MOVE 2		 TO USER-KEYS.
	     CALL X"AF" USING SET-BIT-PAIRS, USER-KEY-CONTROL.
      *    ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ¿
      *    ³		   A C T I V A T E   M O U S E		       ³
      *    ÀÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÙ
	     MOVE 64		 TO MOUSE-FUNC.
	     MOVE 1		 TO MOUSE-PARAM.
	     CALL X"AF" USING MOUSE-FUNC
			      MOUSE-PARAM.
	   IF MOUSE-FUNC NOT = 255
	       MOVE "Y"		 TO MOUSE-ATTACHED
	   ELSE
	       GO TO ZA00A
	   END-IF.
      *    ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ¿
      *    ³	       Set MOUSE key to act as FUNCTION key	       ³
      *    ÀÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÙ
	     MOVE 3		 TO USER-ACTION.
	     MOVE 27		 TO USER-NUMBER.
	     MOVE 2		 TO USER-KEYS.
	     CALL X"AF" USING SET-BIT-PAIRS, USER-KEY-CONTROL.
      *    ÚÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄ¿
      *    ³	    Setup the file ID's including path names           ³
      *    ÀÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÄÙ
      *    *************************************************************
      *    **** 	  P A R A M E T E R   F I L E		    ****
      *    *************************************************************
       ZA00A.
	     MOVE "PARAM"	 TO AFID-KEY.

       ZA00-READ-APACFIDS.
000030	     READ APACFIDS WITH IGNORE LOCK
	       KEY IS AFID-KEY.
	   IF WS-STATUS = "00"
	       GO TO ZA00-READ-APACFIDS-EXIT.
006260	     STRING "Missing " DELIMITED SIZE
		     AFID-KEY DELIMITED BY " "
		     " file ID - Status " DELIMITED SIZE
		     WS-STATUS DELIMITED SIZE
		     INTO WS-ERR-MES.
	     PERFORM ERROR-LENGTH THRU ERROR-EXIT.
006370	     STOP RUN.

       ZA00-READ-APACFIDS-EXIT.
	     EXIT.

       ZA00A-CONTINUE.
	     MOVE AFID-PATH	 TO W02-PARAM.
	     MOVE "TXTRAN"	 TO AFID-KEY.
	     PERFORM ZA00-READ-APACFIDS THRU ZA00-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-TXTRAN.
039770	     GO TO ZA999.
      *
      *    ****    S E T U P   T H E   S C R E E N   G R A P H I C S
      *
040090 ZA60.
040650	     MOVE LS-COMPANY	 TO WS-TOP-COMP.
	   IF LS-USER = LS-SYS-ID
	       MOVE "SupervisorÄ"
				 TO WS-WRKHD
	   ELSE
	       MOVE "Workstation"
				 TO WS-WRKHD
	       MOVE LS-USER	 TO WS-WRKST.
040750 ZA999.
040760       EXIT.

040780 I-O-ERRORS      SECTION  91.

       COPY ERRORS.PRO.

040950 DISPLAY-FILE-NAME.
041120*	   IF WS-F-ERROR = 15
041130*        MOVE WS-PARID	 TO WS-FILE
041140*        MOVE WS-PARKEY	 TO WS-KEY.

       COPY DISPERR.PRO.
