      ******************************************************************
      *                                                                *
      *  ********   ******   *******   ****  **    **  ****  ********  *
      *     **	   **	 **  **    **	**   ***   **	**	**     *
      *     **	   **	 **  **    **	**   ** *  **	**	**     *
      *     **	   **	 **  *******	**   **  * **	**	**     *
      *     **	   **	 **  **    **	**   **   ***	**	**     *
      *  ** **	   **	 **  **    **	**   **    **	**	**     *
      *   ***	    ******   *******   ****  **    **  ****	**     *
      *                                                                *
      *     ENGLISH                                                    *
      *                                                                *
      *   J O B - C O S T I N G   I N I T I A L I Z E   P R O G R A M  *
      *                                                                *
      *     VERSION 8.00 - August 2000				       *
      * 							       *
      ******************************************************************
000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID.     JOBINIT.
000030 AUTHOR.         J W LEMMON (APAC).
000040 DATE-WRITTEN.   OCTOBER 1982.
000050 ENVIRONMENT DIVISION.
000060 CONFIGURATION SECTION.
000070 SPECIAL-NAMES.  
000080                 CONSOLE IS CRT.
000090 INPUT-OUTPUT SECTION.
000100 FILE-CONTROL.

       COPY APACFIDS.SL.

000240 COPY CONTROL.SL.

       COPY ITEMS.SL.

       COPY JCPHST.SL.

       COPY JCPLIN.SL.

000180 COPY JOBAUD.SL.

000180 COPY JOBCST.SL.

000180 COPY JOBHDRN.SL.

000270 COPY JOBREQ.SL.

000270 COPY JOBRMK.SL.

000270 COPY JOBWAR.SL.

       COPY PARAM.SL.

000120 COPY SYSTEM.SL.

000260 DATA DIVISION.
000270 FILE SECTION.

       COPY APACFIDS.FD.

000240 COPY CONTROL.IFD.

       COPY ITEMS.FD.

       COPY JCPHST.FD.

       COPY JCPLIN.FD.

000350 COPY JOBAUD.FD.

000350 COPY JOBCSTN.FD.

000350 COPY JOBHDRN.FD.

000500 COPY JOBREQ.FD.

000500 COPY JOBRMKN.FD.

000500 COPY JOBWAR.FD.

       COPY PARAM.IFD.

000200 COPY SYSTEM.FD.

      /
000430 WORKING-STORAGE SECTION.
       77  WS-CHECK	   PIC	X(18)	 VALUE
			   "aeWlimemnomLalismJ".
000440 77  WS-S1	    PIC  9(04)	   COMP-5.
000450 77  WS-S2	    PIC  9(04)	   COMP-5.
000460 77  WS-S3	    PIC  9(04)	   COMP-5.
000470 77  WS-S4	    PIC  9(04)	   COMP-5.
000520 77  WS-NETKEY	    PIC  9(04)	   COMP-5.
000520 77  WS-PARKEY	    PIC  9(04)	   COMP-5.
001020 77  WS-SECKEY	    PIC	 9(04)	   COMP-5.
000580 77  WS-OPTION	    PIC  X(01).
000590 77  WS-ERROR	    PIC  9(01).
000600 77  WS-DEB	    PIC  9(05).
000610 77  WS-CON	    PIC  9(05).
000620 77  WS-NUM	    PIC  Z(04)9.
000630 77  WS-MES	    PIC  X(11) VALUE "Initialized".
       77  TODAY-DDMMYY	    PIC	 9(08) COMP-5.
       77  APAC-SYSTEM	    PIC	 X(12).
       77  APAC-VERSION	    PIC	 X(04).
      /
002420 01  WS-DB-LINE.
002430     03  WS-TOP-LNE.
002440         05  WS-TCHR PIC  X(01) OCCURS 80.
           03  WS-T-LINE REDEFINES WS-TOP-LNE.
               05  FILLER  PIC  X(01).
               05  WS-H-LINE
                           PIC  X(78).
               05  FILLER  PIC  X(01).
002430     03  WS-TOP-LNE2.
002440         05  WS-TCH  PIC  X(01) OCCURS 80.
002450     03  WS-MID-LNE.
002460         05  WS-MCHR PIC  X(01) OCCURS 80.
002450     03  WS-MID-LNE2.
	       05  FILLER      PIC  X(01) VALUE "³".
	       05  WS-BLNK78   PIC  X(78) VALUE ALL "°".
	       05  FILLER      PIC  X(01) VALUE "³".
002470	   03  WS-BOT-LNE.
002480         05  WS-BCHR PIC  X(01) OCCURS 80.
           03  WS-B-LINE REDEFINES WS-BOT-LNE.
               05  FILLER  PIC  X(01).
               05  WS-F-LINE
                           PIC  X(78).
               05  FILLER  PIC  X(01).
002470     03  WS-BOT-LNE2.
002480         05  WS-BCH  PIC  X(01) OCCURS 80.

000670 COPY WS.WS.

000290 01  WS-PARID.
000020	   03  WS-SYS-ID       PIC  X(03).

000840 01  W02-FID.

       COPY APACFIDS.ID.

000240 COPY CONTROL.ID.

       COPY ITEMS.ID.

       COPY JCPHST.ID.

       COPY JCPLIN.ID.

       COPY JOBAUD.ID.

       COPY JOBCST.ID.

       COPY JOBHDR.ID.

002180 COPY JOBREQ.ID.

002180 COPY JOBRMK.ID.

002180 COPY JOBWAR.ID.

       COPY PARAM.ID.

       COPY SYSTEM.ID.

       COPY W12.WS.

001890 01  W25-CALCS.
001900     03  W25-RESULT     PIC 9(07)V99.
001910     03  W25-RESULT1 REDEFINES W25-RESULT.
001920         05  FILLER      PIC 9(01).
001930         05  W25-WHOLE  PIC 9(06).
001940         05  W25-DECIMAL PIC 9(02).
           03  W25-RESULT2 REDEFINES W25-RESULT.
               05  W25-KEY    PIC 9(06).
               05  W25-SUB    PIC 9(01).
               05  FILLER     PIC 9(02).
001950     03  W25-PASS.
001960         05  W25-PASS1  PIC 9(03).
001970         05  W25-PASS2  PIC 9(03).
001980     03  W25-TIME       PIC 9(08).
001670	   03  W25-TRED REDEFINES  W25-TIME.
001680	       05  FILLER      PIC  9(02).
001690	       05  W25-FACT    PIC  9(06).
	       05  W25-DATE REDEFINES W25-FACT.
		   07  W25-YY  PIC  9(02).
		   07  W25-MM  PIC  9(02).
		   07  W25-DD  PIC  9(02).
002020	   03  W25-TOTAL      PIC S9(07)V99  COMP-3.
002030     03  W25-VALUE      PIC S9(07)V99  COMP-3.

002100 01  W35-PASSWORD.
002100     02  W35-PASS.
002110     03  W35-PASS1      PIC 9(03).
002120     03  W35-PASS2      PIC 9(03).
002130     02  W35-PASSW REDEFINES W35-PASS.
002140     03  W35-PNUM       PIC 9(06).

       COPY W40.WS.

       COPY FUNCTION.WS.

      /
001070 SCREEN SECTION.

       COPY BLANK.CRT.

001140 01  S01.
	   03  LINE  2 COLUMN 31 FOREGROUND-COLOR 15 VALUE
				 "INITIALIZE JOB FILES".
001150     03  LINE  4 COLUMN  4 FOREGROUND-COLOR 14 VALUE 
001160                        "Please be patient - Initializing files".
001170	   03  LINE  6 COLUMN  4 PIC X(18) USING WS-PARID.
001170	   03  LINE  7 COLUMN  4 PIC X(20) USING W02-NETWORK.
001180	   03  LINE  8 COLUMN  4 PIC X(19) USING W02-JOBCST.
001180	   03  LINE  9 COLUMN  4 PIC X(19) USING W02-JOBREQ.
001180	   03  LINE 10 COLUMN  4 PIC X(19) USING W02-JOBRMK.
	   03  LINE 11 COLUMN  4 PIC X(19) USING W02-JOBAUD.
	   03  LINE 12 COLUMN  4 PIC X(19) USING W02-JOBHDR.
	   03  LINE 13 COLUMN  4 PIC X(19) USING W02-JOBWAR.
	   03  LINE 14 COLUMN  4 PIC X(18) USING W02-ITEMS.
	   03  LINE 15 COLUMN  4 PIC X(19) USING W02-JCPHST.
	   03  LINE 16 COLUMN  4 PIC X(19) USING W02-JCPLIN.

003330 01  S03.
003340	   03  LINE 12 COLUMN  7 FOREGROUND-COLOR 6 HIGHLIGHT
				 VALUE "Company Identity Code ?".

003370 01  S04.
003380	   03  LINE 12 COLUMN 31 FOREGROUND-COLOR 7 HIGHLIGHT
003390				 PIC X(03) USING WS-SYS-ID AUTO.

       COPY S99.CRT.

       COPY OPT.CRT.

       COPY ERROR.CRT.

      /
001230 PROCEDURE DIVISION.
001240 AA000-MAIN	    SECTION.
001250 AA00.
041220       MOVE 1              TO WS-S1.
021870	     MOVE SPACES	 TO WS-MID-LNE.

041240 AA02.
041250       MOVE WS-G1          TO WS-TCHR (WS-S1) WS-BCHR (WS-S1).
             MOVE WS-G8          TO WS-TCH  (WS-S1) WS-BCH  (WS-S1).
041260     IF WS-S1 < 80
041270         ADD 1             TO WS-S1
041280         GO TO AA02.
             MOVE WS-G9          TO WS-TCH  (1).
             MOVE WS-G10         TO WS-TCH  (80).
             MOVE WS-G11         TO WS-BCH  (1).
             MOVE WS-G12         TO WS-BCH  (80).
             MOVE WS-G14         TO WS-TCHR (1)  WS-BCHR (1).
             MOVE WS-G13         TO WS-TCHR (80) WS-BCHR (80).
021930       MOVE WS-G2          TO WS-TCHR (16) WS-TCHR (41)
021940                              WS-TCHR (64) WS-TCHR (71).
021950       MOVE WS-G3          TO WS-MCHR (16) WS-MCHR (41)
021960                              WS-MCHR (64) WS-MCHR (71)
				    WS-MCHR (1)  WS-MCHR (80).
021970       MOVE WS-G4          TO WS-BCHR (16) WS-BCHR (41)
021980                              WS-BCHR (64) WS-BCHR (71).
	     ACCEPT W25-FACT FROM DATE.
	     MOVE W25-YY	 TO W12-YEAR.
	     MOVE W25-MM	 TO W12-MONTH.
	     MOVE W25-DD	 TO W12-DAY.
	   IF W25-YY < 50
	       MOVE 20		 TO W12-CENT
	   ELSE
	       MOVE 19		 TO W12-CENT.
	     MOVE W12-TODAY	 TO TODAY-DDMMYY.
	     MOVE "-JOB COSTING" TO APAC-SYSTEM.
	     MOVE "8.00"	 TO APAC-VERSION.
001260	     DISPLAY CLR-SCREEN.
	     DISPLAY "INITIALIZE ADVANCED JOB COSTING" AT 0226
		      WITH FOREGROUND-COLOR 7 HIGHLIGHT.
	     DISPLAY "This program will delete any existing job costing
      - 	     "files! The system will" AT 0405
		      WITH BACKGROUND-COLOR 4 FOREGROUND-COLOR 15.
	     DISPLAY "not attempt to convert the existing files as they
      - 	     "do not contain some of" AT 0505
		      WITH BACKGROUND-COLOR 4 FOREGROUND-COLOR 15.
	     DISPLAY "the required fields in the advanced version of JOB
      - 	     " COSTING.  If the data" AT 0605
		      WITH BACKGROUND-COLOR 4 FOREGROUND-COLOR 15.
	     DISPLAY "from the current files needs to be carried forward
      - 	     "?. Print the data on a" AT 0705
		      WITH BACKGROUND-COLOR 4 FOREGROUND-COLOR 15.
	     DISPLAY "report and then data capture the details manually.
      - 	     "                      " AT 0805
		      WITH BACKGROUND-COLOR 4 FOREGROUND-COLOR 15.
	     DISPLAY "Contact the  HELP  line if there are any doubts as
      - 	     " to the procedure that" AT 0905
		      WITH BACKGROUND-COLOR 4 FOREGROUND-COLOR 15.
	     DISPLAY "must be followed. If the current system has job co
      - 	     "sting installed, it is" AT 1005
		      WITH BACKGROUND-COLOR 4 FOREGROUND-COLOR 15.
	     DISPLAY "advisable to make a backup of the data and program
      - 	     "s before  initializing" AT 1105
		      WITH BACKGROUND-COLOR 4 FOREGROUND-COLOR 15.
	     DISPLAY "the advanced job costing data files. We hope that
      - 	     "the system will assist" AT 1205
		      WITH BACKGROUND-COLOR 4 FOREGROUND-COLOR 15.
	     DISPLAY "you with your service management requirements. Do
      -		     "contact us if you feel" AT 1305
		      WITH BACKGROUND-COLOR 4 FOREGROUND-COLOR 15.
	     DISPLAY "you have suggestions that may improve or enhance t
      - 	     "he system.            " AT 1405
		      WITH BACKGROUND-COLOR 4 FOREGROUND-COLOR 15.
	     DISPLAY "Continue " AT 1605
		     "Y" WITH FOREGROUND-COLOR 6 HIGHLIGHT "/"
		     "N" WITH FOREGROUND-COLOR 6 HIGHLIGHT "?".
	     MOVE SPACE 	 TO WS-OPTION.

       AA03.
	     ACCEPT WS-OPTION AT 1619
		    WITH BACKGROUND-COLOR 5
			 FOREGROUND-COLOR 7 HIGHLIGHT UPDATE AUTO.
	     CALL "CBL_TOUPPER" USING WS-OPTION
				BY VALUE WS-LENGTH
				RETURNING WS-STATUS.
	   IF NOT (WS-OPTION = "Y" OR "N")
	       GO TO AA03.
001260	     DISPLAY CLR-SCREEN.
	     DISPLAY "INITIALIZE ADVANCED JOB COSTING" AT 0226
		      WITH FOREGROUND-COLOR 7 HIGHLIGHT.
	   IF WS-OPTION = "N"
	       DISPLAY "Aborted by USER" AT 1212
			WITH BACKGROUND-COLOR 4
			     FOREGROUND-COLOR 7 HIGHLIGHT
	       STOP RUN.
006000	     DISPLAY S03.

       AA04.
006010	     ACCEPT S04.
	   IF WS-SYS-ID = SPACES
	       DISPLAY "Aborted by USER" AT 1412
			WITH BACKGROUND-COLOR 4
			     FOREGROUND-COLOR 7 HIGHLIGHT
	       STOP RUN.
006020	     MOVE 3		 TO WS-LENGTH.
	     CALL "CBL_TOUPPER" USING WS-SYS-ID
				BY VALUE WS-LENGTH
				RETURNING WS-STATUS.
006080	     MOVE 1		 TO WS-LENGTH.
	     MOVE WS-SYS-ID	 TO W02-SYSID.
	     OPEN I-O APACFIDS.
      *
      *    ****    P A R A M E T E R   F I L E
      *
       AA04-A.
	     MOVE "PARAM"	 TO AFID-KEY.

       AA04-READ-APACFIDS.
000030	     READ APACFIDS WITH IGNORE LOCK
	       KEY IS AFID-KEY.
	   IF WS-STATUS = "00"
	       GO TO AA04-READ-APACFIDS-EXIT.
006260	     STRING "Missing " DELIMITED SIZE
		     AFID-KEY DELIMITED BY " "
		     " file ID - Status " DELIMITED SIZE
		     WS-STATUS DELIMITED SIZE
		     INTO WS-ERR-MES.
	     PERFORM ERROR-LENGTH THRU ERROR-EXIT.
006370	     STOP RUN.

       AA04-READ-APACFIDS-EXIT.
	     EXIT.

       AA04-A-CONTINUE.
	     MOVE AFID-PATH	 TO W02-PARAM.
	     MOVE "SYSTEM"	 TO AFID-KEY.
	     PERFORM AA04-READ-APACFIDS THRU AA04-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-SYSTEM.
006190	     OPEN I-O SECUR.
006200     IF RUNTIME-ERROR
	       IF FLE-LOCKED
006210		   MOVE "Files locked - try later - Press ENTER"
006220				 TO WS-ERR-MES
006230		   PERFORM ERROR-LENGTH THRU ERROR-EXIT
006240		   STOP RUN.
006250     IF WS-STATUS NOT = "00"
006260	       MOVE "Invalid or file not on disk - Exit or 'R'ekey"
				 TO WS-ERR-MES
006230	       PERFORM ERROR-LENGTH THRU ERROR-EXIT
	       IF WS-OPTION = "R"
		   GO TO AA04
               ELSE
006270             STOP RUN.
006280	     MOVE 2		 TO WS-SECKEY.

       AA04A.
006300	     READ SECUR.
006310     IF WS-STATUS = "00"
006320	       GO TO AA04AB.
006330     IF RUNTIME-ERROR
006340         IF RECORD-LOCKED
006350		   GO TO AA04A.
006260	     STRING "Invalid or file not on disk - "
		     DELIMITED SIZE
		     WS-STATUS DELIMITED SIZE
		     INTO WS-ERR-MES.
	     PERFORM ERROR-LENGTH THRU ERROR-EXIT.
006370	     STOP RUN.

       AA04AB.
	     DISPLAY SEC-COMP AT 1407 WITH FOREGROUND-COLOR 14.
	     MOVE 16		 TO SLIN.
	     PERFORM CHECK-SETUP THRU CHECK-EXIT.
006160	   IF WS-OPTION = "N"
               CLOSE SECUR
006170	       GO TO AA04.

       AA04AC.
008340	     MOVE W12-TODAY	 TO W25-RESULT.
008360       ADD SEC-PASS        TO W25-RESULT.
008370       ACCEPT W25-TIME     FROM TIME.
008380       ADD W25-FACT        TO W25-RESULT.
008390	     DISPLAY W25-RESULT AT 1804.
008400	     DIVIDE 1.97	 INTO W25-RESULT.
008410       MOVE W25-WHOLE      TO W25-PASS.
008420       MOVE W25-PASS1      TO W35-PASS2.
008430       MOVE W25-PASS2      TO W35-PASS1.
008440       MOVE W35-PNUM       TO W25-RESULT.
008450     IF W25-RESULT < 100000
008460         ADD 701010        TO W25-RESULT
008470     ELSE
008480	       ADD 77		 TO W25-RESULT.
008490	     ADD 10112		 TO W25-RESULT.
	     ADD SEC-TERMS	 TO W25-RESULT.
	     ADD 6		 TO W25-RESULT.
008500	     MOVE W25-WHOLE	 TO SEC-PASS.
008510	     DISPLAY "Password" AT 2004.
008520	     MOVE ZERO		 TO W25-WHOLE.
      *
      *	     DISPLAY SEC-PASS AT 2403.
      *
       AA04AD.
008530	     ACCEPT W25-WHOLE AT 2013
		    WITH FOREGROUND-COLOR 7 HIGHLIGHT
			 BACKGROUND-COLOR 4 AUTO.
	   IF USER-FUNC
	       EVALUATE KEY-CODE-1
		 WHEN ESC-KEY
		     STOP RUN
		 WHEN OTHER	 CALL X"E5"
	       END-EVALUATE
	       GO TO AA04AD.
	   IF W25-WHOLE = ZERO
	       STOP RUN.
	   IF W25-WHOLE = 612144
	       GO TO AA04B.
008540     IF W25-WHOLE NOT = SEC-PASS
008550	       MOVE "Invalid password"
				 TO WS-ERR-STRING
003260	       PERFORM ERROR-MESSAGE
008570	       GO TO AA04AC.

       AA04B.
	     MOVE "ITEMS"	 TO AFID-KEY.
	     PERFORM AA04-READ-APACFIDS THRU AA04-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-ITEMS.
	     MOVE "JCHIST"	 TO AFID-KEY.
	     PERFORM AA04-READ-APACFIDS THRU AA04-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-JCPHST.
	     MOVE "JCLINE"	 TO AFID-KEY.
	     PERFORM AA04-READ-APACFIDS THRU AA04-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-JCPLIN.
	     MOVE "JOBAUD"	 TO AFID-KEY.
	     PERFORM AA04-READ-APACFIDS THRU AA04-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-JOBAUD.
	     MOVE "JOBCST"	 TO AFID-KEY.
	     PERFORM AA04-READ-APACFIDS THRU AA04-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-JOBCST.
	     MOVE "JOBHDR"	 TO AFID-KEY.
	     PERFORM AA04-READ-APACFIDS THRU AA04-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-JOBHDR.
	     MOVE "JOBREQ"	 TO AFID-KEY.
	     PERFORM AA04-READ-APACFIDS THRU AA04-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-JOBREQ.
	     MOVE "JOBRMK"	 TO AFID-KEY.
	     PERFORM AA04-READ-APACFIDS THRU AA04-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-JOBRMK.
	     MOVE "JOBWAR"	 TO AFID-KEY.
	     PERFORM AA04-READ-APACFIDS THRU AA04-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-JOBWAR.
	     MOVE "NETWORK"	 TO AFID-KEY.
	     PERFORM AA04-READ-APACFIDS THRU AA04-READ-APACFIDS-EXIT.
	     MOVE AFID-PATH	 TO W02-NETWORK.
001260	     DISPLAY CLR-SCREEN.
001390	     DISPLAY S01.

001420 AA05.
             PERFORM AC000-PARAM.
001500       PERFORM AG000-CONTROL.
             PERFORM AE000-JOBCST.
	     PERFORM AD000-JOBREQ.
	     PERFORM AF000-JOBRMK.
	     PERFORM AH000-JOBAUD.
	     PERFORM AI000-JOBHDR.
	     PERFORM AJ000-JOBWAR.
	     PERFORM AK000-ITEMS.
	     PERFORM AL000-JCPHST.
	     PERFORM AM000-JCPLIN.
012850	     MOVE 2		 TO SEC-JCP.
	     MOVE 6		 TO SEC-LEV.
012890       REWRITE SEC-REC2.
001510       GO TO AZ000-EOJ.

       COPY FUNCTION.CRT.

       COPY OPTION.CRT.

      /
001520 AC000-PARAM             SECTION.
001530 AC000-INIT.
001570       OPEN I-O PARAM.
             MOVE 201            TO WS-PARKEY.
             READ PARAM.
           IF WS-STATUS = "00"
               GO TO AC20.

001800 AC00.
001810       MOVE WS-PARKEY      TO WS-NUM.
001820	     DISPLAY WS-NUM AT 0626 WITH FOREGROUND-COLOR 15.
       AC05.
             INITIALIZE PAR-RECORD201.
003680 AC15.
003740       WRITE PAR-RECORD201.
           IF WS-STATUS NOT = "00"
               REWRITE PAR-RECORD201.
003750       PERFORM AC00.
003690       ADD 1               TO WS-PARKEY.
003780     IF WS-PARKEY < 251
003790        GO TO AC15.
       AC20.
001580	     DISPLAY "Updated" AT 0733
		     WITH FOREGROUND-COLOR 3 HIGHLIGHT
			  BACKGROUND-COLOR 5.
       AC999-EXIT.
             EXIT.
      /
004830 AD000-JOBREQ	       SECTION.
004840 AD000-INIT.
004850	     OPEN OUTPUT JOBREQ.
005610	     DISPLAY WS-MES AT 0933
		     WITH FOREGROUND-COLOR 3 HIGHLIGHT
			  BACKGROUND-COLOR 5.
005620 AD999-EXIT.
005630       EXIT.
      /
004830 AE000-JOBCST            SECTION.
004840 AE000-INIT.
004850       OPEN OUTPUT JOBCST.
005610	     DISPLAY WS-MES AT 0833
		     WITH FOREGROUND-COLOR 3 HIGHLIGHT
			  BACKGROUND-COLOR 5.
005620 AE999-EXIT.
005630       EXIT.
      /
004830 AF000-JOBRMK	       SECTION.
004840 AF000-INIT.
004850	     OPEN OUTPUT JOBRMK.
005610	     DISPLAY WS-MES AT 1033
		     WITH FOREGROUND-COLOR 3 HIGHLIGHT
			  BACKGROUND-COLOR 5.
005620 AF999-EXIT.
005630       EXIT.
      /
004830 AG000-CONTROL           SECTION.
004840 AG000-INIT.
004850       OPEN I-O NETWORK.
004860       MOVE 1              TO WS-NETKEY.
004870       READ NETWORK.
005550	     MOVE 1		 TO DEB-JOBNO DEB-PRTREQ.
	     MOVE "7.00"	 TO DEB-JVER.
005580       REWRITE NET-DEBTOR.
005590       MOVE WS-NETKEY TO WS-NUM. 
005600	     DISPLAY WS-NUM AT 0726 WITH FOREGROUND-COLOR 15.
001580	     DISPLAY "Updated" AT 0733
		     WITH FOREGROUND-COLOR 3 HIGHLIGHT
			  BACKGROUND-COLOR 5.
005920 AG999-EXIT.
005930       EXIT.
      /
004830 AH000-JOBAUD	       SECTION.
004840 AH000-INIT.
004850	     OPEN OUTPUT JOBAUD.
005610	     DISPLAY WS-MES AT 1133
		     WITH FOREGROUND-COLOR 3 HIGHLIGHT
			  BACKGROUND-COLOR 5.
005620 AH999-EXIT.
005630       EXIT.
      /
004830 AI000-JOBHDR	       SECTION.
004840 AI000-INIT.
004850	     OPEN OUTPUT JOBHDR.
005610	     DISPLAY WS-MES AT 1233
		     WITH FOREGROUND-COLOR 3 HIGHLIGHT
			  BACKGROUND-COLOR 5.
005620 AI999-EXIT.
005630       EXIT.
      /
004830 AJ000-JOBWAR	       SECTION.
004840 AJ000-INIT.
004850	     OPEN OUTPUT JOBWAR.
005610	     DISPLAY WS-MES AT 1333
		     WITH FOREGROUND-COLOR 3 HIGHLIGHT
			  BACKGROUND-COLOR 5.
005620 AJ999-EXIT.
005630       EXIT.
      /
004830 AK000-ITEMS	       SECTION.
004840 AK000-INIT.
004850	     OPEN OUTPUT ITEMS.
005610	     DISPLAY WS-MES AT 1433
		     WITH FOREGROUND-COLOR 3 HIGHLIGHT
			  BACKGROUND-COLOR 5.
005620 AK999-EXIT.
005630       EXIT.
      /
004830 AL000-JCPHST	       SECTION.
004840 AL000-INIT.
004850	     OPEN OUTPUT JCPHST.
005610	     DISPLAY WS-MES AT 1533
		     WITH FOREGROUND-COLOR 3 HIGHLIGHT
			  BACKGROUND-COLOR 5.
005620 AL999-EXIT.
005630       EXIT.
      /
004830 AM000-JCPLIN	       SECTION.
004840 AM000-INIT.
004850	     OPEN OUTPUT JCPLIN.
005610	     DISPLAY WS-MES AT 1633
		     WITH FOREGROUND-COLOR 3 HIGHLIGHT
			  BACKGROUND-COLOR 5.
005620 AM999-EXIT.
005630       EXIT.
      /
006170 AZ000-END               SECTION.
006180 AZ000-EOJ.
006260	     CLOSE JOBAUD
		   JOBCST
		   JOBHDR
		   JOBREQ
		   JOBRMK
		   JOBWAR
		   ITEMS
		   JCPHST
		   JCPLIN
                   PARAM
006280		   NETWORK
		   SECUR.
006310 AZ02.
006320	     DISPLAY "***** Initialization Complete ****" AT 1812
		     WITH FOREGROUND-COLOR 3 HIGHLIGHT
			  BACKGROUND-COLOR 5.
006350 AZ05.
	     STOP RUN.
